{
  "speakers": [
    {
      "enabled": "1",
      "name": "Venkat Subramaniam",
      "description": "Founder of Agile Developer, Inc.",
      "biography": "Dr. Venkat Subramaniam is an award-winning author, founder of Agile Developer, Inc., creator of agilelearner.com, and an instructional professor at the University of Houston. He has trained and mentored thousands of software developers in the US, Canada, Europe, and Asia, and is a regularly-invited speaker at several international conferences. Venkat helps his clients effectively apply and succeed with sustainable agile practices on their software projects. Venkat is a (co)author of multiple technical books, including the 2007 Jolt Productivity award winning book Practices of an Agile Developer. You can find a list of his books at agiledeveloper.com. You can reach him by email at venkats@agiledeveloper.com or on twitter at @venkat_s.",
      "image": "assets/img/speakers/venkat-subramaniam.jpg",
      "ref": "venkat",
       "url": "infoSpeaker.html?ref=venkat",
      "twitter": "http://twitter.com/venkat_s",
      "homepage": "http://agiledeveloper.com",
      "hasMoreTalks": "0",
      "talk": {
        "type": "talk",
        "title": "Welcome Keynote",
        "abstract": "Keynote TBD",
        "tags": [
        ],
        "level": "Intermediate",
        "video":""
      },
      "scheduleId": "#MON-TC1-SE1"
    },
    {
      "enabled": "1",
      "name": "Sandro Mancuso",
      "description": "Founder of Codurance and London Software Craftmanship Community",
      "biography": "Software craftsman, author, and founder of the London Software Craftsmanship Community (LSCC). Sandro has been coding since a very young age but only started his professional career in 1996. He has worked for startups, software houses, product companies, international consultancy companies, and investment banks. During his career Sandro had the opportunity to work in a good variety of projects, with different languages, technologies, and across many different industries. Sandro has a lot of experience in bringing the Software Craftsmanship ideology and Extreme Programming practices to organisations of all sizes. Sandro is internationally renowned by his work on evolving and spreading Software Craftsmanship and is frequently invited to speak in many conferences around the world. His professional aspiration is to raise the bar of the software industry by helping developers become better at and care more about their craft.",
      "image": "assets/img/speakers/sandro-mancuso.jpg",
      "ref": "sandro",
       "url": "infoSpeaker.html?ref=sandro",
      "twitter": "http://twitter.com/sandromancuso",
      "homepage": "https://codurance.com/blog/author/sandro-mancuso/",
      "hasMoreTalks": "0",
      "talk": {
        "type": "talk",
        "title": "Closing Keynote",
        "abstract": "Keynote TBD",
        "tags": [
        ],
        "level": "Intermediate",
        "video":""
      },
      "scheduleId": "#TUE-TC1-SE7"
    },
    {
      "enabled": "1",
      "name": "Trisha Gee",
      "description": "Developer Advocate at JetBrains",
      "biography": "Trisha has developed Java applications for a range of industries, including finance, manufacturing, software and non-profit, for companies of all sizes. She has expertise in Java high performance systems, is passionate about enabling developer productivity, and dabbles with Open Source development. Trisha is a leader of the Sevilla Java User Group, a MongoDB Master and a Java Champion. She believes we shouldn't all have to make the same mistakes again and again. She’s a Developer Advocate for JetBrains so she can share all the cool stuff she's discovered so far. Blog: http://www.trishagee.com",
      "image": "assets/img/speakers/trisha-gee.jpg",
      "ref": "trisha",
       "url": "infoSpeaker.html?ref=trisha",
      "twitter": "http://twitter.com/trisha_gee",
      "homepage": "http://www.trishagee.com",
      "hasMoreTalks": "0",
      "talk": {
        "type": "talk",
        "title": "TBD",
        "abstract": "TBD",
        "tags": [
        ],
        "level": "Intermediate",
        "video":""
      },
      "scheduleId": ""
    },
    {
      "enabled": "1",
      "name": "Bert Jan Schrijver",
      "description": "CTO at OpenValue",
      "biography": "Bert Jan is a software craftsman at JPoint in the Netherlands and CTO at OpenValue. His focus is on Java, Continuous Delivery and DevOps. He is User Group leader for NLJUG, the Dutch Java User Group and a JavaOne Rock Star speaker. He loves to share his experience by speaking at conferences, writing for the Dutch Java magazine and helping out Devoxx4Kids with teaching kids how to code.",
      "image": "assets/img/speakers/bert-jan-schrijver.jpg",
      "ref": "schrijver",
      "url": "infoSpeaker.html?ref=schrijver",
      "twitter": "https://twitter.com/bjschrijver",
      "homepage": "https://openvalue.nl",
      "hasMoreTalks": "0",
      "talk": {
        "type": "talk",
        "title": "Building microservices with Vert.x",
        "abstract": "Vert.x is a toolkit for building reactive applications on the JVM. It was awarded for 'Most Innovative Java Technology' at the JAX Innovation awards. Vert.x is event driven, non blocking and polyglot, which makes it an excellent platform for building microservices. In this talk, I’ll share experiences and real-world use cases from a Dutch company that started building reactive web applications with Vert.x about 4 years ago. You’ll learn the concepts behind Vert.x, why we chose Vert.x, how we’re using it and the challenges we faced. Topics include the anatomy of our projects, (micro)services architecture, deployment model and DevOps, scalability, the upgrade from Vert.x 2 to Vert.x 3 and cooperation with the team behind Vert.x. At the end of this session, you’ll know enough about Vert.x to get started yourself right away!",
        "tags": [
        ],
        "level": "Intermediate",
        "video":""
      },
      "scheduleId": ""
    },
    {
      "enabled": "1",
      "name": "Maarten Mulders",
      "description": "Enthusiastic senior developer and trainer",
      "biography": "Enthusiastic senior developer and trainer. Passionate about 'building the right thing' and 'building the thing right'. Seasoned in Java and JavaScript, recently entangled by Scala and Akka. Love to share new ideas and knowledge.",
      "image": "assets/img/speakers/maarten-mulders.jpg",
      "ref": "mmulders",
      "url": "infoSpeaker.html?ref=mmulders",
      "twitter": "https://twitter.com/mthmulders",
      "homepage": "https://maarten.mulders.tk",
      "hasMoreTalks": "0",
      "talk": {
        "type": "talk",
        "title": "How To Stay Responsive With 400 Backends",
        "abstract": "In these days of web scale and microservices, gracefully handling faulty or crashing backend web services becomes increasingly important. As long as your application uses just a handful of such backends, there’s no problem. But what if you have hundreds of them? How will you prevent your application from the negative effects of inevitable incidental crashes or timeouts when contacting other web services? In this talk, we’ll take a real-world example from a web scale system. This system is targeted at 10 million users and has around 400 heterogeneous backends. Akka and Scala power a system that is capable of running smoothly even when some backends might not be so stable.",
        "tags": [
        ],
        "level": "Advanced",
        "video":""
      },
      "scheduleId": ""
    }




  ]
}
