{
  "items": [
    {
      "enabled": "1",
      "name": "Mauricio Salatino",
      "company": "VMware",
      "description": "Staff Engineer",
      "biography": "<p>Mauricio is currently working at the Knative OSS Project as part of the VMWare MAPBU team. He is the author of the Continuous Delivery for Kubernetes book for Manning and he is passionate about Open Source, Cloud Native and Kubernetes. You can always get in touch with him via Twitter @Salaboy.</p>",
      "image": "assets/img/speakers/mauricio-salatino.jpg",
      "ref": "4b26a098aafaf6bc3d533389b61d3ef5ab01f5a3",
      "url": "infoSpeaker.html?ref=4b26a098aafaf6bc3d533389b61d3ef5ab01f5a3",
      "homepage": "http://salaboy.com",
      "twitter": "@salaboy",
      "linkedin": "http://linkedin.com/in/salaboy"
    },
    {
      "enabled": "1",
      "name": "Joaquin Azcarate",
      "company": "Dynatrace",
      "description": "Senior Software Engineer",
      "biography": "<p>I've experienced software development in various forms, from big telco to small startups, and many things in between.</p><p>I’ve also taught maths and programming. Was a mentor for new recruits, and a big part of the recruiting technical evaluations.</p><p>I enjoy functional programming, emojis, using tools in ways they were not intended, and language syntax. Only one of which is remotely useful.</p><p>Cat-daddy of two.</p>",
      "image": "assets/img/speakers/joaquin-azcarate.jpg",
      "ref": "114845540f08032641a03bf464caff7815303e5e",
      "url": "infoSpeaker.html?ref=114845540f08032641a03bf464caff7815303e5e",
      "homepage": "https://florius.com.ar/",
      "twitter": "https://twitter.com/floriuswastaken",
      "linkedin": "https://www.linkedin.com/in/joaquin-azcarate/"
    },
    {
      "enabled": "1",
      "name": "Erdem Günay",
      "company": "Layermark",
      "description": "CTO",
      "biography": "<p>Erdem Günay leads the product development at LayerMark as of January, 2021 mainly focusing on GIS based field mobility solutions for utility companies. He has 20+ years of backend development experience in enterprise applications. Spring fan, hands-on developer, founder of İstanbul Spring meetup group</p>",
      "image": "assets/img/speakers/erdem-gunay.jpg",
      "ref": "5a014096a2b2b36a9a4058dd045242f74f71d32a",
      "url": "infoSpeaker.html?ref=5a014096a2b2b36a9a4058dd045242f74f71d32a",
      "homepage": "https://www.layermark.com/",
      "twitter": "@gunayus",
      "linkedin": "https://www.linkedin.com/in/gunayus/"
    },
    {
      "enabled": "1",
      "name": "Holly Cummins",
      "company": "Red Hat",
      "description": "Senior Principal Software Engineer",
      "biography": "<p>Holly Cummins is a Senior Principal Software Engineer on the Red Hat Quarkus team. Before joining Red Hat, Holly was a long time IBMer. In her time at IBM, Holly has been a full-stack javascript developer, a WebSphere Liberty build architect, a client-facing consultant, a JVM performance engineer, and an innovation leader. During her time in the IBM Garage, Holly led projects for enormous banks, tiny startups, and everything in between. Holly has used the power of cloud to understand climate risks, count fish, help a blind athlete run ultra-marathons in the desert solo, and invent stories (although not at all the same time). Holly is also a Java Champion, author, and regular keynote speaker.</p>",
      "image": "assets/img/speakers/holly-cummins.jpg",
      "ref": "16b53ff6547870b3f9c9ef9f5eb97b015ba88e8b",
      "url": "infoSpeaker.html?ref=16b53ff6547870b3f9c9ef9f5eb97b015ba88e8b",
      "homepage": "https://hollycummins.com",
      "twitter": "@holly_cummins",
      "linkedin": "https://www.linkedin.com/in/holly-k-cummins/"
    },
    {
      "enabled": "1",
      "name": "Nate Schutta",
      "company": "VMware",
      "description": "Architect as a Service",
      "biography": "<p>Nathaniel T. Schutta is a software architect focused on cloud computing and building usable applications. A proponent of polyglot programming, Nate has written multiple books and appeared in various videos. He is a seasoned speaker, regularly presenting at conferences worldwide, No Fluff Just Stuff symposia, meetups, universities, and user groups. In addition to his day job, Nate is an adjunct professor at the University of Minnesota where he teaches students to embrace (and evaluate) technical change. Driven to rid the world of bad presentations, Nate co-authored the book Presentation Patterns (O’Reilly Media, 2016) with Neal Ford and Matthew McCullough. He also recently published Thinking Architecturally (O’Reilly Media, 2018), available as a free download from VMware.</p>",
      "image": "assets/img/speakers/nate-schutta.jpg",
      "ref": "ab822b577be6a2418593327d0530f2e48da634a4",
      "url": "infoSpeaker.html?ref=ab822b577be6a2418593327d0530f2e48da634a4",
      "homepage": "http://ntschutta.io",
      "twitter": "@ntschutta",
      "linkedin": ""
    },
    {
      "enabled": "1",
      "name": "Tim te Beek",
      "company": "JDriven",
      "description": "Senior Software Engineer",
      "biography": "<p>Senior software engineer who enjoys working with and contributing to Open Source such as Spring Boot, Kafka, WireMock, OpenRewrite and ArchUnit. When not at work you'll find me travelling, bouldering, snowboarding, surfing or at one of many cultural events around my home town or abroad.</p>",
      "image": "assets/img/speakers/tim-te-beek.jpeg",
      "ref": "77c600183db4294a11712dd71a78a680b7008818",
      "url": "infoSpeaker.html?ref=77c600183db4294a11712dd71a78a680b7008818",
      "homepage": "https://github.com/timtebeek",
      "twitter": "@timtebeek",
      "linkedin": "https://www.linkedin.com/in/timtebeek/"
    },
    {
      "enabled": "1",
      "name": "Thomas Vitale",
      "company": "Systematic",
      "description": "Software Architect",
      "biography": "<p>Thomas is a Software Architect specialized in building highly-scalable, resilient, and secure enterprise applications. He develops software solutions at Systematic, Denmark, where he’s been working on modernizing platforms and applications for the cloud-native world, focusing on developer experience and security. Thomas likes contributing to open-source projects like Spring Security and Spring Cloud. He’s the author of “Cloud Native Spring in Action - With Spring Boot and Kubernetes”, published by Manning, where some of his main interests converged, such as Kubernetes, Buildpacks, Knative, and other cloud-native technologies.</p>",
      "image": "assets/img/speakers/thomas-vitale.jpg",
      "ref": "311027298ebb9e1b88923214cff580786cf3d908",
      "url": "infoSpeaker.html?ref=311027298ebb9e1b88923214cff580786cf3d908",
      "homepage": "https://www.thomasvitale.com",
      "twitter": "@vitalethomas",
      "linkedin": "https://www.linkedin.com/in/vitalethomas/"
    },
    {
      "enabled": "1",
      "name": "David Gómez G.",
      "company": "AxonIQ",
      "description": "Developer advocate",
      "biography": "<p>With more than 20 years of experience in software development, has been part, lead, and developed projects for Banking, Insurance, Defense and Sea & ground transportation business. Aside from software development, he is also dedicated to training: a former Spring Certified instructor, he is delivering the JavaSpecialists Master courses for advanced Java topics in Spain. In fact, he has delivered more than 50 training courses all over Spain from 2009 to date. David is a JavaChampion since January 2020.</p>",
      "image": "assets/img/speakers/david-gomez.jpg",
      "ref": "9907d2fdf89356ee1bfc20234cf2ffa7316833c2",
      "url": "infoSpeaker.html?ref=9907d2fdf89356ee1bfc20234cf2ffa7316833c2",
      "homepage": "",
      "twitter": "@dgomezg",
      "linkedin": "https://www.linkedin.com/in/dgomezg/"
    },
    {
      "enabled": "1",
      "name": "Birgit Kratz",
      "company": "Birgit Kratz",
      "description": "Freelance",
      "biography": "<p>Birgit Kratz is a freelancing software developer and consultant, mainly in the Java ecosystem.</p><p>My domains as well as my passion are using agile development methods and spreading the software-crafting ideas.</p><p>This is why I'm a co-organizer of the German software crafting community (Softwerkskammer) events in Cologne and Düsseldorf for many years now.</p><p>To balance my job activities I ride my road bike quite extensively.</p>",
      "image": "assets/img/speakers/birgit.jpg",
      "ref": "333c3c7a68eddba59d67331ec6422d0092a814b3",
      "url": "infoSpeaker.html?ref=333c3c7a68eddba59d67331ec6422d0092a814b3",
      "homepage": "",
      "twitter": "@bikratz",
      "linkedin": "https://www.linkedin.com/in/birgit-kratz-567079204/"
    },
    {
      "enabled": "1",
      "name": "Simon Brown",
      "company": "Architectis",
      "description": "Independent Consultant",
      "biography": "<p>Simon is an independent consultant specialising in software architecture, and the author of “Software Architecture for Developers” (a developer-friendly guide to software architecture, technical leadership and the balance with agility). He is also the creator of the C4 model for visualising software architecture, and the founder of Structurizr. Simon is a regular speaker at international software development conferences, and travels the world to help organisations visualise and document their software architecture.</p>",
      "image": "assets/img/speakers/simonbrown.jpg",
      "ref": "a51f5e99c5211c81d99cd6f4e4217940c41e2d5d",
      "url": "infoSpeaker.html?ref=a51f5e99c5211c81d99cd6f4e4217940c41e2d5d",
      "homepage": "https://simonbrown.je/",
      "twitter": "@simonbrown",
      "linkedin": ""
    },
    {
      "enabled": "1",
      "name": "Milen Dyankov",
      "company": "AxonIQ",
      "description": "Developer Advocate",
      "biography": "<p>Milen is a Developer Advocate at AxonIQ on a mission to help fellow Java developers around the globe design and build clean, modular, and future-proof software! After more than 20 years of developing, designing, and consulting on various solutions for leading European companies, he currently spends most of his time supporting communities and organizations, speaking at conferences all over the world and researching his favorite topics around Java modularity, μservices, distributed systems architecture, and software craftsmanship.</p>",
      "image": "assets/img/speakers/milen.png",
      "ref": "24a5f774e105713678358ec00b22df50b32059df",
      "url": "infoSpeaker.html?ref=24a5f774e105713678358ec00b22df50b32059df",
      "homepage": "https://milendyankov.com/",
      "twitter": "@milendyankov",
      "linkedin": "https://www.linkedin.com/in/milendyankov"
    },
    {
      "enabled": "1",
      "name": "Andrzej Grzesik",
      "company": "Revolut",
      "description": "git operator",
      "biography": "<p>ags likes distributed systems in all shapes and form. Coding since the age of 8, loves simplicity and continuous delivery. While he has written in many languages, he favours the JVM. Since \"most software problems are people problems”, he stirs communities, organizes and speaks at conferences (proud to be a JavaONE Rockstar!). He is passionate about all things data, because science! In his spare time…cycling, photography and books. And he is a Java Champion!</p>",
      "image": "assets/img/speakers/andrzej-grzesik.jpeg",
      "ref": "222e9ee3f64709eb49f3299baaa4f39693e5fb82",
      "url": "infoSpeaker.html?ref=222e9ee3f64709eb49f3299baaa4f39693e5fb82",
      "homepage": "",
      "twitter": "ags313",
      "linkedin": ""
    },
    {
      "enabled": "1",
      "name": "Daniel Oh",
      "company": "Red Hat",
      "description": "Senior Principal Developer Advocate",
      "biography": "<p>Daniel Oh is a senior principal technical marketing manager at Red Hat to evangelize developers for building Cloud-Native Microservices and Serverless Functions with Cloud-Native Runtimes(i.e. Quarkus, Spring Boot, Node.js) and OpenShift/Kubernetes. Daniel also continues to contribute to various cloud open-source projects and ecosystems as a CNCF ambassador for accelerating DevOps adoption in enterprises. He's speaking at lots of technical seminars, workshops, and meetups to elaborate on new emerging technologies for enterprise developers & DevOps teams.</p>",
      "image": "assets/img/speakers/daniel-oh.jpeg",
      "ref": "772aed76233c2cc81c2c9787426760c125fbe421",
      "url": "infoSpeaker.html?ref=772aed76233c2cc81c2c9787426760c125fbe421",
      "homepage": "http://bit.ly/danielohtv",
      "twitter": "@danieloh30",
      "linkedin": "https://www.linkedin.com/in/daniel-oh-083818112/"
    },
    {
      "enabled": "1",
      "name": "Alex Soto Bueno",
      "company": "Red Hat",
      "description": "Director of Developer Experience",
      "biography": "<p>Alex Soto is a Director of Developer Experience at Red Hat. He is passionate about the Java world, software automation and he believes in the open-source software model. Alex is the co-author of Testing Java Microservices, Quarkus Cookbook, and Securing Kubernetes Secrets books, and a contributor to several open-source projects.</p><p>A Java Champion since 2017, he is also an international speaker, radio collaborator at Onda Cero, and teacher at Salle URL University.</p>",
      "image": "assets/img/speakers/alex-soto.jpg",
      "ref": "5c4dc84af05c736fb61555d97670869511e52764",
      "url": "infoSpeaker.html?ref=5c4dc84af05c736fb61555d97670869511e52764",
      "homepage": "",
      "twitter": "@alexsotob",
      "linkedin": ""
    },
    {
      "enabled": "1",
      "name": "Dmitry Aleksandrov",
      "company": "Sofia",
      "description": "Software Developer",
      "biography": "<p>Dmitry is a software developer at Oracle, Java Champion, Oracle Groundbreaker. Currently working on Project Helidon. He has more than a decade experience mainly in Java Enterprise in banking/telecom, but interested in dynamic languages on JVM and features like massive computations on GPUs. A true believer in open source and community driven initiatives. He is a co-lead of the Bulgarian Java User Group and co-organizer of jPrime Conf.</p><p>Dmitry is a blogger and also a frequent speaker at local events as well as conferences like JavaOne/CodeOne, Devoxx/Voxxed and Joker/JPoint.</p>",
      "image": "assets/img/speakers/dmitry-aleksandrov.jpg",
      "ref": "74479a1ccc69e03d3868de48e18a4d759165d326",
      "url": "infoSpeaker.html?ref=74479a1ccc69e03d3868de48e18a4d759165d326",
      "homepage": "",
      "twitter": "@bercut2000",
      "linkedin": "https://www.linkedin.com/in/dalexandrov/"
    },
    {
      "enabled": "1",
      "name": "Ixchel Ruiz",
      "company": "JFrog",
      "description": "DA - Senior Software Developer",
      "biography": "<p>Ixchel Ruiz has developed software applications and tools since 2000. Her research interests include Java, dynamic languages, client-side technologies, DevSecOps, and testing. A Java Champion, CD Foundation Ambassador, SuperFrog, Hackergarten enthusiast, open source advocate, public speaker, and mentor, Ixchel travels around the world (sometimes virtually) sharing knowledge—it’s one of her main drives in life.</p>",
      "image": "assets/img/speakers/ixchel-ruiz.jpeg",
      "ref": "2d9af6a2ba5f456c6f5b300bd82bd1c75b29da10",
      "url": "infoSpeaker.html?ref=2d9af6a2ba5f456c6f5b300bd82bd1c75b29da10",
      "homepage": "",
      "twitter": "@ixchelruiz",
      "linkedin": "https://www.linkedin.com/in/ixchelruiz"
    },
    {
      "enabled": "1",
      "name": "Heather VanCura",
      "company": "JCP/Oracle",
      "description": "Senior Director",
      "biography": "<p>Heather VanCura in the director and chairperson of the Java Community Process (JCP) program. In her role she is responsible for leadership of the community. In this role she also serves as an international speaker, mentor, and leader or hack days. VanCura oversees the work of the JCP executive committee, the JCP.org web site, JSR management, community building, events, communications, and growth of the membership. She is also a contributor and leader of community-driven education and adoption programs. She is the spec lead for JSRs as part of the ongoing JCP.Next effort to evolve the JCP itself. Heather is based in California, is passionate about Java, developer communities, and enjoys trying new sports and fitness activities in her free time.</p><p>@heathervc</p>",
      "image": "assets/img/speakers/heather-vancura.jpg",
      "ref": "cdb2f4341ae9909562e3f30b68c1d4ade0597c01",
      "url": "infoSpeaker.html?ref=cdb2f4341ae9909562e3f30b68c1d4ade0597c01",
      "homepage": "",
      "twitter": "@heathervc",
      "linkedin": ""
    },
    {
      "enabled": "1",
      "name": "Georgios Andrianakis",
      "company": "Red Hat",
      "description": "Principal Software Engineer",
      "biography": "<p>Georgios is part of the core Quarkus team, where he works on various areas, such REST Reactive, Spring support, Kubernetes support, testing, Kotlin among others</p>",
      "image": "assets/img/speakers/georgios.jpg",
      "ref": "7cff2b21cb47f910e18350c6497853c7daf32e09",
      "url": "infoSpeaker.html?ref=7cff2b21cb47f910e18350c6497853c7daf32e09",
      "homepage": "",
      "twitter": "geoand86",
      "linkedin": "https://www.linkedin.com/in/georgios-andrianakis/"
    },
    {
      "enabled": "1",
      "name": "Emily Jiang",
      "company": "IBM",
      "description": "Liberty Cloud Native Architect",
      "biography": "<p>Emily Jiang is a Java Champion. She is Liberty Cloud-Native Architect and Chief Advocate, Senior Technical Staff Member (STSM) in IBM, based at Hursley Lab in the UK. Emily is MicroProfile guru and has been working on MicroProfile since 2016 and leads a number of specifications including MicroProfile Config, Fault Tolerance and Service Mesh, as well as MicroProfile Starter. She also participates in other specifications such as MicroProfile Reactive Messaging, etc. She is active in Jakarta EE. She is a committer on a number of Jakarta EE specifications such as CDI, Interceptors and she is a co-lead on Jakarta Config.</p><p>She is passionate about MicroProfile and Jakarta EE. She regularly speaks at conferences, such as Code One, DevNexus, JAX London, Voxxed, Devoxx, EclipseCon, QCon, GeeCon, JFokus, etc. Follow her on Twitter @emilyfhjiang and/or connect with her on LinkedIn (https://www.linkedin.com/in/emilyfhjiang)</p>",
      "image": "assets/img/speakers/emily-jiang.png",
      "ref": "907ad623981c92e789c5b74ed8c18db8a0c1be71",
      "url": "infoSpeaker.html?ref=907ad623981c92e789c5b74ed8c18db8a0c1be71",
      "homepage": "",
      "twitter": "@emilyfhjiang",
      "linkedin": "https://www.linkedin.com/in/emilyfhjiang/"
    },
    {
      "enabled": "1",
      "name": "Josh Long",
      "company": "Tanzu, a division of VMware",
      "description": "Spring Developer Advocate",
      "biography": "<p>Josh (@starbuxman) has been the first Spring Developer Advocate since 2010. Josh is a Java Champion, author of 6 books (including O'Reilly's \"Cloud Native Java: Designing Resilient Systems with Spring Boot, Spring Cloud, and Cloud Foundry\" and \"Reactive Spring\") and numerous best-selling video training (including \"Building Microservices with Spring Boot Livelessons\" with Spring Boot co-founder Phil Webb), and an open-source contributor (Spring Boot, Spring Integration, Spring Cloud, Activiti and Vaadin, etc), a podcaster (\"A Bootiful Podcast\") and a YouTuber.</p>",
      "image": "assets/img/speakers/josh-1.jpg",
      "ref": "3803f8e428feb905178afd9025cfc53fb47a8abc",
      "url": "infoSpeaker.html?ref=3803f8e428feb905178afd9025cfc53fb47a8abc",
      "homepage": "https://joshlong.com/",
      "twitter": "@starbuxman",
      "linkedin": "linkedin.com/in/joshlong"
    },
    {
      "enabled": "1",
      "name": "Akshita Rastogi",
      "company": "commercetools",
      "description": "Technical Product Manager ",
      "biography": "<p>Akshita has always enjoyed dismantling concepts and frameworks to understand what is behind the beautiful abstraction she sees. Some things she could put back together, some were fated to fade away. In her professional career, she imbibed this trait and started off as a QA in a data security firm, then found herself wandering into the “Clouds,” and she knew that was something she admired. After taking up various challenges in different roles as a QA-Automation Engineer, DevOps Engineer, Cloud Consultant, Cloud Architect, and Product Owner, she realized that it was time to face new hurdles as a Technical Product Manager for Cloud Infrastructure & Tooling at commercetools.</p>",
      "image": "assets/img/speakers/Akshita Rastogi.jpg",
      "ref": "72036b8655975d50ae6e51b7e51402b767c06c0e",
      "url": "infoSpeaker.html?ref=72036b8655975d50ae6e51b7e51402b767c06c0e",
      "homepage": "",
      "twitter": "",
      "linkedin": "https://www.linkedin.com/in/akshita-rastogi-29b81412b/"
    },
    {
      "enabled": "1",
      "name": "Nicolai Parlog",
      "company": "Oracle",
      "description": "Java Developer Advocate",
      "biography": "<p>Nicolai (aka nipafx) is a Java enthusiast focused on language features and core APIs with a passion for learning and sharing - in articles, newsletters, and books; in tweets, videos, and streams; in demo repos and at conferences - more on all of that on nipafx.dev. He's a Java Developer Advocate at Oracle and organizer of Accento. That aside, he's best known for his haircut.</p>",
      "image": "assets/img/speakers/nicolai-parlog.jpg",
      "ref": "78328a04b91142ff18f2a8885d6ec99391906a66",
      "url": "infoSpeaker.html?ref=78328a04b91142ff18f2a8885d6ec99391906a66",
      "homepage": "https://nipafx.dev",
      "twitter": "@nipafx",
      "linkedin": ""
    },
    {
      "enabled": "1",
      "name": "Otavio Rodolfo Piske",
      "company": "Red Hat",
      "description": "Senior Software Engineer",
      "biography": "<p>Otavio is a Sr. Software Engineer at Red Hat where he works developing solutions for microservices, cloud and systems integration. He is a committer and a PMC member of the Apache Camel.</p>",
      "image": "assets/img/speakers/otavio-rodolfo.png",
      "ref": "cf874a75dcb4f22703fb632b069cd640aabbda7f",
      "url": "infoSpeaker.html?ref=cf874a75dcb4f22703fb632b069cd640aabbda7f",
      "homepage": "http://www.orpiske.net",
      "twitter": "@otavio021",
      "linkedin": "https://www.linkedin.com/in/orpiske/"
    },
    {
      "enabled": "1",
      "name": "Ivan Krylov",
      "company": "",
      "description": "Software enginner",
      "biography": "<p>Ivan Krylov is a JVM developer for the last 17 years, working in core JDK  teams in various companies. Ivan specializes in JIT compiler infrastructure and AOT compilation.</p>",
      "image": "assets/img/speakers/ivan_krylov.jpg",
      "ref": "eecf1fc106a3fda9197602173d272b9e3c7b8613",
      "url": "infoSpeaker.html?ref=eecf1fc106a3fda9197602173d272b9e3c7b8613",
      "homepage": "",
      "twitter": "@JohnWings",
      "linkedin": "www.linkedin.com/in/ivan-krylov-62b46a1"
    },
    {
      "enabled": "1",
      "name": "Andres Almiray",
      "company": "Oracle",
      "description": "Seasoned Sourceror",
      "biography": "<p>Andres is a Java/Groovy developer and a Java Champion with more than 20 years of experience in software design and development. He has been involved in web and desktop application development since the early days of Java. Andres is a true believer in open source and has participated on popular projects like Groovy, Griffon, and DbUnit, as well as starting his own projects (Json-lib, EZMorph, GraphicsBuilder, JideBuilder). Founding member of the Griffon framework and Hackergarten community event. You can find him on twitter too as @aalmiray. He likes to spend time with his beloved wife, Ixchel, when not hacking around.</p>",
      "image": "assets/img/speakers/andres-almiray.jpg",
      "ref": "17f50b47a57b0354999b00d372ac197a9452a7c1",
      "url": "infoSpeaker.html?ref=17f50b47a57b0354999b00d372ac197a9452a7c1",
      "homepage": "https://andresalmiray.com",
      "twitter": "@aalmiray",
      "linkedin": "https://www.linkedin.com/in/aalmiray/"
    },
    {
      "enabled": "1",
      "name": "Ben Evans",
      "company": "Red Hat",
      "description": "Senior Principal Software Engineer",
      "biography": "<p>Ben Evans is an author, architect and educator. He is currently Senior Principal Software Engineer at Red Hat. Previously he was Lead Architect for Instrumentation at New Relic, and co-founded jClarity, a performance tools startup acquired by Microsoft. He has also worked as Chief Architect for Listed Derivatives at Deutsche Bank and as Senior Technical Instructor for Morgan Stanley. He served for 6 years on the Java Community Process Executive Committee, helping define new Java standards. He is a Java Champion and 3-time JavaOne Rockstar Speaker.</p><p>Ben is the author of six books, including \"Optimizing Java\", the new editions of “Java in a Nutshell” and the recently-updated “The Well-Grounded Java Developer” and his technical articles are read by thousands of developers every month. Ben is a regular speaker and educator on topics such as the Java platform, systems architecture, performance and concurrency for companies and conferences all over the world (pandemic permitting).</p>",
      "image": "assets/img/speakers/ben-evans.jpg",
      "ref": "6d4ec093aeee2a5dde4bbce8e9698776ce7bd5b8",
      "url": "infoSpeaker.html?ref=6d4ec093aeee2a5dde4bbce8e9698776ce7bd5b8",
      "homepage": "https://kittylyst.com",
      "twitter": "@kittylyst",
      "linkedin": "https://www.linkedin.com/in/kittylyst/"
    },
    {
      "enabled": "1",
      "name": "Aurélie Vache",
      "company": "OVHcloud",
      "description": "DevRel",
      "biography": "<p>DevRel at OVHcloud in Toulouse, France. She is GDE (Google Developer Expert) for Cloud technologies, Docker captain, CNCF ambassador & Kubernetes for Developers certified. She has been working as a Developer and Ops for over 15 years. Cloud enthusiast and advocates DevOps/Cloud/Golang best practices.</p><p>One of the leaders of Duchess France, an association that promotes women developers and women working in IT.</p><p>Conferences and meetups organizer since 2016. Technical writer (dev.to/aurelievache), a book author & reviewer, a sketchnoter and a speaker at international conferences.</p><p>She created a new visual way for people to learn and understand Cloud technologies: \"Understanding Kubernetes/Istio/Docker in a visual way\" in sketchnotes and videos.</p><p>Blog: https://dev.to/aurelievache/</p><p>YouTube: https://www.youtube.com/c/AurelieVache</p>",
      "image": "assets/img/speakers/aurelie-vache.jpg",
      "ref": "f3a44479f0e0e748cca666a713d65df707eb5016",
      "url": "infoSpeaker.html?ref=f3a44479f0e0e748cca666a713d65df707eb5016",
      "homepage": "https://scraly.com",
      "twitter": "@aurelievache",
      "linkedin": "https://www.linkedin.com/in/aurelievache/"
    },
    {
      "enabled": "1",
      "name": "Graeme Rocher",
      "company": "Oracle",
      "description": "Architect",
      "biography": "<p>Graeme Rocher is the creator of several popular Open Source projects including Grails (https://grails.org) and Micronaut (https://Micronaut.io) and co-author of \"The Definitive Guide to Grails\" (Apress - http://apress.com/book/view/1590599950). Graeme currently works as an Architect at Oracle. Graeme is a member of the Java Champions (https://twitter.com/java_champions) and 2018 was awarded the Groundbreaker award by Oracle (https://developer.oracle.com/groundbreakers/) for his work on Open Source.</p>",
      "image": "assets/img/speakers/graeme-rocher.jpg",
      "ref": "6c31223d3be1de9ea66a96974ec4f524cd6a786f",
      "url": "infoSpeaker.html?ref=6c31223d3be1de9ea66a96974ec4f524cd6a786f",
      "homepage": "",
      "twitter": "@graemerocher",
      "linkedin": ""
    },
    {
      "enabled": "1",
      "name": "Tanja Obradovic",
      "company": "Eclipse Foundation",
      "description": "Jakarta EE Program Manager",
      "biography": "<p>Tanja Obradović is the Jakarta EE Program Manager at the Eclipse Foundation. Having been involved with Java and Java EE for quite some time, revitalizing Enterprise Java and making it ready for cloud-native application development with Jakarta EE open source specifications is something that she is very much interested in.</p>",
      "image": "assets/img/speakers/tanja.jpg",
      "ref": "851e5eddc5337f77150e3b753a676b412dab892a",
      "url": "infoSpeaker.html?ref=851e5eddc5337f77150e3b753a676b412dab892a",
      "homepage": "",
      "twitter": "@TanjaEclipse",
      "linkedin": "https://www.linkedin.com/in/tanja-obradovic-095604/"
    },
    {
      "enabled": "1",
      "name": "Pratik Patel",
      "company": "Azul Systems",
      "description": "Lead Developer Advocate",
      "biography": "<p>Pratik Patel is a Java Champion and developer advocate at Azul Systems. He wrote the first book on 'enterprise Java' in 1996, \"Java Database Programming with JDBC.\" An all around software and hardware enthusiast with experience in the healthcare, telecom, financial services, and startup sectors. Helps to organize the Atlanta Java User Group, frequent speaker at tech events, and master builder of nachos.</p>",
      "image": "assets/img/speakers/pratik-patel.png",
      "ref": "5c8cf21786cae4a337b4c305fe244359243ded67",
      "url": "infoSpeaker.html?ref=5c8cf21786cae4a337b4c305fe244359243ded67",
      "homepage": "https://prpatel.dev",
      "twitter": "@prpatel",
      "linkedin": "https://www.linkedin.com/in/prpatel/"
    },
    {
      "enabled": "1",
      "name": "Ivar Grimstad",
      "company": "Eclipse Foundation",
      "description": "Jakarta EE Developer Advocate",
      "biography": "<p>Ivar Grimstad is the Jakarta EE Developer Advocate at Eclipse Foundation. He is a Java Champion and JUG Leader based in Sweden.</p><p>Besides advocating the Jakarta EE technologies, Ivar is contributing to the Jakarta EE specifications as well as being the PMC Lead for Eclipse Enterprise for Java (EE4J). He is also one of the specification leads for Jakarta MVC and represents Eclipse Foundation in the JCP Executive Committee.</p><p>Ivar is also involved in MicroProfile, Apache NetBeans, and a wide range of other open-source projects and communities. He is a frequent speaker at International developer conferences.</p>",
      "image": "assets/img/speakers/ivar-grimstad.jpg",
      "ref": "d8b71cf333c0d6c1dd9126059adf41444e95a605",
      "url": "infoSpeaker.html?ref=d8b71cf333c0d6c1dd9126059adf41444e95a605",
      "homepage": "https://agilejava.eu",
      "twitter": "@ivar_grimstad",
      "linkedin": "https://www.linkedin.com/in/ivargrimstad/"
    },
    {
      "enabled": "1",
      "name": "Mario Gray",
      "company": "VMWare",
      "description": "Technical Advocate",
      "biography": "<p>Mario Gray is a Principal Technologist at VMware with over 20 years of experience in software development and software architecture. He is co-author of Apress's Pro Spring Integration. Stay tuned for the next installment. He’s helped organizations large and small build service-based architectures in a number of different runtimes and platforms over the decades, but adopting Spring in 2004, and using it whenever possible since, was a no-brainer that culminated in joining the Spring team in 2017. As a Spring Developer Advocate, Mario loves to engage and inspire developers and businesses in the VMware Tanzu ecosystem.</p>",
      "image": "assets/img/speakers/mario_v_gray.jpeg",
      "ref": "572abc9f31f717b714a59be353c58705853b3b81",
      "url": "infoSpeaker.html?ref=572abc9f31f717b714a59be353c58705853b3b81",
      "homepage": "https://www.sudoinit5.com",
      "twitter": "@mariogray",
      "linkedin": "https://www.linkedin.com/in/mario-gray-9b2139/"
    },
    {
      "enabled": "1",
      "name": "Isabella Karabasz",
      "company": "GFT",
      "description": "Data Scientist",
      "biography": "<p>Data scientist in GFT Group in the Artificial Intelligence Strategic Initiative team. ​</p><p>Graduated in Math and Physics with a Masters in Big Data, now is dedicated to developing machine learning models. Specialized in NLP, has worked on various projects like automated document processing and text classification. ​</p><p>Currently excited to grow in areas of MLOps and Data Engineering, and passionate about AI ethics and responsibility.</p>",
      "image": "assets/img/speakers/Isabella-Karabasz.png",
      "ref": "b3da9cdff962b1acbca9868acc10361463f07614",
      "url": "infoSpeaker.html?ref=b3da9cdff962b1acbca9868acc10361463f07614",
      "homepage": "",
      "twitter": "",
      "linkedin": "https://www.linkedin.com/in/isabella-karabasz-058477183/"
    },
    {
      "enabled": "1",
      "name": "Mary Grygleski",
      "company": "DataStax",
      "description": "Streaming Developer Advocate",
      "biography": "<p>Mary is a Java Champion and a passionate Senior Developer Advocate at DataStax, a leading data management company that champions Open Source software and specializes in Big Data, DB-as-a-service, Streaming, and Cloud-Native systems.  She spent 3.5 years previously as a very effective advocate at IBM, focusing on Java, Jakarta EE, OpenJ9, Open Source, Cloud, and Distributed Systems.  She transitioned from Unix/C to Java around 2000 and has never looked back since then.  She considers herself a polyglot and loves to continue learning new and better ways to solve real-life problems. She is an active tech community builder outside of her day job, and currently the President of the Chicago Java Users Group (CJUG), as well as a co-organizer for several IBM-sponsored meetup groups in the Greater Chicago area.</p>",
      "image": "assets/img/speakers/mary-grygleski.jpg",
      "ref": "443a683fa84a77151521434bf96a7a082d29d361",
      "url": "infoSpeaker.html?ref=443a683fa84a77151521434bf96a7a082d29d361",
      "homepage": "https://dev.to/mgrygles",
      "twitter": "@mgrygles",
      "linkedin": "https://www.linkedin.com/in/mary-grygleski"
    },
    {
      "enabled": "1",
      "name": "Zineb Bendhiba",
      "company": "Red Hat",
      "description": "Senior Software Engineer",
      "biography": "<p>Zineb Bendhiba is Senior Software Engineer at Red Hat. She is a committer and PMC member of the open source project Apache Camel. Currently, she mainly contributes to the Camel Quarkus project. In addition, she is a board member of DuchessFrance, a large Women In Tech community in France.</p>",
      "image": "assets/img/speakers/zineb-bendhiba.jpg",
      "ref": "92722ac8669606acafdd0895be1e8ee444b5fedc",
      "url": "infoSpeaker.html?ref=92722ac8669606acafdd0895be1e8ee444b5fedc",
      "homepage": "https://zinebbendhiba.com/",
      "twitter": "@ZinebBendhiba",
      "linkedin": "https://www.linkedin.com/in/zbendhiba"
    },
    {
      "enabled": "1",
      "name": "Alberto Salazar",
      "company": "Advance Latam ",
      "description": "CTO",
      "biography": "<p>Alberto Salazar is an entrepreneur, passionate Consultant, Java Champion, Oracle Groundbreaker Ambassador, JUG Leader, Auth0 Ambassador, founder of the Ecuador Java User Group, Java Community Process Associate Member and Java evangelist/trainer; active in twitter at @betoSalazar. He is the author of the book ‘Software Architecture with Spring 5.0’. Alberto has been working for more than 2 decades creating large scalable and high transaction load systems from military software to banking solutions. He is also a frequent speaker at Java conferences such as DevNexus, Oracle Code One, DevDays Europe, Voxxed Days, Oracle Code, Red Hat Summit, JavaOne, Oracle Developer Tour Latam, OTN Tours, and local JUG meetings.</p>",
      "image": "assets/img/speakers/alberto-salazar.png",
      "ref": "8096d60f578c4cc2c777f231d1dff6aa46f4457b",
      "url": "infoSpeaker.html?ref=8096d60f578c4cc2c777f231d1dff6aa46f4457b",
      "homepage": "https://lasalazarr.github.io/blog/",
      "twitter": "@betoSalazar",
      "linkedin": "https://www.linkedin.com/in/alberto-salazar-15334154"
    },
    {
      "enabled": "1",
      "name": "Grace Jansen",
      "company": "IBM",
      "description": "Developer Advocate",
      "biography": "<p>Grace is a Developer Advocate at IBM, working with Open Liberty, MicroProfile and Cloud Technologies. She has been with IBM since graduating from Exeter University with a Degree in Biology. Grace enjoys bringing a varied perspective to her projects and using her knowledge of biological systems to simplify complex software patterns and architectures. As a developer advocate, Grace builds POC’s, demos and sample applications, and writes guides and tutorials. She is a regular presenter at international technology conferences and has authored a book on reactive systems. Grace also has a keen passion for encouraging more women into STEM and especially Technology careers.</p>",
      "image": "assets/img/speakers/grace-jensen.jpg",
      "ref": "b21e540e924111f0e9d271ed82350fa020b9972e",
      "url": "infoSpeaker.html?ref=b21e540e924111f0e9d271ed82350fa020b9972e",
      "homepage": "",
      "twitter": "@gracejansen27",
      "linkedin": "https://www.linkedin.com/in/grace-jansen/"
    },
    {
      "enabled": "1",
      "name": "Soham Dasgupta",
      "company": "Capgemini Netherlands",
      "description": "Architect",
      "biography": "<p>A technology enthusiast working at Capgemini as a Solution Architect, with over 16 years of experience in software programming, designing, architecture which includes on-prem, cloud native applications and web based conversational application design.</p>",
      "image": "assets/img/speakers/soham-dasgupta.jpg",
      "ref": "dc7843096c80aaceb163e68b573a9c5618c9146a",
      "url": "infoSpeaker.html?ref=dc7843096c80aaceb163e68b573a9c5618c9146a",
      "homepage": "",
      "twitter": "@iamsoham",
      "linkedin": "https://www.linkedin.com/in/dasguptasoham/"
    },
    {
      "enabled": "1",
      "name": "Attila Mészáros",
      "company": "Red Hat",
      "description": "Principal Software Engineer",
      "biography": "<p>I'm Principal Software Engineer at Red Hat, creator and maintainer of Java Operator SDK. In a wider scope currently focusing on Java developer experience on Kubernetes. I'm a passionate Java developer but in addition to that last six years also focusing on server side solutions. As a freelancer I was also part of brilliant platform teams, building platforms mostly on top of Kuberentes/Openshift and AWS. I try to focus on the complete picture of the server side solutions.</p>",
      "image": "assets/img/speakers/attila-meszaros.jpeg",
      "ref": "508d77fd6c0d6171c5228adac3b440c1b4d2ad8a",
      "url": "infoSpeaker.html?ref=508d77fd6c0d6171c5228adac3b440c1b4d2ad8a",
      "homepage": "",
      "twitter": "https://twitter.com/csviri",
      "linkedin": "https://www.linkedin.com/in/attila-m%C3%A9sz%C3%A1ros-9464a645/"
    },
    {
      "enabled": "1",
      "name": "Guillem Plasencia Gallofré",
      "company": "Adaptive Financial Consulting",
      "description": "Senior software developer & Data scientist",
      "biography": "<p>I love to learn new things. During my years at the university, where I studied biochemistry I developed a deep interest in bioinformatics and programming, which I further cultured during my PhD by writing my first software program, used to analyze huge databases of expressed sequence tags (ESTs) and compare them to their respective genome sequences to search for new examples of the novel process of trans-splicing of messenger RNA. After my PhD. I realized I’d be happier programming and working with computers than in an experimental laboratory, and I joined a company where I developed my programming, data science and molecular modeling skills, and applied them to build predictive models and software programs for organic chemists in research departments of large pharmaceutical companies. Now, at Adaptive Financial Consulting, I develop and deploy cloud applications to trade financial instruments in highly performant and resilient cluster architectures.</p>",
      "image": "assets/img/speakers/guillem-plasencia.png",
      "ref": "1e65ff335ce12cb03cc2dc5130ad907c4d47da6f",
      "url": "infoSpeaker.html?ref=1e65ff335ce12cb03cc2dc5130ad907c4d47da6f",
      "homepage": "",
      "twitter": "@guillempg",
      "linkedin": "www.linkedin.com/in/guillem-plasencia-gallofre"
    },
    {
      "enabled": "1",
      "name": "Gerrit Grunwald",
      "company": "Azul Systems",
      "description": "Senior Developer Advocate",
      "biography": "<p>Gerrit Grunwald works as a Senior Developer Advocate at Azul Systems and loves all things Java. He is a true believer in open source and has participated in popular projects like JFXtras.org as well as his own projects (TilesFX, Medusa, Enzo, SteelSeries Swing, SteelSeries Canvas).</p><p>Gerrit blogs at http://harmonic-code.org and https://foojay.io, he is an active member of the Java community, where he founded and leads the Java User Group Münster (Germany), he is a JavaOne rockstar and a Java Champion. He is a speaker at conferences and user groups internationally and writes for several magazines.</p>",
      "image": "assets/img/speakers/gerrit-grunwald.png",
      "ref": "e5979093f4775ff480701b323ef5f347812a3ce0",
      "url": "infoSpeaker.html?ref=e5979093f4775ff480701b323ef5f347812a3ce0",
      "twitter": "https://twitter.com/hansolo_"
    },
    {
      "enabled": "1",
      "name": "Shabnam Mayel",
      "company": "Eclipse Foundation",
      "description": "Senior Marketing Manager",
      "biography": "<p>Shabnam Mayel is the Senior Marketing Manager, Cloud Native Java at the Eclipse Foundation. She is an accomplished marketing and business development professional with over 10 years of experience in marketing leadership, brand activation, and management in Southeast Asia and North America. She has a particular interest in open-source and tech-based organizations.</p>",
      "image": "assets/img/speakers/shabnam.jpg",
      "ref": "62c17e6d66e07f62fd2ca8b6c0e073950d56a55e",
      "url": "infoSpeaker.html?ref=62c17e6d66e07f62fd2ca8b6c0e073950d56a55e",
      "homepage": "",
      "twitter": "@MayelShabnam",
      "linkedin": "https://www.linkedin.com/in/shabnam-mayel/"
    },
    {
      "enabled": "1",
      "name": "Alberto Portilla Casado",
      "company": "Wallapop",
      "description": "Backend Tech Lead",
      "biography": "<p>Alberto es backend Tech lead en Wallapop. Comenzó siendo frontend dev hace más de 10 años y ha desarrollado en varios idiomas y stacks, siendo ahora backend su stack preferido. Amante de los problemas complejos y de pulsar la hotkey de step-into para bucear en códigos para descubrir por qué un pool tiene un leak o por que ha tenido que subir el heap de su proceso en 500mb.</p><p>Comer una buena hamburguesa y disfrutar de la compañía de sus gatos son dos de las cosas que más aprecia de su tiempo libre.</p>",
      "image": "assets/img/speakers/alberto-portilla.jpeg",
      "ref": "1fdb348ad3d0b80f86295945a9eb2069a03e6d50",
      "url": "infoSpeaker.html?ref=1fdb348ad3d0b80f86295945a9eb2069a03e6d50",
      "homepage": "",
      "twitter": "",
      "linkedin": "https://www.linkedin.com/in/alberto-portilla-casado-5a449990/"
    },
    {
      "enabled": "1",
      "name": "Steve Poole",
      "company": "Sonatype",
      "description": "Developer Advocate ",
      "biography": "<p>Developer Advocate, Security Champion, DevOps practitioner (whatever that means) Long time  Java developer, leader and evangelist. I’ve been working on  Java SDKs and JVMs since Java was less than 1.  JavaOne Rockstar,  JSR leader and representation, Committer on  open source projects including ones at Apache, Eclipse and OpenJDK.  A seasoned speaker and regular presenter at international conferences on technical and software engineering topics.</p>",
      "image": "assets/img/speakers/steve-poole.jpg",
      "ref": "5656dc7f3ecb7ca028ff6382f862467404769dfa",
      "url": "infoSpeaker.html?ref=5656dc7f3ecb7ca028ff6382f862467404769dfa",
      "homepage": "",
      "twitter": "@spoole167",
      "linkedin": "https://www.linkedin.com/in/noregressions/"
    },
    {
      "enabled": "1",
      "name": "Edoardo Vacchi",
      "company": "Red Hat",
      "description": "Principal Software Engineer",
      "biography": "<p>During my PhD I researched language design and implementation at University of Milan. After three years at UniCredit Bank’s R&D department, I have joined Red Hat in the KIE group. My current work is mainly on the Drools rules engine and the Kogito project.</p>",
      "image": "assets/img/speakers/edoardo-vacchi.png",
      "ref": "2b7ec441cce9bb5ab34f86732420a111c517420a",
      "url": "infoSpeaker.html?ref=2b7ec441cce9bb5ab34f86732420a111c517420a",
      "homepage": "https://evacchi.github.io",
      "twitter": "@evacchi",
      "linkedin": "https://www.linkedin.com/in/edoardovacchi/"
    },
    {
      "enabled": "1",
      "name": "Sergio del Amo",
      "company": "Object Computing",
      "description": "Developer Advocate",
      "biography": "<p>I am a Distinguished Engineer at Object Computing where I work as Developer advocate for Micronaut and Grails frameworks and the Apache Groovy programming language.</p><p>I am a core developer of the Micronaut Framework since its inception. I write / review most of the Micronaut Guides. I work a lot in the Security, AWS, Views, RSS, Problem+JSON, Email, Micronaut's modules.</p><p>Moreover, I have worked a lot with Grails Framework. I have contributed to the framework core code, plugins and guides.</p>",
      "image": "assets/img/speakers/sergio-del-amo.jpg",
      "ref": "594e335548f1564c9d8057f7b0098872db39f5df",
      "url": "infoSpeaker.html?ref=594e335548f1564c9d8057f7b0098872db39f5df",
      "homepage": "https://sergiodelamo.com",
      "twitter": "@sdelamo",
      "linkedin": "https://www.linkedin.com/in/sergiodelamo/"
    },
    {
      "enabled": "1",
      "name": "Rustam Mehmandarov",
      "company": "Computas",
      "description": "Chief Engineer",
      "biography": "<p>Rustam Mehmandarov is a passionate computer scientist. Java Champion ​and Google Developer Expert (GDE) ​for Cloud. Public speaker.</p>",
      "image": "assets/img/speakers/rustam-mehmandarov.jpg",
      "ref": "72b36c4f06a1b0211e42921b9815136568fa1b73",
      "url": "infoSpeaker.html?ref=72b36c4f06a1b0211e42921b9815136568fa1b73",
      "homepage": "https://mehmandarov.com/",
      "twitter": "@RMehmandarov",
      "linkedin": ""
    },
    {
      "enabled": "1",
      "name": "Jakub Pilimon",
      "company": "VMware",
      "description": "Developer Advocate",
      "biography": "<p>Jakub Pilimon is a Staff Technologist at VMware, blogger, programmer, and trainer. His main duty is to tackle complex enterprises with Domain-Driven Design and to propose a model and architecture that solves a problem. Sometimes he is involved in refactoring projects. When he isn’t coding, you can find him riding his bike, reading, or practicing kitesurfing.</p>",
      "image": "assets/img/speakers/jakub-pilimon.jpg",
      "ref": "8730b5530ca70d453220ebfa9278c051d0492045",
      "url": "infoSpeaker.html?ref=8730b5530ca70d453220ebfa9278c051d0492045",
      "homepage": "https://tanzu.vmware.com/developer/team/jakub-pilimon/",
      "twitter": "@JakubPilimon",
      "linkedin": ""
    },
    {
      "enabled": "1",
      "name": "Horacio Gonzalez",
      "company": "OVHcloud",
      "description": "DevRel Leader",
      "biography": "<p>Spaniard lost in Brittany, coder, speaker, dreamer and all-around geek.</p><p>After some years as Warp 10 frontend leader as Cityzen Data (now SenX), Horacio works as DevRel Leader at OVHcloud. He is the co-founder and leader of the @FinistDevs and @RdvSpeakers communities.</p><p>Horacio is a Google Developer Expert (GDE) in Web Technologies and Flutter. He loves web development in general and everything around Web Components and standards web in particular.</p>",
      "image": "assets/img/speakers/horacio-gonzalez.jpg",
      "ref": "e2f19f832dda1ec89c3019769e30a7d00f564198",
      "url": "infoSpeaker.html?ref=e2f19f832dda1ec89c3019769e30a7d00f564198",
      "homepage": "",
      "twitter": "@lostInBrittany",
      "linkedin": "https://www.linkedin.com/in/horaciogonzalez/"
    },
    {
      "enabled": "1",
      "name": "Adrián Romero Martin",
      "company": "Wallapop",
      "description": "Software Engineer",
      "biography": "<p>Adrián es Software Engineer en Wallapop desde hace 3 años, donde ha formado parte de varios equipos e iniciativas, entre las más destacadas Transaction tracking y Search Alerts.</p><p>Tiene gran interés en discusiones sobre diseño, testing y escalabilidad. Lleva trabajando casi 10 años  con lenguajes de la JVM, en los que empezó a interesarse tras leer Effective Java y Java concurrency in practice.</p><p>Además del software, le apasiona la guitarra, particularmente el flamenco, el deporte y la gastronomía.</p>",
      "image": "assets/img/speakers/adrian-romero.jpeg",
      "ref": "86e816de6f93283ebd9797c0b9272a6e4850d088",
      "url": "infoSpeaker.html?ref=86e816de6f93283ebd9797c0b9272a6e4850d088",
      "homepage": "",
      "twitter": "",
      "linkedin": "https://www.linkedin.com/in/adriromero/"
    },
    {
      "enabled": "1",
      "name": "María Arias de Reyna Domínguez",
      "company": "Red Hat",
      "description": "Senior Software Engineer",
      "biography": "<p>María Arias de Reyna is a Java Champion, geospatial enthusiast and FLOSS advocator. She has been a community leader and core maintainer of several free and open source projects since 2004. She is currently working at Red Hat where she focuses on Middleware and leads the development of Kaoto, an Apache Camel visual editor.</p><p>María is an experienced keynoter and speaker. Between 2017 and 2019 María was the elected President of OSGeo, the Open Source Geospatial Foundation which serves as an umbrella for the most used geospatial free and open source software. She is also well known as a feminist and Women In Tech activist.</p>",
      "image": "assets/img/speakers/maria-arias-reyna.webp",
      "ref": "54502dffd46874a385c1e0c37cea135bc9240db3",
      "url": "infoSpeaker.html?ref=54502dffd46874a385c1e0c37cea135bc9240db3",
      "homepage": "https://delawen.com",
      "twitter": "@delawen",
      "linkedin": "https://www.linkedin.com/in/delawen/"
    },
    {
      "enabled": "1",
      "name": "Ko Turk",
      "company": "adesso",
      "description": "Java Developer",
      "biography": "<p>Ko Turk is an experienced developer working for adesso. He is focussing on Java, Kotlin and isn't afraid to code in Typescript.</p><p>He likes to write articles for the Dutch NLJUG JavaMagazine. Also he is regularly speaking at international conferences about</p><p>Apache Kafka Streams, Micrometer and Kotlin. Because he doesn't like bull it slide presentations, you can find him (live) coding at stage.</p><p>You can also find him at the UtrechtJUG and love to have a chat!</p><p>He is always available at Twitter @KoTurk77</p>",
      "image": "assets/img/speakers/ko-turk.jpg",
      "ref": "98d92074e12051b600499049a3773caf3fc5dd60",
      "url": "infoSpeaker.html?ref=98d92074e12051b600499049a3773caf3fc5dd60",
      "homepage": "",
      "twitter": "@KoTurk77",
      "linkedin": "https://github.com/KoTurk"
    },
    {
      "enabled": "1",
      "name": "Noa Goldman",
      "company": "Rookout",
      "description": "Product Manager",
      "biography": "<p>Noa is Rookout’s Product Manager. Having been a developer for eight years, her goal in life now is to take complicated technology and products and simplify it to the point that anyone can understand and use it. In her free time, you can find her training at her local CrossFit gym, giving a talk at a conference, or eating a bowl of raw cookie dough.</p>",
      "image": "assets/img/speakers/noah-goldman.jpeg",
      "ref": "14af727ca8fe920d4fb467b94577c62a09ca62a8",
      "url": "infoSpeaker.html?ref=14af727ca8fe920d4fb467b94577c62a09ca62a8",
      "homepage": "",
      "twitter": "",
      "linkedin": "https://www.linkedin.com/in/goldmanoa/"
    },
    {
      "enabled": "1",
      "name": "Viktor Farcic",
      "company": "Upbound",
      "description": "Developer Advocate",
      "biography": "<p>Viktor Farcic is a Developer Advocate at Upbound, a member of the Google Developer Experts, CDF Ambassadors, and Docker Captains groups, and a published author.</p><p>His big passions are DevOps, GitOps, Microservices, Continuous Integration, Delivery and Deployment (CI/CD), and Test-Driven Development (TDD).</p><p>He often speaks at community gatherings and conferences.</p><p>He is a host of the YouTube channel DevOps Toolkit and a co-host of DevOps Paradox. He published The DevOps Toolkit Series and Test-Driven Java Development.</p>",
      "image": "assets/img/speakers/viktor-farcic.jpg",
      "ref": "0ba89c51baf9f8542188bd750973e0767fbcaa68",
      "url": "infoSpeaker.html?ref=0ba89c51baf9f8542188bd750973e0767fbcaa68",
      "homepage": "https://www.devopstoolkitseries.com",
      "twitter": "@vfarcic",
      "linkedin": "https://www.linkedin.com/in/viktorfarcic"
    },
    {
      "enabled": "1",
      "name": "Brian Vermeer",
      "company": "Snyk",
      "description": "Sr. Developer Advocat & Java Champion",
      "biography": "<p>Brian Vermeer is a well-known person in the Java community. He is a Developer Advocate for Snyk, Java Champion, and Software Engineer with over a decade of hands-on experience in creating and maintaining (web)applications. He is passionate about Java, (Pure) Functional Programming and Cybersecurity. Brian is a JUG leader for the Virtual JUG and the NLJUG. He also co-leads the DevSecCon community and is a community manager for Foojay. He is a regular international speaker on mostly Java-related conferences like JavaOne, Devnexus, Devoxx, Jfokus, JavaZone and many more. Besides all that, Brian is a military reserve for the Royal Netherlands Air Force and a Taekwondo Master / Teacher.</p>",
      "image": "assets/img/speakers/brian-vermeer.jpg",
      "ref": "a4529dc3081fc5242a51aecadc114b5ff5aa1520",
      "url": "infoSpeaker.html?ref=a4529dc3081fc5242a51aecadc114b5ff5aa1520",
      "homepage": "https://brianvermeer.nl/",
      "twitter": "@BrianVerm",
      "linkedin": "https://www.linkedin.com/in/brianvermeer/"
    },
    {
      "enabled": "1",
      "name": "Whitney Lee",
      "company": "VMware",
      "description": "Staff Developer Advocate",
      "biography": "<p>Whitney is a Staff Developer Advocate at VMware. She traveled the scenic route but is chuffed to have found her way to Kubernetes & cloud technologies. Whitney began her professional career as a fine artist before owning her own photography business for over a decade. After a year-long tour playing in the band Mutual Benefit, Whitney went back to school in 2019 to learn full-stack web development. After graduation, Whitney was employed by IBM as a cloud developer, using none of the skills she had just learned. She developed an insatiable appetite for all things cloud, and a passion for teaching others as she acquired knowledge herself. Whitney has made many cloud-related lightboard videos that together have 300,000+ views. Whitney’s contagious excitement drives her to collaborate and play!</p>",
      "image": "assets/img/speakers/whitney-lee.jpg",
      "ref": "576aeba6a8ebcbe244cc16bd0f973593673cc530",
      "url": "infoSpeaker.html?ref=576aeba6a8ebcbe244cc16bd0f973593673cc530",
      "homepage": "https://tanzu.vmware.com/developer/team/whitney-lee/",
      "twitter": "@wiggitywhitney",
      "linkedin": "https://www.linkedin.com/in/whitneylee/"
    },
    {
      "enabled": "1",
      "name": "Justin Reock",
      "company": "Gradle Inc",
      "description": "Field CTO and Chief Evangelist ",
      "biography": "<p>Justin Reock is the Chief Evangelist and Field CTO of Gradle Enterprise, and is an outspoken blogger, speaker, and free software evangelist. He has over 20 years of experience working in various software roles and has delivered enterprise solutions, technical leadership, and community education on a range of topics.</p>",
      "image": "assets/img/speakers/justin-reock.jpg",
      "ref": "1eb862c7a058f67d5b1e4fcd98fa2d2ce12fe5c0",
      "url": "infoSpeaker.html?ref=1eb862c7a058f67d5b1e4fcd98fa2d2ce12fe5c0",
      "homepage": "",
      "twitter": "@spoole167",
      "linkedin": "https://www.linkedin.com/in/justinreock/"
    },
    {
      "enabled": "1",
      "name": "Maarten Mulders",
      "company": "Info Support",
      "description": "IT Architect",
      "biography": "<p>Passionate architect, senior developer and trainer at Info Support. Also Oracle Groundbreaker Ambassador. I'm eager about \"building the right thing\" and \"building the thing right\". I focus on lean and elegant solutions, and I love to share new ideas and knowledge. Outside work, I appreciate crafting and eating good food, photography, and music, in no particular order.</p>",
      "image": "assets/img/speakers/maarten-mulders.png",
      "ref": "f33256b1512b570f58cde29c69166d0fab470334",
      "url": "infoSpeaker.html?ref=f33256b1512b570f58cde29c69166d0fab470334",
      "homepage": "https://maarten.mulders.it",
      "twitter": "@mthmulders",
      "linkedin": "https://www.linkedin.com/in/mthmulders/"
    },
    {
      "enabled": "1",
      "name": "Ana-Maria Mihalceanu",
      "company": "Red Hat",
      "description": "Developer Advocate",
      "biography": "<p>Ana is a Java Champion, Developer Advocate at Red Hat, co-founder of Bucharest Software Craftsmanship Community, and a constant adopter of challenging technical scenarios involving Java-based frameworks and multiple cloud providers. She actively supports technical communities’ growth through knowledge sharing and enjoys curating content for conferences as a program committee member.</p>",
      "image": "assets/img/speakers/ana-maria-mihalceanu.jpg",
      "ref": "959143ffd6c954e5e544cdce71383429895e3679",
      "url": "infoSpeaker.html?ref=959143ffd6c954e5e544cdce71383429895e3679",
      "homepage": "",
      "twitter": "@ammbra1508",
      "linkedin": ""
    },
    {
      "enabled": "1",
      "name": "Olena Kutsenko",
      "company": "Aiven",
      "description": "Developer Advocate",
      "biography": "<p>Olena is a software engineer and a developer advocate currently working at Aiven. She is passionate about open source, data, sustainable software development and team work. Her knowledge is shaped by expertise she acquired working in such companies as Nokia, HERE Technologies and AWS and now Aiven; and from the countries she was lucky to live in - Ukraine, Sweden, Spain and Germany.</p>",
      "image": "assets/img/speakers/olena-kutsenko.jpg",
      "ref": "f86ffeacee17037b8e78ba1a94e99659035eee78",
      "url": "infoSpeaker.html?ref=f86ffeacee17037b8e78ba1a94e99659035eee78",
      "homepage": "",
      "twitter": "@OlenaKutsenko",
      "linkedin": "https://www.linkedin.com/in/olenakutsenko/"
    },
    {
      "enabled": "1",
      "name": "Billy Korando",
      "company": "Oracle",
      "description": "Java Developer Advocate",
      "biography": "<p>Billy is a Java Developer Advocate with the Java Platform Group at Oracle. With over a decade of experience in Java, Billy brings a passion for helping developers find ways to reduce tedious work; such as project initiation, deployment, testing and validation, through automation and adopting the latest features and tools in the Java ecosystem. Outside of work Billy enjoys traveling, playing kickball, and cheering on the Kansas City Chiefs. Billy also co-organizes the Kansas City Java users group.</p>",
      "image": "assets/img/speakers/billy-korando.jpg",
      "ref": "459fc7466dfa9163817d35cc884ca96e154c2420",
      "url": "infoSpeaker.html?ref=459fc7466dfa9163817d35cc884ca96e154c2420",
      "homepage": "",
      "twitter": "@BillyKorando",
      "linkedin": ""
    },
    {
      "enabled": "1",
      "name": "Brian Benz",
      "company": "Microsoft",
      "description": "Cloud Advocate",
      "biography": "<p>Brian is a Java Champion and a Cloud Advocate at Microsoft, helping developers get the most out of Java on Azure. Before Joining Microsoft, he was a program manager, evangelist, solution architect, consultant, developer, and author at IBM, Deloitte, and other companies. Find him on Twitter @bbenz.</p>",
      "image": "assets/img/speakers/brian-benz.jpg",
      "ref": "836bf32dd2283312420733bcbb619965af16ee57",
      "url": "infoSpeaker.html?ref=836bf32dd2283312420733bcbb619965af16ee57",
      "homepage": "https://www.brianbenz.com/",
      "twitter": "@bbenz",
      "linkedin": "https://www.linkedin.com/in/brianbenz/"
    }
  ]
}
