{
  "items": [
    {
      "enabled": "1",
      "name": "Dmitry Aleksandrov",
      "company": "Sofia",
      "description": "Software Developer",
      "biography": "Dmitry is a software developer at Oracle, Java Champion, Oracle Groundbreaker. Currently working on Project Helidon. He has more than a decade experience mainly in Java Enterprise in banking/telecom, but interested in dynamic languages on JVM and features like massive computations on GPUs. A true believer in open source and community driven initiatives. He is a co-lead of the Bulgarian Java User Group and co-organizer of jPrime Conf. \nDmitry is a blogger and also a frequent speaker at local events as well as conferences like JavaOne/CodeOne, Devoxx/Voxxed and Joker/JPoint.\n",
      "image": "assets/img/speakers/dmitry-aleksandrov.jpg",
      "ref": "74479a1ccc69e03d3868de48e18a4d759165d326",
      "url": "infoSpeaker.html?ref=74479a1ccc69e03d3868de48e18a4d759165d326",
      "homepage": "",
      "twitter": "@bercut2000",
      "linkedin": "https://www.linkedin.com/in/dalexandrov/"
    },
    {
      "enabled": "1",
      "name": "Ko Turk",
      "company": "Blue4IT",
      "description": "Java Developer",
      "biography": "Hi my name is Ko Turk and I am a Senior Java Developer at Blue4IT! \nI am working as a Fullstack engineer, creating microservices and building awesome frontend applications. \nAs a speaker I am talking at conferences (like JavaZone, DevNexus and JFall) and JUGs about Micrometer and IDEs. \nI really like live-coding, there's no better way to learn. \n\nIf you have some questions, don't hesitate to contact me through (Twitter @KoTurk77).",
      "image": "assets/img/speakers/ko-turk.jpg",
      "ref": "98d92074e12051b600499049a3773caf3fc5dd60",
      "url": "infoSpeaker.html?ref=98d92074e12051b600499049a3773caf3fc5dd60",
      "homepage": "",
      "twitter": "@KoTurk77",
      "linkedin": "https://github.com/KoTurk"
    },
    {
      "enabled": "1",
      "name": "Pratik Patel",
      "company": "Azul Systems",
      "description": "Lead Developer Advocate",
      "biography": "Pratik Patel is a Java Champion and developer advocate at Azul Systems. He wrote the first book on 'enterprise Java' in 1996, \"Java Database Programming with JDBC.\" An all around software and hardware enthusiast with experience in the healthcare, telecom, financial services, and startup sectors. Helps to organize the Atlanta Java User Group, frequent speaker at tech events, and master builder of nachos.",
      "image": "assets/img/speakers/pratik-patel.png",
      "ref": "5c8cf21786cae4a337b4c305fe244359243ded67",
      "url": "infoSpeaker.html?ref=5c8cf21786cae4a337b4c305fe244359243ded67",
      "homepage": "https://prpatel.dev",
      "twitter": "@prpatel",
      "linkedin": "https://www.linkedin.com/in/prpatel/"
    },
    {
      "enabled": "1",
      "name": "Viktor Farcic",
      "company": "Upbound",
      "description": "Developer Advocate",
      "biography": "Viktor Farcic is a Developer Advocate at Upbound, a member of the Google Developer Experts, CDF Ambassadors, and Docker Captains groups, and a published author.\n\nHis big passions are DevOps, GitOps, Microservices, Continuous Integration, Delivery and Deployment (CI/CD), and Test-Driven Development (TDD).\n\nHe often speaks at community gatherings and conferences.\n\nHe is a host of the YouTube channel DevOps Toolkit and a co-host of DevOps Paradox. He published The DevOps Toolkit Series and Test-Driven Java Development.",
      "image": "assets/img/speakers/viktor-farcic.jpg",
      "ref": "0ba89c51baf9f8542188bd750973e0767fbcaa68",
      "url": "infoSpeaker.html?ref=0ba89c51baf9f8542188bd750973e0767fbcaa68",
      "homepage": "https://www.devopstoolkitseries.com",
      "twitter": "@vfarcic",
      "linkedin": "https://www.linkedin.com/in/viktorfarcic"
    },
    {
      "enabled": "1",
      "name": "Mauricio Salatino",
      "company": "VMware",
      "description": "Staff Engineer",
      "biography": "Mauricio is currently working at the Knative OSS Project as part of the VMWare MAPBU team. He is the author of the Continuous Delivery for Kubernetes book for Manning and he is passionate about Open Source, Cloud Native and Kubernetes. You can always get in touch with him via Twitter @Salaboy. ",
      "image": "assets/img/speakers/mauricio-salatino.jpg",
      "ref": "4b26a098aafaf6bc3d533389b61d3ef5ab01f5a3",
      "url": "infoSpeaker.html?ref=4b26a098aafaf6bc3d533389b61d3ef5ab01f5a3",
      "homepage": "http://salaboy.com",
      "twitter": "@salaboy",
      "linkedin": "http://linkedin.com/in/salaboy"
    },
    {
      "enabled": "1",
      "name": "Holly Cummins",
      "company": "IBM",
      "description": "Innovation Leader",
      "biography": "Holly Cummins is a Senior Technical Staff Member and Innovation Leader at IBM, as well as a Java Champion and author. Holly has led projects for enormous banks, tiny startups, and everything in between. Holly has used the power of cloud to understand climate risks, count fish, help a blind athlete run ultra-marathons in the desert solo, and invent stories (although not at all the same time).",
      "image": "assets/img/speakers/holly-cummins.jpg",
      "ref": "16b53ff6547870b3f9c9ef9f5eb97b015ba88e8b",
      "url": "infoSpeaker.html?ref=16b53ff6547870b3f9c9ef9f5eb97b015ba88e8b",
      "homepage": "https://hollycummins.com",
      "twitter": "@holly_cummins",
      "linkedin": "https://www.linkedin.com/in/holly-k-cummins/"
    },
    {
      "enabled": "1",
      "name": "Nate Schutta",
      "company": "VMware",
      "description": "Architect as a Service",
      "biography": "Nathaniel T. Schutta is a software architect focused on cloud computing and building usable applications. A proponent of polyglot programming, Nate has written multiple books and appeared in various videos. He is a seasoned speaker, regularly presenting at conferences worldwide, No Fluff Just Stuff symposia, meetups, universities, and user groups. In addition to his day job, Nate is an adjunct professor at the University of Minnesota where he teaches students to embrace (and evaluate) technical change. Driven to rid the world of bad presentations, Nate co-authored the book Presentation Patterns (O’Reilly Media, 2016) with Neal Ford and Matthew McCullough. He also recently published Thinking Architecturally (O’Reilly Media, 2018), available as a free download from VMware.",
      "image": "assets/img/speakers/nate-schutta.jpg",
      "ref": "ab822b577be6a2418593327d0530f2e48da634a4",
      "url": "infoSpeaker.html?ref=ab822b577be6a2418593327d0530f2e48da634a4",
      "homepage": "http://ntschutta.io",
      "twitter": "@ntschutta",
      "linkedin": ""
    },
    {
      "enabled": "1",
      "name": "Tim te Beek",
      "company": "JDriven",
      "description": "Senior Software Engineer",
      "biography": "Senior software engineer who enjoys working with and contributing to Open Source such as Spring Boot, Kafka, WireMock, OpenRewrite and ArchUnit. When not at work you'll find me travelling, bouldering, snowboarding, surfing or at one of many cultural events around my home town or abroad.",
      "image": "assets/img/speakers/tim-te-beek.jpeg",
      "ref": "77c600183db4294a11712dd71a78a680b7008818",
      "url": "infoSpeaker.html?ref=77c600183db4294a11712dd71a78a680b7008818",
      "homepage": "https://github.com/timtebeek",
      "twitter": "@timtebeek",
      "linkedin": "https://www.linkedin.com/in/timtebeek/"
    },
    {
      "enabled": "1",
      "name": "Thomas Vitale",
      "company": "Systematic",
      "description": "Software Architect",
      "biography": "Thomas is a Software Architect specialized in building highly-scalable, resilient, and secure enterprise applications. He develops software solutions at Systematic, Denmark, where he’s been working on modernizing platforms and applications for the cloud-native world, focusing on developer experience and security. Thomas likes contributing to open-source projects like Spring Security and Spring Cloud. He’s the author of “Cloud Native Spring in Action - With Spring Boot and Kubernetes”, published by Manning, where some of his main interests converged, such as Kubernetes, Buildpacks, Knative, and other cloud-native technologies.",
      "image": "assets/img/speakers/thomas-vitale.jpg",
      "ref": "311027298ebb9e1b88923214cff580786cf3d908",
      "url": "infoSpeaker.html?ref=311027298ebb9e1b88923214cff580786cf3d908",
      "homepage": "https://www.thomasvitale.com",
      "twitter": "@vitalethomas",
      "linkedin": "https://www.linkedin.com/in/vitalethomas/"
    },
    {
      "enabled": "1",
      "name": "Alberto Salazar",
      "company": "Advance Latam ",
      "description": "CTO",
      "biography": "Alberto Salazar is an entrepreneur, passionate Consultant, Java Champion, Oracle Groundbreaker Ambassador, JUG Leader, Auth0 Ambassador, founder of the Ecuador Java User Group, Java Community Process Associate Member and Java evangelist/trainer; active in twitter at @betoSalazar. He is the author of the book ‘Software Architecture with Spring 5.0’. Alberto has been working for more than 2 decades creating large scalable and high transaction load systems from military software to banking solutions. He is also a frequent speaker at Java conferences such as DevNexus, Oracle Code One, DevDays Europe, Voxxed Days, Oracle Code, Red Hat Summit, JavaOne, Oracle Developer Tour Latam, OTN Tours, and local JUG meetings.",
      "image": "assets/img/speakers/alberto-salazar.png",
      "ref": "8096d60f578c4cc2c777f231d1dff6aa46f4457b",
      "url": "infoSpeaker.html?ref=8096d60f578c4cc2c777f231d1dff6aa46f4457b",
      "homepage": "https://lasalazarr.github.io/blog/",
      "twitter": "@betoSalazar",
      "linkedin": "https://www.linkedin.com/in/alberto-salazar-15334154"
    },
    {
      "enabled": "1",
      "name": "Grace Jansen",
      "company": "IBM",
      "description": "Developer Advocate",
      "biography": "Grace is a Developer Advocate at IBM, working with Open Liberty, MicroProfile and Cloud Technologies. She has been with IBM since graduating from Exeter University with a Degree in Biology. Grace enjoys bringing a varied perspective to her projects and using her knowledge of biological systems to simplify complex software patterns and architectures. As a developer advocate, Grace builds POC’s, demos and sample applications, and writes guides and tutorials. She is a regular presenter at international technology conferences and has authored a book on reactive systems. Grace also has a keen passion for encouraging more women into STEM and especially Technology careers.",
      "image": "assets/img/speakers/grace-jensen.jpg",
      "ref": "b21e540e924111f0e9d271ed82350fa020b9972e",
      "url": "infoSpeaker.html?ref=b21e540e924111f0e9d271ed82350fa020b9972e",
      "homepage": "",
      "twitter": "@gracejansen27",
      "linkedin": "https://www.linkedin.com/in/grace-jansen/"
    },
    {
      "enabled": "1",
      "name": "Whitney Lee",
      "company": "VMware",
      "description": "Staff Developer Advocate",
      "biography": "Whitney is a Staff Developer Advocate at VMware. She traveled the scenic route but is chuffed to have found her way to Kubernetes & cloud technologies. Whitney began her professional career as a fine artist before owning her own photography business for over a decade. After a year-long tour playing in the band Mutual Benefit, Whitney went back to school in 2019 to learn full-stack web development. After graduation, Whitney was employed by IBM as a cloud developer, using none of the skills she had just learned. She developed an insatiable appetite for all things cloud, and a passion for teaching others as she acquired knowledge herself. Whitney has made many cloud-related lightboard videos that together have 300,000+ views. Whitney’s contagious excitement drives her to collaborate and play!",
      "image": "assets/img/speakers/whitney-lee.jpg",
      "ref": "576aeba6a8ebcbe244cc16bd0f973593673cc530",
      "url": "infoSpeaker.html?ref=576aeba6a8ebcbe244cc16bd0f973593673cc530",
      "homepage": "https://tanzu.vmware.com/developer/team/whitney-lee/",
      "twitter": "@wiggitywhitney",
      "linkedin": "https://www.linkedin.com/in/whitneylee/"
    },
    {
      "enabled": "1",
      "name": "Josh Long",
      "company": "Tanzu, a division of VMware",
      "description": "Spring Developer Advocate",
      "biography": "Josh (@starbuxman) has been the first Spring Developer Advocate since 2010. Josh is a Java Champion, author of 6 books (including O'Reilly's \"Cloud Native Java: Designing Resilient Systems with Spring Boot, Spring Cloud, and Cloud Foundry\" and \"Reactive Spring\") and numerous best-selling video training (including \"Building Microservices with Spring Boot Livelessons\" with Spring Boot co-founder Phil Webb), and an open-source contributor (Spring Boot, Spring Integration, Spring Cloud, Activiti and Vaadin, etc), a podcaster (\"A Bootiful Podcast\") and a YouTuber.\n",
      "image": "assets/img/speakers/josh-1.jpg",
      "ref": "3803f8e428feb905178afd9025cfc53fb47a8abc",
      "url": "infoSpeaker.html?ref=3803f8e428feb905178afd9025cfc53fb47a8abc",
      "homepage": "https://joshlong.com/",
      "twitter": "@starbuxman",
      "linkedin": "linkedin.com/in/joshlong"
    },
    {
      "enabled": "1",
      "name": "Nicolai Parlog",
      "company": "Oracle",
      "description": "Java Developer Advocate",
      "biography": "Nicolai (aka nipafx) is a Java enthusiast focused on language features and core APIs with a passion for learning and sharing - in articles, newsletters, and books; in tweets, videos, and streams; in demo repos and at conferences - more on all of that on nipafx.dev. He's a Java Developer Advocate at Oracle and organizer of Accento. That aside, he's best known for his haircut.",
      "image": "assets/img/speakers/nicolai-parlog.jpg",
      "ref": "78328a04b91142ff18f2a8885d6ec99391906a66",
      "url": "infoSpeaker.html?ref=78328a04b91142ff18f2a8885d6ec99391906a66",
      "homepage": "https://nipafx.dev",
      "twitter": "@nipafx",
      "linkedin": ""
    },
    {
      "enabled": "1",
      "name": "Simon Brown",
      "company": "Architectis",
      "description": "Independent Consultant",
      "biography": "Simon is an independent consultant specialising in software architecture, and the author of “Software Architecture for Developers” (a developer-friendly guide to software architecture, technical leadership and the balance with agility). He is also the creator of the C4 model for visualising software architecture, and the founder of Structurizr. Simon is a regular speaker at international software development conferences, and travels the world to help organisations visualise and document their software architecture.",
      "image": "assets/img/speakers/simonbrown.jpg",
      "ref": "a51f5e99c5211c81d99cd6f4e4217940c41e2d5d",
      "url": "infoSpeaker.html?ref=a51f5e99c5211c81d99cd6f4e4217940c41e2d5d",
      "homepage": "https://simonbrown.je/",
      "twitter": "@simonbrown",
      "linkedin": ""
    },
    {
      "enabled": "1",
      "name": "Maarten Mulders",
      "company": "Info Support",
      "description": "IT Architect",
      "biography": "Passionate architect, senior developer and trainer at Info Support. Also Oracle Groundbreaker Ambassador. I'm eager about \"building the right thing\" and \"building the thing right\". I focus on lean and elegant solutions, and I love to share new ideas and knowledge. Outside work, I appreciate crafting and eating good food, photography, and music, in no particular order.",
      "image": "assets/img/speakers/maarten-mulders.png",
      "ref": "f33256b1512b570f58cde29c69166d0fab470334",
      "url": "infoSpeaker.html?ref=f33256b1512b570f58cde29c69166d0fab470334",
      "homepage": "https://maarten.mulders.it",
      "twitter": "@mthmulders",
      "linkedin": "https://www.linkedin.com/in/mthmulders/"
    },
    {
      "enabled": "1",
      "name": "Ana-Maria Mihalceanu",
      "company": "Red Hat",
      "description": "Develope Advocate",
      "biography": "Ana is a Java Champion, Developer Advocate at Red Hat, co-founder of Bucharest Software Craftsmanship Community, and a constant adopter of challenging technical scenarios involving Java-based frameworks and multiple cloud providers. She actively supports technical communities’ growth through knowledge sharing and enjoys curating content for conferences as a program committee member.",
      "image": "assets/img/speakers/ana-maria-mihalceanu.jpg",
      "ref": "959143ffd6c954e5e544cdce71383429895e3679",
      "url": "infoSpeaker.html?ref=959143ffd6c954e5e544cdce71383429895e3679",
      "homepage": "",
      "twitter": "@ammbra1508",
      "linkedin": ""
    },
    {
      "enabled": "1",
      "name": "Edoardo Vacchi",
      "company": "Red Hat",
      "description": "Principal Software Engineer",
      "biography": "During my PhD I researched language design and implementation at University of Milan. After three years at UniCredit Bank’s R&D department, I have joined Red Hat in the KIE group. My current work is mainly on the Drools rules engine and the Kogito project.",
      "image": "assets/img/speakers/edoardo-vacchi.png",
      "ref": "2b7ec441cce9bb5ab34f86732420a111c517420a",
      "url": "infoSpeaker.html?ref=2b7ec441cce9bb5ab34f86732420a111c517420a",
      "homepage": "https://evacchi.github.io",
      "twitter": "@evacchi",
      "linkedin": "https://www.linkedin.com/in/edoardovacchi/"
    },
    {
      "enabled": "1",
      "name": "Alex Soto Bueno",
      "company": "Red Hat",
      "description": "Director of Developer Experience",
      "biography": "Alex Soto is a Director of Developer Experience at Red Hat. He is passionate about the Java world, software automation and he believes in the open-source software model. Alex is the co-author of Testing Java Microservices, Quarkus Cookbook, and Securing Kubernetes Secrets books, and a contributor to several open-source projects. \n\nA Java Champion since 2017, he is also an international speaker, radio collaborator at Onda Cero, and teacher at Salle URL University.",
      "image": "assets/img/speakers/alex-soto.jpg",
      "ref": "5c4dc84af05c736fb61555d97670869511e52764",
      "url": "infoSpeaker.html?ref=5c4dc84af05c736fb61555d97670869511e52764",
      "homepage": "",
      "twitter": "@alexsotob",
      "linkedin": ""
    },
    {
      "enabled": "1",
      "name": "Ben Evans",
      "company": "Red Hat",
      "description": "Senior Principal Software Engineer",
      "biography": "Ben Evans is an author, architect and educator. He is currently Senior Principal Software Engineer at Red Hat. Previously he was Lead Architect for Instrumentation at New Relic, and co-founded jClarity, a performance tools startup acquired by Microsoft. He has also worked as Chief Architect for Listed Derivatives at Deutsche Bank and as Senior Technical Instructor for Morgan Stanley. He served for 6 years on the Java Community Process Executive Committee, helping define new Java standards. He is a Java Champion and 3-time JavaOne Rockstar Speaker.\n\nBen is the author of six books, including \"Optimizing Java\", the new editions of “Java in a Nutshell” and the recently-updated “The Well-Grounded Java Developer” and his technical articles are read by thousands of developers every month. Ben is a regular speaker and educator on topics such as the Java platform, systems architecture, performance and concurrency for companies and conferences all over the world (pandemic permitting).",
      "image": "assets/img/speakers/ben-evans.jpg",
      "ref": "6d4ec093aeee2a5dde4bbce8e9698776ce7bd5b8",
      "url": "infoSpeaker.html?ref=6d4ec093aeee2a5dde4bbce8e9698776ce7bd5b8",
      "homepage": "https://kittylyst.com",
      "twitter": "@kittylyst",
      "linkedin": "https://www.linkedin.com/in/kittylyst/"
    },
    {
      "enabled": "1",
      "name": "Jakub Pilimon",
      "company": "VMware",
      "description": "Developer Advocate",
      "biography": "Jakub Pilimon is a Staff Technologist at VMware, blogger, programmer, and trainer. His main duty is to tackle complex enterprises with Domain-Driven Design and to propose a model and architecture that solves a problem. Sometimes he is involved in refactoring projects. When he isn’t coding, you can find him riding his bike, reading, or practicing kitesurfing.",
      "image": "assets/img/speakers/jakub-pilimon.jpg",
      "ref": "8730b5530ca70d453220ebfa9278c051d0492045",
      "url": "infoSpeaker.html?ref=8730b5530ca70d453220ebfa9278c051d0492045",
      "homepage": "https://tanzu.vmware.com/developer/team/jakub-pilimon/",
      "twitter": "@JakubPilimon",
      "linkedin": ""
    },
    {
      "enabled": "1",
      "name": "Daniel Oh",
      "company": "Red Hat",
      "description": "Senior Principal Developer Advocate",
      "biography": "Daniel Oh is a senior principal technical marketing manager at Red Hat to evangelize developers for building Cloud-Native Microservices and Serverless Functions with Cloud-Native Runtimes(i.e. Quarkus, Spring Boot, Node.js) and OpenShift/Kubernetes. Daniel also continues to contribute to various cloud open-source projects and ecosystems as a CNCF ambassador for accelerating DevOps adoption in enterprises. He's speaking at lots of technical seminars, workshops, and meetups to elaborate on new emerging technologies for enterprise developers & DevOps teams.",
      "image": "assets/img/speakers/daniel-oh.jpeg",
      "ref": "772aed76233c2cc81c2c9787426760c125fbe421",
      "url": "infoSpeaker.html?ref=772aed76233c2cc81c2c9787426760c125fbe421",
      "homepage": "http://bit.ly/danielohtv",
      "twitter": "@danieloh30",
      "linkedin": "https://www.linkedin.com/in/daniel-oh-083818112/"
    },
    {
      "enabled": "1",
      "name": "Ivar Grimstad",
      "company": "Eclipse Foundation",
      "description": "Jakarta EE Developer Advocate",
      "biography": "Ivar Grimstad is the Jakarta EE Developer Advocate at Eclipse Foundation. He is a Java Champion and JUG Leader based in Sweden.\n\nBesides advocating the Jakarta EE technologies, Ivar is contributing to the Jakarta EE specifications as well as being the PMC Lead for Eclipse Enterprise for Java (EE4J). He is also one of the specification leads for Jakarta MVC and represents Eclipse Foundation in the JCP Executive Committee.\n\nIvar is also involved in MicroProfile, Apache NetBeans, and a wide range of other open-source projects and communities. He is a frequent speaker at International developer conferences.",
      "image": "assets/img/speakers/ivar-grimstad.jpg",
      "ref": "d8b71cf333c0d6c1dd9126059adf41444e95a605",
      "url": "infoSpeaker.html?ref=d8b71cf333c0d6c1dd9126059adf41444e95a605",
      "homepage": "https://agilejava.eu",
      "twitter": "@ivar_grimstad",
      "linkedin": "https://www.linkedin.com/in/ivargrimstad/"
    },
    {
      "enabled": "1",
      "name": "Brian Vermeer",
      "company": "Snyk",
      "description": "Sr. Developer Advocate & Java Champion",
      "biography": "Brian Vermeer is a well-known person in the Java community. He is a Developer Advocate for Snyk, Java Champion, and Software Engineer with over a decade of hands-on experience in creating and maintaining (web)applications. He is passionate about Java, (Pure) Functional Programming and Cyber-security. Brian is a JUG leader for the Virtual JUG and the NLJUG. He also co-leads the DevSecCon community and is a community manager for Foojay. He is a regular international speaker on mostly Java-related conferences like JavaOne, Devnexus, Devoxx, Jfokus, JavaZone and many more. Besides all that, Brian is a military reserve for the Royal Netherlands Air Force and a Taekwondo Master / Teacher.",
      "image": "assets/img/speakers/brian-vermeer.jpg",
      "ref": "a4529dc3081fc5242a51aecadc114b5ff5aa1520",
      "url": "infoSpeaker.html?ref=a4529dc3081fc5242a51aecadc114b5ff5aa1520",
      "homepage": "https://brianvermeer.nl/",
      "twitter": "@BrianVerm",
      "linkedin": "https://www.linkedin.com/in/brianvermeer/"
    },
    {
      "enabled": "1",
      "name": "Aurélie Vache",
      "company": "OVHcloud",
      "description": "DevRel",
      "biography": "DevRel at OVHcloud in Toulouse, France. She is GDE (Google Developer Expert) for Cloud technologies, Docker captain, CNCF ambassador & Kubernetes for Developers certified. She has been working as a Developer and Ops for over 15 years. Cloud enthusiast and advocates DevOps/Cloud/Golang best practices. One of the leaders of Duchess France, an association that promotes women developers and women working in IT.Conferences and meetups organizer since 2016. Technical writer (dev.to/aurelievache), a book author & reviewer, a sketch noter and a speaker at international conferences. She created a new visual way for people to learn and understand Cloud technologies: 'Understanding Kubernetes/Istio/Docker in a visual way' in sketch-notes and videos. Blog: https://dev.to/aurelievache/ YouTube: https://www.youtube.com/c/AurelieVache",
      "image": "assets/img/speakers/aurelie-vache.jpg",
      "ref": "f3a44479f0e0e748cca666a713d65df707eb5016",
      "url": "infoSpeaker.html?ref=f3a44479f0e0e748cca666a713d65df707eb5016",
      "homepage": "http://scraly.com",
      "twitter": "@aurelievache",
      "linkedin": "https://www.linkedin.com/in/aurelievache/"
    },
    {
      "enabled": "1",
      "name": "Horacio Gonzalez",
      "company": "OVHcloud",
      "description": "DevRel Leader",
      "biography": "Spaniard lost in Brittany, coder, speaker, dreamer and all-around geek. After some years as Warp 10 frontend leader as Cityzen Data (now SenX), Horacio works as DevRel Leader at OVHcloud. He is the co-founder and leader of the @FinistDevs and @RdvSpeakers communities. Horacio is a Google Developer Expert (GDE) in Web Technologies and Flutter. He loves web development in general and everything around Web Components and standards web in particular.",
      "image": "assets/img/speakers/horacio-gonzalez.jpg",
      "ref": "e2f19f832dda1ec89c3019769e30a7d00f564198",
      "url": "infoSpeaker.html?ref=e2f19f832dda1ec89c3019769e30a7d00f564198",
      "homepage": "",
      "twitter": "@lostInBrittany",
      "linkedin": "https://www.linkedin.com/in/horaciogonzalez/"
    }
  ]
}
