{
  "items": [
    {
      "id": "61df3543ef0a16083d127537",
      "title": "Distribución Progresiva en la era de Kubernetes",
      "languages": [
        "eng",
        "es"
      ],
      "abstract": "<p>Producción es el lugar donde las aplicaciones deben estar. Aunque apliques Integración y Distribución Continua, cada vez que despliegues una nueva versión en producción te preguntarás si funcionará o habrá algún bug en la última versión, incluso haciendo que producción deje de estar disponible para los clientes.</p><p>La Distribución Progresiva es el siguiente escalón después de la Distribución Continua para probar tu aplicación en producción antes de ponerla disponible a todos tus usuarios.</p><p>Pon en práctica la Distribución Progresiva con técnicas como blue-green, canary release, shadowing traffic o dark launches para validar tu aplicación en Kubernetes con herramientas como Istio, Prometheus, ArgoDC o Argo Rollouts.</p><p>Únete a la sesión para aprender sobre Distribución Progresiva en acción usando Kubernetes.</p>",
      "type": "talk",
      "tags": [
        "kubernetes",
        "argocd",
        "argo rollouts"
      ],
      "level": "advanced",
      "speakers": [
        "5c4dc84af05c736fb61555d97670869511e52764"
      ]
    },
    {
      "id": "61e406409e44e3083e435f60",
      "title": "The hidden gems of distributed tracing",
      "languages": [
        "eng"
      ],
      "abstract": "<p>When building distributed systems, we aim to get a macro view and zoom in when a particular component seems to be at fault for a failure. Luckily, distributed tracing captures the detailed execution of causally-related activities performed by the elements of a distributed system as it processes a given request.</p><p>If you wonder how different the execution of the requests from the system's expected behavior was, join my session to learn how to recognize trace patterns, determine the bottlenecks when a request is too slow, and deal with oversampling or traffic labeling in production.</p>",
      "type": "talk",
      "tags": [
        "cloud",
        "distributed systems",
        "tracing",
        "practices"
      ],
      "level": "middle",
      "speakers": [
        "959143ffd6c954e5e544cdce71383429895e3679"
      ]
    },
    {
      "id": "61f1a0e0c4c4120b9d29afa0",
      "title": "Libertad significa que Kubernetes debe desaparecer",
      "languages": [
        "eng"
      ],
      "abstract": "<p>Todos nos estamos moviendo hacia modelos de organización basados en servicios y equipos autosuficientes. Todos estamos intentando de permitir que los desarrolladores sean más autónomos. Sin embargo, no es realista esperar que todos se conviertan en expertos en todo, desde infraestructura hasta Kubernetes y todo lo demás. Por lo tanto, no podemos cambiar de un día para el otro por la falta de experiencia, pero tampoco podemos seguir siendo reactivos a las necesidades de los demás. La única opción que queda es simplificar los servicios o incluso eliminar el acceso directo a la infraestructura y Kubernetes.</p><p>Es posible que podamos lograr esos objetivos a través de Argo CD o Flux (GitOps), Crossplane (universal control plane) y KubeVela (OAM). Al combinarlos, podemos permitir que los desarrolladores administren todo y aún así tengan el control total de los aspectos que les interesan. GitOps nos permite establecer Git como único punto de interacción con el sistema. Crossplane Composites nos permite simplificar la experiencia del desarrollador al administrar la infraestructura. Finalmente, el Open Application Model (OAM) con KubeVela nos permite definir aplicaciones en lugar de recursos de Kubernetes. Si combinamos estos tres tipos de herramientas y procesos, podemos permitir que las operaciones definan los servicios utilizados por los desarrolladores para administrar la infraestructura y las aplicaciones. Podemos hacer todo eso sin que nadie sepa que hay Kubernetes detrás de todo eso.</p><p>Para que todos puedan usar Kubernetes, debe desaparecer.</p>",
      "type": "talk",
      "tags": [
        "Cloud",
        "Kubernetes",
        "Crossplane",
        "OAM",
        "KubeVela"
      ],
      "level": "middle",
      "speakers": [
        "0ba89c51baf9f8542188bd750973e0767fbcaa68"
      ]
    },
    {
      "id": "61f1a32cc4c4120b9d29afa3",
      "title": "Live Diagramming of Knative Core Concepts",
      "languages": [
        "eng"
      ],
      "abstract": "<p>Although Knative has been community-maintained since 2018, there has been buzz around the project lately because Google has recently submitted Knative to the CNCF for consideration as an incubating project.</p><p>Cool! But what is Knative, exactly?</p><p>Simply put, Knative is a technology that streamlines and enhances the way that applications run on Kubernetes.</p><p>This talk is for people who are excited about this value proposition and want to dig deeper. How does it work? What components are at play? In what ways is running an app on Knative superior to running it directly on Kubernetes?</p><p>Instead of presenting slides, Whitney will draw out the fundamental concepts of Knative, explaining how they work in simple, relatable terms. She will then drive deeper understanding by giving context to the main points with real-life, straightforward use cases.</p><p>Attend this talk to gain a high-level understanding of Knative, its main components, and how it simplifies and improves the way that apps run on Kubernetes.</p>",
      "type": "talk",
      "tags": [
        "Knative",
        "Kubernetes",
        "Cloud",
        "Eventing"
      ],
      "level": "beginner",
      "speakers": [
        "576aeba6a8ebcbe244cc16bd0f973593673cc530"
      ]
    },
    {
      "id": "61f1a45bc4c4120b9d29afa4",
      "title": "Dapr: Dinosaur or Developer's Dream?",
      "languages": [
        "eng"
      ],
      "abstract": "<p>Dapr lets you abstract your distributed architecture from the underlying infrastructure that powers it. Forget about Kafka, RabbitMQ or any cloud-specific product: you're talking with a pub/sub broker. Let Dapr take care of how it works. Want to switch later? Sure, no problem!</p><p>So, is Dapr the new J2EE application server? How could it change the way we develop distributed solutions? Join me in this talk to find out if we're looking at a dinosaur in a fancy suit, or a developer's dream.</p>",
      "type": "talk",
      "tags": [
        "distributed architecture",
        "cloud native"
      ],
      "level": "middle",
      "speakers": [
        "f33256b1512b570f58cde29c69166d0fab470334"
      ]
    },
    {
      "id": "61f1ba52c4c4120b9d29afa6",
      "title": "Java Next - From Amber to Loom, from Panama to Valhalla",
      "languages": [
        "eng"
      ],
      "abstract": "<p>Java's four big projects are entering the home stretch: Amber and Panama have already incubated, previewed, and even finalized some features, Loom and Valhalla are on track to follow soon. Time to take a closer look at how...</p><p><ul></p><p><li>Project Amber makes the language more expressive and ready for today's and tomorrow's problems</li></p><p><li>Project Panama cuts through the isthmus separating Java from native code</li></p><p><li>Project Loom enables hassle-free and efficient structured concurrency</li></p><p><li>Project Valhalla mends the rift in Java's type system and improves performance</li></p><p></ul></p><p>After this talk, you will know what to expect from Java in the next few years.</p>",
      "type": "talk",
      "tags": [
        "Java",
        "Amber",
        "Panama",
        "Loom",
        "Valhalla"
      ],
      "level": "advanced",
      "speakers": [
        "78328a04b91142ff18f2a8885d6ec99391906a66"
      ]
    },
    {
      "id": "61fc3c0a4fc8140baaa031b4",
      "title": "What Java Devs Need To Know About Observability",
      "languages": [
        "eng"
      ],
      "abstract": "<p>As applications move to containers and migrate to the cloud, they become ever more complex, and it's increasingly important to monitor, analyze, and diagnose their behaviour. Observability is a new way of thinking about monitoring and understanding your applications. It’s supported by a growing range of open source tools and standards - part of the new wave of technologies that modern developers need to go fully Cloud Native.</p><p>Join Ben Evans to get the basics of the necessary theory behind Observability, including the fundamentals of monitoring, metrics, and tracing, and then get hands-on. You'll learn how to achieve observability in Java using OpenTelemetry, the emerging Open Standard for Observability, and we'll meet several other related OSS libraries and tools  (such as Jaeger) along the way.</p>",
      "type": "workshop",
      "tags": [
        "Cloud",
        "Java",
        "Observability",
        "OpenTelemetry"
      ],
      "level": "beginner",
      "speakers": [
        "6d4ec093aeee2a5dde4bbce8e9698776ce7bd5b8"
      ]
    },
    {
      "id": "61fc3c314fc8140baaa031b5",
      "title": "Kubernetes Native Java",
      "languages": [
        "eng"
      ],
      "abstract": "<p>Spring is all about helping developers get to production quickly and safely. These days, \"production\" is all but guaranteed to mean Kubernetes, and Spring has you covered. Join me, Spring Developer Advocate Josh Long (@starbuxman), and we'll look at how Spring Boot makes writing blisteringly fast, cloud-native, and scalable services more effortless than ever.</p>",
      "type": "talk",
      "tags": [
        "spring",
        "graalvm",
        "docker",
        "kubernetes",
        "buildpacks"
      ],
      "level": "middle",
      "speakers": [
        "3803f8e428feb905178afd9025cfc53fb47a8abc"
      ]
    },
    {
      "id": "61fd70f54fc8140baaa031bc",
      "title": "REACTIVE Una nueva esperanza! Lecciones de una historia de Rendimiento",
      "languages": [
        "es"
      ],
      "abstract": "<p>En la era en que los desarrolladores se quejan del rendimiento. Un equipo de desarrolladores rebeldes, atacan desde una base oculta y han obtenido su primera victoria contra las malvadas aplicaciones bloqueantes. En esta sesión, los asistentes aprenderán a partir de una experiencia de la vida real el cambio a paradigma reactivo; cubriremos consejos y trucos de una experiencia en la evolución de una aplicación bancaria. Durante la sesión obtendrás consejos, trucos, pros, contras y las razones para mover su código hacia una aplicación sin bloqueos, en base de  ejemplos de código incluyendo las consideraciones de seguridad en esta evolución. Usaremos fragmentos de código basados en JAVA, JWT, JWS, Auth0, Spring Boot, Reactor y Webflux desplegados en la nube</p>",
      "type": "talk",
      "tags": [
        "Java",
        "Reactive",
        "Microservice",
        "Architecture"
      ],
      "level": "middle",
      "speakers": [
        "8096d60f578c4cc2c777f231d1dff6aa46f4457b"
      ]
    },
    {
      "id": "61fd71234fc8140baaa031bd",
      "title": "Going Reactive with Helidon!",
      "languages": [
        "eng"
      ],
      "abstract": "<p>Helidon is a brave, small but powerful opensource framework for writing microservices. And if you need get the maximum performance – making your apps reactive is the currently the best way to do it! In this session we will dive deeper and see how to create extremely performant reactive microservices with Helidon “SE” flavour. We will explore its Reactive APIs, asynchronous DB access, and reactive Web-Client. Since Helidon has its own powerful Reactive Engine, we will learn how to get the most requests served in async operations and Messaging. We will also compare the performance with Loom, since Helidon supports it out of the box! Welcome to the Danger Zone!</p>",
      "type": "talk",
      "tags": [
        "helidon",
        "microservices",
        "reactive",
        "loom"
      ],
      "level": "middle",
      "speakers": [
        "74479a1ccc69e03d3868de48e18a4d759165d326"
      ]
    },
    {
      "id": "61fd71544fc8140baaa031be",
      "title": "Event streaming applications with Kafka Streams, Spring Kafka and Actuator (live coding)",
      "languages": [
        "eng"
      ],
      "abstract": "<p>We often make applications in which REST (HTTP) predominates, but is this a smart choice? Can't it be faster, or rather asynchronously and event based? Especially if you work with BIG DATA, Kafka is usually the better option.You get a whole platform where scalability, fault tolerance and replay-ability are very important (you don't want your message to be lost, and preferably you want to process it again if your system has been down).</p><p>There are three libraries we will discuss during live coding:</p><ul><li>Spring Kafka, where we will create a consumer and producer and test them with test-containers (without starting a whole cluster yourself).</li><li>Kafka Streams, a perfect fit for functional programming! With the StreamsAPI we will cover the best and most used patterns like branching, joining, mapping and more. We will create a Topology (stream) where we will handle fraud detection.</li><li>Spring Actuator is a match when you want to monitor your stream of events, you already got a lot of metrics for free!</li></ul><p>After the session you can create your own application with consumers, producers and streams!</p>",
      "type": "talk",
      "tags": [
        "Kafka Streams",
        "Big Data",
        "Java"
      ],
      "level": "middle",
      "speakers": [
        "98d92074e12051b600499049a3773caf3fc5dd60"
      ]
    },
    {
      "id": "61fd72704fc8140baaa031bf",
      "title": "Performance Testing Java Applications",
      "languages": [
        "eng"
      ],
      "abstract": "<p>Every so often,  you’ll read a performance benchmark (of a Java or other application), with bold claims for how well X performs compared to Y. Testing the performance of your Java application is an artform rather than engineering, and is a minefield of misconceptions, misunderstanding, and misinformation. In this session, we will review the basics and give you concrete steps to build a robust performance testbed for your application. We will be looking at this from a real-world server-side application point of view, specifically for Java apps. We’ll review common problems and how to avoid them. We’ll cover these topics while building up a performance test and running it live:</p><p>Define your goals: SLA, latency, throughput, stability</p><p>Test env vs. Production env for testing</p><p>The impact of GC on Java app performance</p><p>Tools for setting up, driving load, and getting perf test results</p><p>Testing application infrastructure like Kafka, Spark and Cassandra</p><p>Operating system settings, JVM settings, memory sizing, and CPU sizing</p><p>Analyzing perf test results and finding bottlenecks that are both apparent and not obvious</p>",
      "type": "talk",
      "tags": [
        "java",
        "performance"
      ],
      "level": "advanced",
      "speakers": [
        "5c8cf21786cae4a337b4c305fe244359243ded67"
      ]
    },
    {
      "id": "61fd73e74fc8140baaa031c0",
      "title": "Why You Can’t Buy Cloud Native",
      "languages": [
        "eng"
      ],
      "abstract": "<p>The virtual shelves are filled to bursting with cloud native technologies; containers, runtimes, CI pipelines, observability tools. The more an organisation buys, the more cloud native it is, right? And the more network communication an app involves, the more cloud native it is, right? Well, not so much. It turns out cloud native is about how you deliver software, not the tools you use. This talk explains these often-overlooked elements for cloud native success:</p><ul><li>Figuring out what problem we’re trying to solve</li><li>Releasing</li><li>Testing, but not the way you’re used to</li></ul>",
      "type": "talk",
      "tags": [
        "cloud",
        "culture"
      ],
      "level": "middle",
      "speakers": [
        "16b53ff6547870b3f9c9ef9f5eb97b015ba88e8b"
      ]
    },
    {
      "id": "61fd74f14fc8140baaa031c1",
      "title": "Historia de un desarrollador de Java que se cambia a Go en el contexto de Kubernetes",
      "languages": [
        "eng",
        "es"
      ],
      "abstract": "<p>En esta presentación, Mauricio, apasionado desarrollador Java, comparte sus hallazgos psicodélicos trabajando en el ecosistema Go para el Proyecto Knative OSS. Esta presentación se centra en el ecosistema Go en lugar de la diferencia entre los lenguajes Java y Go. Se discutirán herramientas como la gestión de dependencias, IDE, marcos y cómo lidiar con proyectos grandes. Si bien Java sigue siendo importante en mi corazón, hay lecciones a tener en cuenta, frameworks y herramientas que tal vez querríamos traer al ecosistema de Java de la vibrante comunidad de Go. Se hace especial énfasis en las herramientas relacionadas con Kubernetes y por qué creo que Go en Kubernetes está muy por delante de Java.</p>",
      "type": "talk",
      "tags": [
        "Cloud",
        "java",
        "go",
        "kubernetes",
        "tools",
        "frameworks"
      ],
      "level": "middle",
      "speakers": [
        "4b26a098aafaf6bc3d533389b61d3ef5ab01f5a3"
      ]
    },
    {
      "id": "620d60d18fcdb80b9ff5371f",
      "title": "Addressing the transaction challenge in a cloud-native world",
      "languages": [
        "eng"
      ],
      "abstract": "<p>With microservices comes great benefits but also great challenges! One such challenge is data consistency and integrity. Traditionally, tightly coupled transactions were used to ensure strong consistency and isolation. However, this results in strong coupling between services due to data locking and decreasing concurrency, both of which are unsuitable for microservices. So, how do we provide consistency guarantees for flows that span long periods of time in cloud-native applications? We'll address this challenge by investigating the Saga pattern for distributed transactions, the MicroProfile Long Running Action (LRA) specification and how these can be used to develop effective cloud-native Java microservices.</p>",
      "type": "talk",
      "tags": [
        "Transactions",
        "Cloud-Native",
        "Java",
        "MicroProfile",
        "OSS"
      ],
      "level": "middle",
      "speakers": [
        "b21e540e924111f0e9d271ed82350fa020b9972e"
      ]
    },
    {
      "id": "620d61808fcdb80b9ff53720",
      "title": "Diagrams as code 2.0",
      "languages": [
        "eng"
      ],
      "abstract": "<p>Diagrams as code is becoming a popular way to diagram software architecture, particularly for long-lived high-level documentation - write the diagram source in a text-based domain specific language (e.g. PlantUML or Mermaid) or a programming language, and render diagrams using web-based or command line tooling. The benefits are well understood - writing the diagram source as text allows for easy integration into software development practices and toolchains, plus the automatic layout facilities allow authors to focus on content. The problem with this approach is that it's easy for diagrams to get out of sync. Enter \"diagrams as code 2.0\" and the open source Structurizr DSL - a Java-based library providing a way to define a model of our software architecture and the views that we'd like to see, ultimately resulting in a consistent set of diagrams that are generated for us.</p>",
      "type": "talk",
      "tags": [
        "Software Architecture",
        "Java"
      ],
      "level": "middle",
      "speakers": [
        "a51f5e99c5211c81d99cd6f4e4217940c41e2d5d"
      ]
    },
    {
      "id": "620d629d8fcdb80b9ff53721",
      "title": "The Call of Ctooling: The Secrets Behind Native Image Building",
      "languages": [
        "eng"
      ],
      "abstract": "<p>You have learned about the “Closed World Assumption”. You live by the rule “Thou Shall Sparingly Use Reflection”. You know that “From the Powerful defineClass Comes Great Responsibility”. And yet you were still left to wonder: what is it still eluding me? What is the secret ingredient that I am still missing? Join us for a short, but deeper dive into some of the dark magic behind GraalVM’s native image builder: heap snapshotting and build-time initialization. And learn more about other obscure projects investigating the craft of static Java compilation.</p>",
      "type": "talk",
      "tags": [
        "native image",
        "graalvm",
        "compilers",
        "leyden"
      ],
      "level": "advanced",
      "speakers": [
        "2b7ec441cce9bb5ab34f86732420a111c517420a"
      ]
    },
    {
      "id": "620d634d8fcdb80b9ff53722",
      "title": "Developer Experience with Java on Kubernetes",
      "languages": [
        "eng"
      ],
      "abstract": "<p>In the cloud-native world, being a developer might be challenging. The number of technologies and patterns to know can be overwhelming. This session presents an approach based on open-source technologies and focused on improving the inner development loop and continuous delivery on Kubernetes. The end goal is delivering value continuously, quickly, and reliably.</p><p>First, I’ll present several techniques for working locally in an effective and productive way. Should you run Kubernetes in your development environment? I’ll cover a few different options. Using Java and Spring Boot, we’ll build a cloud native application following the principles of test-driven development. The inner development loop will be enhanced with Cloud Native Buildpacks, Skaffold, and Telepresence.</p><p>Continuous integration is a crucial practice for continuous delivery. We’ll check in code regularly, triggering an automated process to build, test, and package the application. Do you use pull requests? Relying on ArgoCD and Knative, I’ll show you how to work with temporary environments created dynamically when a new pull request is opened. Next, further acceptance tests will be carried on in a production-like environment to ensure the mainline is always in a releasable state. Finally, we’ll deploy and release the new changes to production following the GitOps principles.</p>",
      "type": "talk",
      "tags": [
        "Java",
        "JVM",
        "Spring Boot",
        "Kubernetes",
        "Knative",
        "TDD",
        "Continuous Delivery"
      ],
      "level": "beginner",
      "speakers": [
        "311027298ebb9e1b88923214cff580786cf3d908"
      ]
    },
    {
      "id": "621907a14010570ba9b6dd69",
      "title": "Stranger Danger: Your Java Attack Surface Just Got Bigger",
      "languages": [
        "eng"
      ],
      "abstract": "<p>Building cloud-native Java applications is undoubtedly awesome.</p><p>However, it comes with undeniable new risks. Next to your own code, you are relying on so many other things.</p><p>Blindly depending on open-source libraries and Docker images can form a massive risk for your application.</p><p>The wrong package can introduce severe vulnerabilities into your application, exposing your application and your user's data.</p><p>Join this talk where we’ll show common threats, vulnerabilities, and misconfiguration including the recently disclosed issues in Log4j.</p><p>Most importantly, you’ll learn how to protect your application with actionable remediation and best practices.</p>",
      "type": "talk",
      "tags": [
        "Java",
        "Security",
        "Cloud-Native"
      ],
      "level": "middle",
      "speakers": [
        "a4529dc3081fc5242a51aecadc114b5ff5aa1520"
      ]
    },
    {
      "id": "621908084010570ba9b6dd6b",
      "title": "Enter Serverless Functions Journey with Quarkus",
      "languages": [
        "eng"
      ],
      "abstract": "<p>This workshop is designed to be hands-on experiences on how developers can get started with scaffolding serverless functions projects using Quarkus, a new Kubernetes native Java framework with familiar tools (e.g. CLI, Maven, Gradel). The workshop covers deploying service functions to AWS Lambda, optimizing the functions, making them portable across multiple serverless platforms ( e.g., AWS Lambda, Azure Function, Google Cloud Platform, Kubernetes Knative), and using the latest handy command-line tool (e.g. Kn func) to enable a Buildpack for function development & deployment in minutes. Lab participants will be provided a free sandbox for serverless deployments.</p><p>Lab instructions(WIP): https://github.com/RedHat-Middleware-Workshops/enter-serverless-functions/blob/main/README.md</p>",
      "type": "workshop",
      "tags": [
        "Serverless",
        "Java",
        "Kubernetes",
        "Quarkus",
        "Function"
      ],
      "level": "middle",
      "speakers": [
        "772aed76233c2cc81c2c9787426760c125fbe421"
      ]
    },
    {
      "id": "621909084010570ba9b6dd6c",
      "title": "Choose your own adventure with Spring Security",
      "languages": [
        "eng"
      ],
      "abstract": "<p>Learn and apply Spring Security 5+ in a collection of individual challenges, for all levels. From picking the right dependency, to enforcing security constraints. Choose from a series of self-guided exercises around authorization to suit your needs. Topics include: OpenID Connect, Keycloak and integrating with Spring Cloud Gateway, Spring Data and Testing. Walk away with increased confidence in Spring Security and what it can do for your projects.</p>",
      "type": "workshop",
      "tags": [
        "Spring",
        "Security"
      ],
      "level": "middle",
      "speakers": [
        "77c600183db4294a11712dd71a78a680b7008818"
      ]
    },
    {
      "id": "621909364010570ba9b6dd6d",
      "title": "Spring For Architects",
      "languages": [
        "eng"
      ],
      "abstract": "<p>With globally distributed applications (and teams!) the job of software architect isn’t getting any easier; applications are growing increasingly complex and architects are spread thin. You can’t be involved with every decision, you must empower your teams while ensuring they are making good choices. How do you do that? How can frameworks like Spring not only make your life easier but help your teams deliver robust applications to production? Spring Cloud has a veritable plethora of sub projects from circuit breakers to functions simplifying the task of building cloud native applications while making it easy for developers to adhere to best practices. At the same time it can be overwhelming to get your head wrapped around all the features Spring offers. This talk will show how Spring allows architects to focus on the critical design decisions they need to make while ensuring developers are empowered to implement critical business use cases. Today’s cloud native applications have similar pitfalls, luckily Spring is here to help you resolve them!</p>",
      "type": "workshop",
      "tags": [
        "spring",
        "java",
        "architecture",
        "cloud native",
        "architect"
      ],
      "level": "middle",
      "speakers": [
        "ab822b577be6a2418593327d0530f2e48da634a4",
        "8730b5530ca70d453220ebfa9278c051d0492045"
      ]
    },
    {
      "id": "621909594010570ba9b6dd6e",
      "title": "Jakarta EE 10 Feature by Feature",
      "languages": [
        "eng"
      ],
      "abstract": "<p>Jakarta EE 10 is here with lots of new features and improvements. This session will go through these features one by one with live coding examples of how to use them.</p><p>You will get a full overview of what Jakarta EE 10 brings to the table, including the brand new Jakarta EE Core Profile that targets smaller runtimes.</p><p>If time allows, a sneak peek into what to expect beyond Jakarta EE 10 will also be provided.</p>",
      "type": "talk",
      "tags": [
        "Jakarta EE",
        "Cloud",
        "Enterprise Java"
      ],
      "level": "middle",
      "speakers": [
        "d8b71cf333c0d6c1dd9126059adf41444e95a605"
      ]
    },
    {
      "id": "62190ab64010570ba9b6dd6f",
      "title": "What the heck is DevRel?",
      "languages": [
        "eng"
      ],
      "abstract": "<p>In recent years, we have seen new job titles appear, at the crossroads between tech, marketing and the community: Developer Advocate, Developer Evangelist, Technical Advocate… These jobs are grouped together in a large category: Developer Relations, or quite simply DevRel ...</p><p>But what exactly is a DevRel? What does he/she do for a living? Is he/she just a glitter thrower? Does he/she spend his/her life in conferences? Does he/she know airports and train stations inside out? Does he/she have a unicorn costume in his/her luggage?</p><p>Aurélie and Horacio will show you in this talk, with their humor and good mood, their daily life, the different types of activities and what is really behind this DevRel job… And you might even get some little anecdotes ^^</p>",
      "type": "talk",
      "tags": [
        "DevRel",
        "Job",
        "Development"
      ],
      "level": "beginner",
      "speakers": [
        "f3a44479f0e0e748cca666a713d65df707eb5016",
        "e2f19f832dda1ec89c3019769e30a7d00f564198"
      ]
    },
    {
      "id": "6229158356274e0bddf00791",
      "title": "Java on CRaC: Superfast JVM Application Startup",
      "languages": [
        "eng"
      ],
      "abstract": "<p>One of the key benefits of a microservice architecture is the ability to dynamically respond to changes in load by spinning up new instances as required. However, when deploying JVM-based services, the warmup time of JIT compilation can be a limitation on the effectiveness of this technique.</p><p>One approach to solving this problem is using native images, where the service is statically compiled using an ahead-of-time (AOT) compiler.  Although this does reduce startup time and footprint, it does so at the cost of overall performance.</p><p>A new project has been proposed and accepted into OpenJDK called CRaC (Coordinated Restore at Checkpoint).  The goal is to research the co-ordination of Java programs with mechanisms to checkpoint (snapshot) a running application.  Restoring from the snapshot could solve some of the problems with the startup and warmup times, especially in microservices.</p><p>In this session, we’ll look at the main challenges for such a project, potential solutions and the results from a proof-of-concept implementation.</p>",
      "type": "talk",
      "tags": [
        "JDK",
        "JVM",
        "OpenJDK"
      ],
      "level": "middle",
      "speakers": [
        "e5979093f4775ff480701b323ef5f347812a3ce0"
      ]
    },
    {
      "id": "622916e656274e0bddf0079b",
      "title": "Seamless SSO workshop : KEYCLAOK + SPRING + VUE.JS + LDAP",
      "languages": [
        "eng"
      ],
      "abstract": "<p>Join us in this workshop for learning how we have utilized great open source identity management solution Keycloak for managing user authentication, synchronizing user groups, user group memberships, etc. by integrating with Active Directory (or any enterprise LDAP). Keycloak is also capable of identity management via social media providers e.g. Linkedin, Github, Twitter, etc.</p><p>During the workshop, we will go through all the important steps one by one, hands-on</p><p>1. Keycloak configuration</p><p>1.1. Realm creation / configuration</p><p>1.2. User federation, LDAP integration</p><p>1.3. users / groups syncronization from LDAP</p><p>1.4. perform authentication requests via postman</p><p>2. Spring Security confgiuration</p><p>2.1. verification of keycloak JWT token</p><p>2.2. extracting username and roles from the JWT token</p><p>2. Vue.js app integration</p><p>2.1. simple one page vue.js app performing login operation from Keycloak and makine one simple REST request to Spring Rest service</p><p>For the sake of timing during the workshop, Keycloak - LDAP will be provided as a docker container and Spring and Vue.js projects will be shared as a template via Github so that the audience can focus on the important parts.</p>",
      "type": "workshop",
      "tags": [
        "keycloak",
        "security",
        "spring",
        "identity management",
        "openid-connect",
        "ldap"
      ],
      "level": "middle",
      "speakers": [
        "5a014096a2b2b36a9a4058dd045242f74f71d32a"
      ]
    },
    {
      "id": "6229173756274e0bddf0079d",
      "title": "Building Database Applications with Micronaut Data and GraalVM ",
      "languages": [
        "eng"
      ],
      "abstract": "<p>Micronaut Data allows the constructions of slick database applications that target a range of different database workloads from SQL databases to document databases like MongoDB and Oracle Autonomous Database. This presentation by Micronaut creator and Oracle Architect Graeme Rocher will take you through a tour of using Micronaut Data's key features including:</p><ul><li>Persistence to SQL and Document Databases</li><li>Non-blocking database access with R2DBC</li><li>Programmatic and declarative transactions</li><li>Persistence events</li><li>Criteria specifications</li><li>Building native database applications with GraalVM and Native Image</li></ul><p>To get an in-depth tour of Micronaut, Micronaut Data and GraalVM this is the talk for you.</p>",
      "type": "talk",
      "tags": [
        "micronaut",
        "database",
        "graalvm",
        "microservices",
        "sql"
      ],
      "level": "middle",
      "speakers": [
        "6c31223d3be1de9ea66a96974ec4f524cd6a786f"
      ]
    },
    {
      "id": "6229198856274e0bddf0079e",
      "title": "Give your application memories",
      "languages": [
        "eng"
      ],
      "abstract": "<p>Most applications only know the present. Their current state is calculated and updated on every change, effectively losing previous conditions and information that existed in the past. Can that be a limitation? Missed opportunity? What if your application could remember its entire history? Would that be helpful, or is it a worthless effort?</p><p>This talk will provoke Java developers to start asking such questions. It will help you make applicable mental models of Event Sourcing, DDD, and CQRS concepts. It will also demonstrate what it takes to build such applications in Java.</p>",
      "type": "talk",
      "tags": [
        "Event Sourcing",
        "Distributed system",
        "CQRS",
        "Java"
      ],
      "level": "middle",
      "speakers": [
        "24a5f774e105713678358ec00b22df50b32059df"
      ]
    },
    {
      "id": "62291d7956274e0bddf0079f",
      "title": "To Java 19 and Beyond!",
      "languages": [
        "eng"
      ],
      "abstract": "<p>Java 17 has come and gone, but development on Java continues on! What has changed since Java 11? And what changes are being added in Java 19 and Beyond? Come find out!</p><p>In this presentation we will look at some of the key changes that have been added to Java post-8. The large changes; the Module System and Records, quality of life improvements; var, text blocks, pattern matching, and the many performance and runtime improvements. We will finish the presentation with a brief look ahead to some of the changes that will be coming to Java in the near future and why Java’s future is bright.</p>",
      "type": "talk",
      "tags": [
        "Java",
        "JVM"
      ],
      "level": "beginner",
      "speakers": [
        "459fc7466dfa9163817d35cc884ca96e154c2420"
      ]
    },
    {
      "id": "62291eab56274e0bddf007a0",
      "title": "All test are green? Oh no!! Why it is sometimes good, if a test fails.",
      "languages": [
        "eng"
      ],
      "abstract": "<p>Test coverage: 100% - Check!</p><p>And why do we still have bugs?</p><p>OK, tests don't prove the absence of errors.</p><p>And at the end of the day, they are just code which could contain bugs as well.</p><p>And perhaps they give us a false sense of security.</p><p>But how do I know, that my test are good?</p><p>One way to find out is using Mutation Testing.</p><p>In this talk I want to explain, what Mutation Testing is, how to do it and when it is helpful.</p>",
      "type": "talk",
      "tags": [
        "Testing",
        "Quality of tests"
      ],
      "level": "beginner",
      "speakers": [
        "333c3c7a68eddba59d67331ec6422d0092a814b3"
      ]
    },
    {
      "id": "6229f5eb56274e0bddf007a2",
      "title": "Seguridad en Micronaut®",
      "languages": [
        "eng",
        "es"
      ],
      "abstract": "<p>En esta sesión, Sergio del Amo presenta Micronaut Security, una solución de seguridad personalizable y con todas las funciones para sus aplicaciones.</p><p>Los temas incluyen:</p><p>Autenticación (autenticación básica, basada en cookies, basada en sesiones, portador, LDAP, X.509)</p><p>Acceso usuario autenticado</p><p>Configuración de seguridad (@Secured, mapa de URL de intercepción y más)</p><p>OAuth 2.0 (Código de autorización, Credenciales de cliente, Concesiones de credenciales de contraseña)</p><p>OpenID Connect (integración con proveedores de servidores OAuth 2.0 de terceros: Auth0, Okta, Keycloak, Amazon Cognito)</p><p>JWT (firma, validación, generación, JWKS)</p><p>Propagación de tokens</p><p>Eventos de seguridad</p><p>Descubra lo fácil que es trabajar con Micronaut Security y aprenda a adaptarlo a sus necesidades.</p><p>Sergio del Amo es Micronaut core commiter, Developer Advocate de la Fundación Micronaut y presentador del “Micronaut podcast” (https://micronautpodcast.com).</p>",
      "type": "workshop",
      "tags": [
        "Micronaut",
        "Security",
        "OAuth 2.0",
        "JWT",
        "JWKS",
        "OpenID Connect"
      ],
      "level": "middle",
      "speakers": [
        "594e335548f1564c9d8057f7b0098872db39f5df"
      ]
    },
    {
      "id": "62324db53a63410bd73c06e4",
      "title": "Event Streaming for the Best of All Worlds",
      "languages": [
        "eng"
      ],
      "abstract": "<p>When it comes to distributed, event-driven messaging systems, we usually see them supporting either one of two types of semantics: streaming, or queueing, and rarely do we find a platform that supports both.  In this presentation, we’ll first get an introduction and some clarifications of event-driven versus message-driven systems, event streams, and stream processing.  We’ll then take a look at Apache Pulsar which offers a very unique capability in modern, cloud-native applications and architecture, in which its platform supports both Publish-Subscribe and Message Queues, and extends into streams processing as well as performs message mediation & transformation.  We will see how it works closely with and relies on Apache Bookkeeper for its durable, scalable, and performant storage of log streams, and leverages on Apache Zookeeper to manage the otherwise very complex ecosystem.  We will then compare Apache Pulsar with the popular Apache Kafka platform to understand some of their key differences as to how Pulsar can overcome some of Kafka's limitations.  With Pulsar's flexible architecture and cloud-native readiness, we will take a look to see how it can be integrated and work collaboratively with the popular Spring framework.</p>",
      "type": "talk",
      "tags": [
        "Event Streaming",
        "Distributed Messaging",
        "Pub/Sub",
        "Cloud Native",
        "Java",
        "OSS",
        "Apache Pulsar"
      ],
      "level": "beginner",
      "speakers": [
        "443a683fa84a77151521434bf96a7a082d29d361"
      ]
    },
    {
      "id": "623b88963a63410bd73c06f9",
      "title": "Open Innovation and the Java Platform ",
      "languages": [
        "eng"
      ],
      "abstract": "<p>In this presentation we look at recent enhancements to the language. We will also provide resources to help you get more involved in the evolution of Java, learn Java, and explore how you can contribute to the Java community. We will show you how to stay informed when new versions of Java are released and how joining your local Java User Group builds your network and may eventually lead to better career opportunities. Come for Java; stay for all the fun!</p>",
      "type": "talk",
      "tags": [
        "java",
        "community",
        "jdk",
        "innovation",
        "careers"
      ],
      "level": "beginner",
      "speakers": [
        "cdb2f4341ae9909562e3f30b68c1d4ade0597c01"
      ]
    },
    {
      "id": "623b89093a63410bd73c06fa",
      "title": "Cloud-Native Application Development with MicroProfile",
      "languages": [
        "eng"
      ],
      "abstract": "<p>Ever wondered what is a Cloud Native Application? Is it a microservice or a monolith? oh, it must be made for Cloud using Java? Ever Wondered how to develop a Cloud-Native Application? Come to this session to find out about what making an application Cloud-Native and then learn how to build a Cloud-Native Application using the latest MicroProfile technologies (MicroProfile 4.1) such as Config, Fault Tolerance, Rest Client, JWT, Metrics etc. This session finishes with a live demo on developing Cloud-Native applications using MicroProfile 4.1 running on Open Liberty and deploying them on k8s.</p>",
      "type": "talk",
      "tags": [
        "cloud-natve",
        "config",
        "microprofile",
        "kubernetes"
      ],
      "level": "beginner",
      "speakers": [
        "907ad623981c92e789c5b74ed8c18db8a0c1be71"
      ]
    },
    {
      "id": "623b8c513a63410bd73c06fd",
      "title": "Now is the time: From Java 11 to 17",
      "languages": [
        "eng"
      ],
      "abstract": "<p>Java 17 has come almost a year ago, but many happily run production on Java 11. Some are afraid to migrate forward due to fear, and due to memories of a difficult migration from Java 8. Others don’t see a significant value and lack motivation in invest in the migration forward. The talk will cover, why staying on Java 11 is an additional risk and additional cost, will cover breaking changes between java 11 and 17. The talk will overview benefits of the migration forward, overview of JVM changes, a quick review of the major language and API changes between Java 11 and 17.</p>",
      "type": "talk",
      "tags": [
        "Java",
        "JVM",
        "Migration"
      ],
      "level": "middle",
      "speakers": [
        "eecf1fc106a3fda9197602173d272b9e3c7b8613"
      ]
    },
    {
      "id": "62505e6faa23f0085462dda2",
      "title": "Jakarta EE: Community Power and Progress ",
      "languages": [
        "eng"
      ],
      "abstract": "<p>For more than 20 years, Java has been a dominant programming language. Jakarta EE as successor of Java EE provides essential middleware capabilities for the existing and any future enterprise application development. With the new release and great community involvement Jakarta EE’s mission is more frequent releases, lowered barriers to participation, and modernizing the platform is giving great results! This presentation will provide you with key insights into the industry-wide, open source collaboration to modernize Java enterprise systems for cloud-centric use cases.</p>",
      "type": "talk",
      "tags": [
        "#Java",
        "#JavaEE",
        "#JakartaEE",
        "#JVM langs",
        "#Cloud"
      ],
      "level": "beginner",
      "speakers": [
        "851e5eddc5337f77150e3b753a676b412dab892a",
        "62c17e6d66e07f62fd2ca8b6c0e073950d56a55e"
      ]
    },
    {
      "id": "62505e8baa23f0085462dda3",
      "title": "Bootiful Tests in Kotlin",
      "languages": [
        "eng"
      ],
      "abstract": "<p>Join us for an exploration of testing a Kotlin based Spring Boot 3.x application. Test driven development gives us the confidence necessary to improve our code faster, safely. But how do you test components and services, as well as integrations across distributed systems, while maintaining fast feedback loops, and how do you do all of this within the context Kotlin? In this talk, we'll look at how to test imperative components, data flows, and mocks. We’ll examine how to take advantage of test slices, and how to test web applications. We'll look at how to ensure that API producers and consumers work well together using consumer driven contract testing without sacrificing the testing pyramid for end-to-end integration tests.</p>",
      "type": "talk",
      "tags": [
        "Kotlin",
        "SpringBoot",
        "TDD",
        "testing"
      ],
      "level": "middle",
      "speakers": [
        "572abc9f31f717b714a59be353c58705853b3b81"
      ]
    },
    {
      "id": "62505edfaa23f0085462dda4",
      "title": "The Microservices Smackdown: Data",
      "languages": [
        "eng"
      ],
      "abstract": "<p>Los microservicios están en todas partes. Hay más de una forma de implementarlos y desplegarlos, pero al final lo que esperamos de ellos es mover datos de un lugar a otro. Las bases de datos generalmente se encuentran al final de la ejecución de un microservicio. Los microservicios pueden ejecutarse en modo síncrono y asíncrono, pero ¿qué pasa con el procesamiento de datos desde y hacia la base de datos? En esta sesión, cubriremos las capacidades de sincronización y asincronía que ofrecen Helidon, Micronaut, Quarkus y Spring Boot cuando se trata de leer y escribir datos.</p>",
      "type": "talk",
      "tags": [
        "Microservices",
        "Data"
      ],
      "level": "middle",
      "speakers": [
        "17f50b47a57b0354999b00d372ac197a9452a7c1"
      ]
    },
    {
      "id": "62505f60aa23f0085462dda5",
      "title": "Modern Java microservices in the cloud",
      "languages": [
        "eng"
      ],
      "abstract": "<p>It's 2022, long gone are the days of ceremony and Java development should be productivity, simplicity.</p><p>Let's look at how we make it happen, in context of startup going FAST.</p><p>I will describe the architectural approach we use stack we use, and what, sometimes unorthodox, technology and design choices we have made, and their consequences. Expect: code samples, why does our stack look the way it looks AND… what have we learnt in the process.</p><p>It's all going to be Revolut-based!</p>",
      "type": "talk",
      "tags": [
        "java",
        "microservices",
        "architecture",
        "principles"
      ],
      "level": "middle",
      "speakers": [
        "222e9ee3f64709eb49f3299baaa4f39693e5fb82"
      ]
    },
    {
      "id": "62506140aa23f0085462dda6",
      "title": "Using Quarkus and Kotlin for amazing developer productivity",
      "languages": [
        "eng"
      ],
      "abstract": "<p>Since it's release, Quarkus has taken the Java world by storm by providing amazing developer productivity to go along with very minimal runtime footprint. Quarkus initially focused on Java, but has recently introduced first class support for Kotlin across it's most important APIs.</p><p>This talk will Kotlin lovers how they can use their favorite language along with Quarkus and reap the best of best worlds.</p>",
      "type": "talk",
      "tags": [
        "Kotlin",
        "Quarkus"
      ],
      "level": "middle",
      "speakers": [
        "7cff2b21cb47f910e18350c6497853c7daf32e09"
      ]
    },
    {
      "id": "6250631eaa23f0085462dda7",
      "title": "Releases determinísticas, reproducibles y sin sorpresas",
      "languages": [
        "eng"
      ],
      "abstract": "<p>Cuando un proyecto ha llegado a la etapa en la que es una buena idea publicar binarios, surgen nuevas preguntas, ¿Dónde deberían publicarse? ¿Cómo facilitamos a los usuarios la localización e instalación de binarios? ¿Dónde se deben compartir las releases? Y lo más importante, ¿se pueden automatizar? Hay tantos requisitos y consideraciones dependiendo de los canales de distribución, ¿no sería genial tener una herramienta para hacerlo más fácil?</p><p>JReleaser es una herramienta que brinda respuestas a estas preguntas y más. Se puede usar para crear releases en GitHub/GitLab/Gitea y publicar binarios consumibles desde diferentes canales de distribución como Homebrew, Snap, Scoop y más. Una vez publicada, la release se puede anunciar automáticamente en Twitter, Slack, Gitter, Discord u otros.</p>",
      "type": "talk",
      "tags": [
        "Release",
        "OSS",
        "DevOps"
      ],
      "level": "beginner",
      "speakers": [
        "2d9af6a2ba5f456c6f5b300bd82bd1c75b29da10"
      ]
    },
    {
      "id": "6257242eaa23f0085462dda8",
      "title": "Building Domain-Specific Language (DSL) for fun and profit",
      "languages": [
        "eng",
        "es"
      ],
      "abstract": "<p>What is the benefit of embedding a language within a language? How can we achieve this, without dying in the process? Is it even worth the effort?</p><p>In this talk we’ll go over some of my experiences where writing a DSL made the code far more readable, extendable and even more performant! We’ll go over some heavyweight, fully fledged parser implementations for an external DSL, some libraries and tips; and some more lightweight techniques to embed them in Java itself.</p>",
      "type": "talk",
      "tags": [
        "Java",
        "Kotlin",
        "Design",
        "Functional Programming"
      ],
      "level": "middle",
      "speakers": [
        "114845540f08032641a03bf464caff7815303e5e"
      ]
    },
    {
      "id": "625724b7aa23f0085462dda9",
      "title": "DevOps for Java Shops",
      "languages": [
        "eng"
      ],
      "abstract": "<p>DevOps is great, if you have the people, processes and tools to support it. In this session I’ll highlight the easiest ways for Java developers to work with their IT organizations and partners to deliver their code to the cloud, including the best ways to reliably make updates and maintain production cloud code. The focus is on real-world examples using Linux command line tools, open source tools including Jenkins, and other free SDKs and tools available on GitHub.</p>",
      "type": "talk",
      "tags": [
        "GitHub",
        "GitHub Actions",
        "GitHub CodeSpaces"
      ],
      "level": "middle",
      "speakers": [
        "836bf32dd2283312420733bcbb619965af16ee57"
      ]
    },
    {
      "id": "625724d1aa23f0085462ddaa",
      "title": "Scaling Camel to the cloud",
      "languages": [
        "eng"
      ],
      "abstract": "<p>In an ever-accelerating IT world, the need to connect different software systems is growing day by day. More than ever, we need to have a tool to easily create decoupled and easy integration connectors between several external systems. But more importantly, we need to be able to scale those into the Cloud.</p><p>Apache Camel with its 350 connectors gives a proven response to such a demand. In this talk, we will present Apache Camel and explain how to scale Apache Camel based microservices to the cloud. We will present how to make your Camel, Camel Quarkus and Camel K solutions to make them more scalable, high-performing, and observable.</p>",
      "type": "talk",
      "tags": [
        "Camel",
        "Quarkus",
        "Kafka"
      ],
      "level": "middle",
      "speakers": [
        "cf874a75dcb4f22703fb632b069cd640aabbda7f",
        "92722ac8669606acafdd0895be1e8ee444b5fedc"
      ]
    },
    {
      "id": "62572502aa23f0085462ddab",
      "title": "Terrible Rollouts and how to Survive Them",
      "languages": [
        "eng"
      ],
      "abstract": "<p>Every developer should know that pushing feature updates to production via traditional channels is as archaic as painting on cave walls. And yet, many continue to do so.</p><p>The best developers are always quick to adapt to new, innovative technologies. This mindset is exactly what separates great developers from the average.</p><p>So how do you make sure you’re not a developer that’s stuck in the stone age when doing feature rollouts?</p><p>In this talk, I will share the insights I’ve gained so far in my career as to what should be thought about before releasing a sensitive feature, how to plan it, what type of tools should be used, and how it should be communicated (both externally and internally). Most importantly, I’ll share what should be done when it all goes wrong - and some horror stories of when it did go wrong - and yes, destroying production will be one of them.</p>",
      "type": "talk",
      "tags": [
        "#Agile",
        "#cleancode",
        "#design"
      ],
      "level": "middle",
      "speakers": [
        "14af727ca8fe920d4fb467b94577c62a09ca62a8"
      ]
    },
    {
      "id": "62572537aa23f0085462ddac",
      "title": "Implementing Kubernetes Operators with Java Operator SDK",
      "languages": [
        "eng"
      ],
      "abstract": "<p>Nowadays it's becoming a standard that developers not just build but also run their software. Managing deployments on Kubernetes it's not necessarily a simple task. In this talk we will take a look at how  Kubernetes Operators can help with that and how to write one.</p><ul><li>What are Kubernetes Operators?</li><li>What are the involved design patterns?</li><li>Why implement Kubernetes Operators in Java?</li></ul><p>First we will answer these questions. In the second part, we will live code a simple Kubernetes Operator using Java Operator SDK, that makes it very clear how to start, how a standard Operator should look like in practice and how to implement the related design patterns.</p>",
      "type": "talk",
      "tags": [
        "Kubernetes",
        "Operators",
        "Java",
        "Quarkus"
      ],
      "level": "middle",
      "speakers": [
        "508d77fd6c0d6171c5228adac3b440c1b4d2ad8a"
      ]
    },
    {
      "id": "6272d90071e11d0858e82241",
      "title": "(Mis)Understanding Cloud-Native",
      "languages": [
        "eng"
      ],
      "abstract": "<p>Cloud is great and cloud-native is really nice. However, we are often met with some misconceptions and terms that are being thrown around. Vendor lock-in, serverless, zero downtime, zero trust, scale-to-zero, and many more. Some can be confusing, and some even intimidating. In this session, we will try to bust a few myths about cloud-native development and help to develop better and more modern applications.</p>",
      "type": "talk",
      "tags": [
        "cloud",
        "kubernetes",
        "practices"
      ],
      "level": "beginner",
      "speakers": [
        "959143ffd6c954e5e544cdce71383429895e3679",
        "72b36c4f06a1b0211e42921b9815136568fa1b73"
      ]
    },
    {
      "id": "6272de1a71e11d0858e82242",
      "title": "Del final al principio: Un viaje guiado por métricas",
      "languages": [
        "es"
      ],
      "abstract": "<p>Caminar sobre el agua y desarrollar software sobre unos requisitos es fácil, siempre y cuando ambos estén congelados.</p><p>En esta sesión, explicaremos nuestro camino en el rediseño de nuestro sistema de alertas de búsquedas para usuarios y cómo el cambio de contexto y requerimientos nos hizo replantear nuestra implementación, pasando de un enfoque near-real-time a un proceso en batch. Dicha transformación supondría algunos trade-offs, pero, por otro lado, nos ha permitido escalar de unos pocos millones a decenas de millones de alertas.</p><p>De la misma manera, expondremos la importancia de definir métricas como parte de la estrategia de implementación y cómo éstas nos ayudaron a arrojar luz en los siguientes pasos.</p>",
      "type": "talk",
      "tags": [
        "observability",
        "scalability",
        "distributed system"
      ],
      "level": "middle",
      "speakers": [
        "86e816de6f93283ebd9797c0b9272a6e4850d088",
        "1fdb348ad3d0b80f86295945a9eb2069a03e6d50"
      ]
    },
    {
      "id": "6272e23171e11d0858e82243",
      "title": "Shifting Left - Securing Infrastructure as Code",
      "languages": [
        "eng"
      ],
      "abstract": "<p>A study by Unit 42 found that \"close to 200,000 potential vulnerabilities have been discovered in IaC templates. Also, more than 43% of cloud databases are currently unencrypted, and only 60% of cloud storage services have logging enabled, which in itself is a serious concern.\"</p><p>Do you also find yourself struggling with a lot of similar cloud infrastructure security alerts in slack? Or, as a developer after spearheading an automated deployment, do you spend a great deal of time going through various infrastructure as code vulnerabilities? Does your compliance report also show you numbers where MTTD and MTTR are far apart?</p><p>Join this talk if you would like to learn how and why to continuously assess, detect, and respond to cloud security threats in real-time. Learn how to implement security and compliance standards from someone who tried and failed and eventually succeeded in building an IaC Security Product from scratch.</p>",
      "type": "talk",
      "tags": [
        "#Security",
        "#Cloud",
        "#CI",
        "#CD",
        "#Integration",
        "#Cloud-Native"
      ],
      "level": "middle",
      "speakers": [
        "72036b8655975d50ae6e51b7e51402b767c06c0e"
      ]
    },
    {
      "id": "6272e73371e11d0858e82245",
      "title": "Gentle introduction to machine learning algorithms, with examples",
      "languages": [
        "eng"
      ],
      "abstract": "<p>In the past years we have seen how programs can outperform humans in many specific tasks. Machine learning algorithms are used in fields as diverse as finance, science, medicine, manufacturing industry, fashion or security. In this talk you will learn about the different algorithms in machine learning: regression, classification, clustering, dimensionality reduction and representation and reinforcement learning, and how neural networks can be used to implement them. I will show a practical example of how deep learning can be used in a computer vision task.</p>",
      "type": "talk",
      "tags": [
        "Machine Learning",
        "Deep Learning",
        "Computer Vision"
      ],
      "level": "beginner",
      "speakers": [
        "1e65ff335ce12cb03cc2dc5130ad907c4d47da6f"
      ]
    },
    {
      "id": "6272e7bc71e11d0858e82246",
      "title": "GraphQL-ify your APIs",
      "languages": [
        "eng"
      ],
      "abstract": "<p>GraphQL is query language for APIs, but what are the advantages and how would one implement such in their microservices/APIs. In this session, I will go through the basics of GraphQL, different aspects of GraphQL and architecture of such APIs. There will be a demo/live-coding on, how 4 different ways we can implement GraphQL for a Springboot microservice/API. Lots of examples, live coding and helpful comparison on structure, usage and implementations of GraphQL in Springboot & Java world.</p>",
      "type": "talk",
      "tags": [
        "GraphQL",
        "Spring Boot",
        "Java"
      ],
      "level": "beginner",
      "speakers": [
        "dc7843096c80aaceb163e68b573a9c5618c9146a"
      ]
    },
    {
      "id": "627c168c26f9720858a38eef",
      "title": "Optimal data warehouse for analytics: Apache Kafka and ClickHouse",
      "languages": [
        "eng"
      ],
      "abstract": "<p>Apache Kafka is amazing at handling real-time data feeds. However, in certain cases we need to come back to older records to analyse and process data at later times. This is challenging because storing records indefinitely and doing large scans of data in Apache Kafka is not optimal.</p><p>ClickHouse, on the other hand, is a scalable and reliable storage designed to handle petabytes of data and, at the same time, it is a powerful open-source tool for fast online analytical processing, it is now used by many companies for data analytics. What's more ClickHouse has a built-in table engine to publish and subscribe to Apache Kafka data feeds.</p><p>Hence, we can use Apache Kafka and ClickHouse in collaboration to transition older records to a data warehouse in order to perform analytics at scale on top of fresh data that Kafka provides.</p><p>In this talk you’ll learn how to use Apache Kafka together with ClickHouse and how to query the data stored in the data warehouse. This session is for those who want to perform analytics with fast response time over a huge volume of data without the need to downsample it.</p>",
      "type": "talk",
      "tags": [
        "Apache Kafka",
        "ClickHouse",
        "columnar databases",
        "OLAP",
        "analytics"
      ],
      "level": "middle",
      "speakers": [
        "f86ffeacee17037b8e78ba1a94e99659035eee78"
      ]
    },
    {
      "id": "627c16ee26f9720858a38ef0",
      "title": "Bungee jumping to Quarkus, blindfolded but happy",
      "languages": [
        "eng"
      ],
      "abstract": "<p>A year ago I started with a couple of friends a new project to create a visual editor for integrations: based on a visual drag and drop selection on building blocks, generate deployable source code.</p><p>As responsible of the backend side, I obviously chose Java to do it. Some of the challenges were to have an extendable and customizable core where we could inject module languages to generate different outputs depending on how the user wanted to deploy. We also wanted to customize the catalog of building blocks to dynamically adapt to each user. Coming from the Java 8 world with shy traces of Java 11, I decided to jump directly to Quarkus on Java 17 and explore the serverless possibilities while, at the same time, keep the over-engineering and the over-fanciness of new features as reasonable as possible.</p><p>On this talk I will describe the bowels of Kaoto.io, the journey we had to implement a stable architecture, and how it evolved into the powerful tool it is now. I will discuss about the technologies used, their shortcomings and their black magic; and why the decisions made were the right ones (or not!).</p><p>This is a good talk if you want to see Quarkus in a real use case.</p>",
      "type": "talk",
      "tags": [
        "Quarkus",
        "Java 17",
        "serverless",
        "k-native"
      ],
      "level": "beginner",
      "speakers": [
        "54502dffd46874a385c1e0c37cea135bc9240db3"
      ]
    },
    {
      "id": "627c180d26f9720858a38ef1",
      "title": "De 0 a 100 construyendo monolitos modulares que escalen a microservicios",
      "languages": [
        "es"
      ],
      "abstract": "<p>En este taller, pondremos en práctica lo visto en la charla \"Construyendo monolitos modulares que puedan escalar a microservicios\" de la edición 2021 y experimentaremos en primera persona cómo abordar el escalado de un monolito y evolucionarlo a microservicios, a medida que el proyecto crece y evoluciona en complejidad, o las necesidades de soportar una mayor carga evolucionan de distinta forma para distintas partes de la aplicación.</p><p>Para ello, partiremos de la construcción de un monolito modular utilizando técnicas de DDD, CQRS y Event-Sourcing, y veremos cuáles son las herramientas que hacen posible que el escalado sea sencillo. Comprobaremos qué es lo importante a tener en cuenta en nuestro diseño para que la división y el escalado sean sencillos.</p>",
      "type": "workshop",
      "tags": [
        "java",
        "EventSourcing",
        "microservicios",
        "monolitos"
      ],
      "level": "middle",
      "speakers": [
        "9907d2fdf89356ee1bfc20234cf2ffa7316833c2"
      ]
    },
    {
      "id": "627c1b0426f9720858a38ef6",
      "title": "Superman or Ironman - can everyone be a 10x developer?",
      "languages": [
        "eng"
      ],
      "abstract": "<p>It’s all about productivity or maybe it’s all about delivering value. Or creating secure applications, dealing with changing directions.</p><p>Whatever it it we often feel that we’re lacking - that it’s hard enough to be any sort of developer. That even 1x is often a challenge</p><p>In this talk we’re going to examine how to think more clearly about being a Java developer:, help you understand the tools and approaches that can offer practical insight into how you work now as well as providing guidance on alternatives that just might give you the powered armour you need.</p><p>A mix of tools, proven processes, new techniques and lessons learnt the hard way make up a session designed to help you understand that being a 10x developer isn’t about having super powers - it’s about using the powers you already have in wiser, more considered ways.</p>",
      "type": "workshop",
      "tags": [
        "productivity",
        "dpe",
        "java",
        "cloud",
        "security",
        "sanity",
        "imposter"
      ],
      "level": "beginner",
      "speakers": [
        "5656dc7f3ecb7ca028ff6382f862467404769dfa",
        "1eb862c7a058f67d5b1e4fcd98fa2d2ce12fe5c0"
      ]
    },
    {
      "id": "627c1bdd26f9720858a38ef7",
      "title": "The ups and downs of deploying AI in the wild",
      "languages": [
        "eng",
        "es"
      ],
      "abstract": "<p>Have you ever faced a professional challenge where you just didn’t know where to start?​</p><p>What happens to an AI model once it’s been trained and tested? In this talk, I’m going to share how I transformed into a data engineer for the duration of two weeks, while on the mission to deploy our AI models in a Cloudera datalake using Spark.</p>",
      "type": "talk",
      "tags": [
        "Artificial intelligence",
        "machine learning",
        "NLP",
        "integration",
        "spark",
        "personal challenges"
      ],
      "level": "middle",
      "speakers": [
        "b3da9cdff962b1acbca9868acc10361463f07614"
      ]
    }
  ]
}
