{
  "items": [
    {
      "enabled": "1",
      "name": "Viktor Farcic",
      "company": "Shipa",
      "description": "Open-Source Program Manager @ Shipa",
      "biography": "Viktor Farcic is an Open-Source Program Manager & Developer Advocate at Shipa, a member of the Google Developer Experts and Docker Captains groups, and a published author.\n\nHis big passions are DevOps, GitOps, Microservices, Continuous Integration, Delivery and Deployment (CI/CD), and Test-Driven Development (TDD).\n\nHe often speaks at community gatherings and conferences.\n\nHe is a host of the YouTube channel DevOps Toolkit and a co-host of DevOps Paradox. He published The DevOps Toolkit Series and Test-Driven Java Development.",
      "image": "assets/img/speakers/viktor-farcic.jpg",
      "ref": "0ba89c51baf9f8542188bd750973e0767fbcaa68",
      "url": "infoSpeaker.html?ref=0ba89c51baf9f8542188bd750973e0767fbcaa68",
      "homepage": "https://devopstoolkitseries.com/",
      "twitter": "@vfarcic",
      "linkedin": "https://www.linkedin.com/in/viktorfarcic/"
    },
    {
      "enabled": "1",
      "name": "Alex Soto",
      "company": "Red Hat",
      "description": "Director of Developer Experience",
      "biography": "Alex Soto is a Director of Developer Experience at Red Hat. He is passionate about the Java world, software automation and he believes in the open-source software model. Alex is the co-author of Testing Java Microservices and Quarkus cookbook books and contributor to several open-source projects. \n\nA Java Champion since 2017, he is also an international speaker and teacher at Salle URL University. You can follow him on Twitter (@alexsotob) to stay tuned to what’s going on in Kubernetes and Java world.\n",
      "image": "assets/img/speakers/alex-soto.jpg",
      "ref": "1cf43210c8515585e52e4d2f6f2e5e0f582049d8",
      "url": "infoSpeaker.html?ref=1cf43210c8515585e52e4d2f6f2e5e0f582049d8",
      "homepage": "",
      "twitter": "@alexsotob",
      "linkedin": ""
    },
    {
      "enabled": "1",
      "name": "Thomas Vitale",
      "company": "Systematic",
      "description": "Senior Software Engineer",
      "biography": "I’m a Senior Software Engineer specialized in building modern, cloud native, robust, and secure enterprise applications. I’m the author of “Cloud Native Spring in Action”, published by Manning. I develop enterprise software solutions at Systematic, Denmark, supporting home care, social services, and help to citizens. I have led the development of features to ensure a high degree of security and data privacy in our products and worked on modernizing our platforms and applications for the cloud-native world. I have an MSc in Computer Engineering specializing in software from the Polytechnic University of Turin (Italy). I’m a Red Hat Certified Enterprise Application Developer and Pivotal Certified Spring Professional. I’ve been building Java applications for more than five years, using Spring and Java EE/Jakarta EE. I like contributing to open source projects like Spring Security, Spring Cloud, and Keycloak, and I write articles about application security, cloud development, and JVM languages and frameworks on my blog: https://www.thomasvitale.com.",
      "image": "assets/img/speakers/thomas-vitale.jpg",
      "ref": "19243e47c15a9592009ca961a856d0091d957ab8",
      "url": "infoSpeaker.html?ref=19243e47c15a9592009ca961a856d0091d957ab8",
      "homepage": "https://www.thomasvitale.com/",
      "twitter": "@vitalethomas",
      "linkedin": "https://www.linkedin.com/in/vitalethomas/?locale=en_US"
    }
  ]
}