{
  "items": [
    {
      "enabled": "1",
      "name": "Anton Rodríguez",
      "company": "New Relic",
      "description": "Principal Software Engineer",
      "biography": "Antón is a Principal Software Engineer focused on Data in motion. He has experience working with different message brokers, event streaming platforms and stream processing frameworks. During his career, he specialised in building internal SaaS in big corporations to make complex technologies easily used and adopted by teams so they can build solutions to real business use cases. He’s also a JUG organiser, blogger, podcaster and speaker.",
      "image": "assets/img/speakers/anton-rodriguez.jpeg",
      "ref": "2b14d512d954c54d2bce56f69c2a7e1b755bee2f",
      "url": "infoSpeaker.html?ref=2b14d512d954c54d2bce56f69c2a7e1b755bee2f",
      "homepage": "https://www.galiglobal.com",
      "twitter": "@antonmry",
      "linkedin": "https://www.linkedin.com/in/antonmry/"
    },
    {
      "enabled": "1",
      "name": "Gopal S Akshintala",
      "company": "Salesforce",
      "description": "Senior Member of Technical Staff. Backend Developer ",
      "biography": "My proposal was approved in JBCN Conf 2020 as well, but unfortunately the event got cancelled due to COVID. I am an international speaker, and you may find all my recorded talks in multiple conferences and meetups here: https://overfullstack.ga/my-talks/\n\nYou may find more about me here: https://overfullstack.ga/about-me",
      "image": "assets/img/speakers/gopal-akshintala.png",
      "ref": "fb4fc6057fcdc50798fa601ea43883688923960d",
      "url": "infoSpeaker.html?ref=fb4fc6057fcdc50798fa601ea43883688923960d",
      "homepage": "https://overfullstack.ga/",
      "twitter": "@GopalAkshintala",
      "linkedin": "https://www.linkedin.com/in/gopal-s-akshintala/"
    },
    {
      "enabled": "1",
      "name": "Viktor Farcic",
      "company": "Shipa",
      "description": "Open-Source Program Manager @ Shipa",
      "biography": "Viktor Farcic is an Open-Source Program Manager & Developer Advocate at Shipa, a member of the Google Developer Experts and Docker Captains groups, and a published author.\n\nHis big passions are DevOps, GitOps, Microservices, Continuous Integration, Delivery and Deployment (CI/CD), and Test-Driven Development (TDD).\n\nHe often speaks at community gatherings and conferences.\n\nHe is a host of the YouTube channel DevOps Toolkit and a co-host of DevOps Paradox. He published The DevOps Toolkit Series and Test-Driven Java Development.",
      "image": "assets/img/speakers/viktor-farcic.jpg",
      "ref": "0ba89c51baf9f8542188bd750973e0767fbcaa68",
      "url": "infoSpeaker.html?ref=0ba89c51baf9f8542188bd750973e0767fbcaa68",
      "homepage": "https://devopstoolkitseries.com/",
      "twitter": "@vfarcic",
      "linkedin": "https://www.linkedin.com/in/viktorfarcic/"
    },
    {
      "enabled": "1",
      "name": "  Dmitry Aleksandrov",
      "company": "Oracle",
      "description": "Software Developer",
      "biography": "Dmitry is a software developer at Oracle, Java Champion, Oracle Groundbreaker. Currently working on Project Helidon. He has more than a decade experience mainly in Java Enterprise in banking/telecom, but interested in dynamic languages on JVM and features like massive computations on GPUs. A true believer in open source and community driven initiatives. He is a co-lead of the Bulgarian Java User Group and co-organizer of jPrime Conf. \nDmitry is a blogger and also a frequent speaker at local events as well as conferences like JavaOne/CodeOne, Devoxx/Voxxed and Joker/JPoint.\n",
      "image": "assets/img/speakers/dmitry-alexandrov.jpeg",
      "ref": "67155bca8730b7491ee45017054743b97982f3fb",
      "url": "infoSpeaker.html?ref=67155bca8730b7491ee45017054743b97982f3fb",
      "homepage": "",
      "twitter": "@bercut2000",
      "linkedin": ""
    },
    {
      "enabled": "1",
      "name": "Mauricio Salatino",
      "company": "LearnK8s",
      "description": "Cloud Distributed Engineer",
      "biography": "Mauricio empezó a trabajar con Kubernetes hace 5 años y desde ese momento ha participado en varios proyectos Open Source relacionados con ayudar a la experiencia y eficiencia a la hora de adoptar distintas Plataformas Cloud. Mauricio tiene un blog http://Salaboy.com y Twitter @salaboy. Mauricio empezó a dar cursos de Kubernetes para http://LearnK8s.io hace dos años, donde ha estado expuesto a distintos casos de uso, herramientas y proyectos relacionados con cloud native.",
      "image": "assets/img/speakers/mauricio-salatino.png",
      "ref": "4b26a098aafaf6bc3d533389b61d3ef5ab01f5a3",
      "url": "infoSpeaker.html?ref=4b26a098aafaf6bc3d533389b61d3ef5ab01f5a3",
      "homepage": "http://salaboy.com",
      "twitter": "@salaboy",
      "linkedin": "https://linkedin.com/in/salaboy"
    },
    {
      "enabled": "1",
      "name": "Mary Grygleski",
      "company": "IBM",
      "description": "Developer Advocate",
      "biography": "Mary is a Senior Developer Advocate at IBM with the Liberty/Websphere team, focusing on Liberty, Microprofile, Jakarta EE, Java, Open Source, Cloud, and Distributed Systems.  She transitioned from Unix/C to Java around 2000 and has never looked back since then.  She considers herself as a polyglot and loves to continue learning new and better ways to solve real-life problems. She is an active tech community builder outside of her day job, and currently the president of the Chicago Java Users Group (CJUG), as well as a co-organizer for several IBM-sponsored meetup groups in the Greater Chicago area.\n",
      "image": "assets/img/speakers/mary-grygleski.png",
      "ref": "443a683fa84a77151521434bf96a7a082d29d361",
      "url": "infoSpeaker.html?ref=443a683fa84a77151521434bf96a7a082d29d361",
      "homepage": "https://dev.to/mgrygles",
      "twitter": "@mgrygles",
      "linkedin": "https://www.linkedin.com/in/mary-grygleski/"
    },
    {
      "enabled": "1",
      "name": "Uriel Salischiker",
      "company": "Dynatrace",
      "description": "Software Engineer @ Dynatrace",
      "biography": "Software Engineer @ Dynatrace, originally from Argentina. Worked at companies like Expedia, N26, Zopa and Dynatrace. Ask me about Kotlin :)",
      "image": "assets/img/speakers/uriel-salis.png",
      "ref": "f3572dc7d443088b08e41c3c094c425dc6d7d0d7",
      "url": "infoSpeaker.html?ref=f3572dc7d443088b08e41c3c094c425dc6d7d0d7",
      "homepage": "https://urielsalis.com",
      "twitter": "urielsalis",
      "linkedin": "linkedin.com/in/urielsalis"
    },
    {
      "enabled": "1",
      "name": "Thomas Vitale",
      "company": "Systematic",
      "description": "Senior Software Engineer",
      "biography": "I’m a Senior Software Engineer specialized in building modern, cloud native, robust, and secure enterprise applications. I’m the author of “Cloud Native Spring in Action”, published by Manning. I develop enterprise software solutions at Systematic, Denmark, supporting home care, social services, and help to citizens. I have led the development of features to ensure a high degree of security and data privacy in our products and worked on modernizing our platforms and applications for the cloud-native world. I have an MSc in Computer Engineering specializing in software from the Polytechnic University of Turin (Italy). I’m a Red Hat Certified Enterprise Application Developer and Pivotal Certified Spring Professional. I’ve been building Java applications for more than five years, using Spring and Java EE/Jakarta EE. I like contributing to open source projects like Spring Security, Spring Cloud, and Keycloak, and I write articles about application security, cloud development, and JVM languages and frameworks on my blog: https://www.thomasvitale.com.",
      "image": "assets/img/speakers/thomas-vitale.jpg",
      "ref": "19243e47c15a9592009ca961a856d0091d957ab8",
      "url": "infoSpeaker.html?ref=19243e47c15a9592009ca961a856d0091d957ab8",
      "homepage": "https://www.thomasvitale.com/",
      "twitter": "@vitalethomas",
      "linkedin": "https://www.linkedin.com/in/vitalethomas/?locale=en_US"
    },
    {
      "enabled": "1",
      "name": "Nicolas Fränkel",
      "company": "Hazelcast",
      "description": "Developer Advocate",
      "biography": "Developer Advocate with 15+ years experience consulting for many different customers, in a wide range of contexts (such as telecoms, banking, insurances, large retail and public sector). Usually working on Java/Java EE and Spring technologies, but with focused interests like Rich Internet Applications, Testing, CI/CD and DevOps. Currently working for Hazelcast. Also double as a trainer and triples as a book author.",
      "image": "assets/img/speakers/nicolas-frankel.jpg",
      "ref": "a0fa74f04ff057c970f863cf2b2050b7ce55e4de",
      "url": "infoSpeaker.html?ref=a0fa74f04ff057c970f863cf2b2050b7ce55e4de",
      "homepage": "https://blog.frankel.ch/",
      "twitter": "@nicolas_frankel",
      "linkedin": ""
    },
    {
      "enabled": "1",
      "name": "Ana-Maria Mihalceanu",
      "company": "IBM",
      "description": "Architect",
      "biography": "Ana is a Java Champion, Architect, co-founder of Bucharest Software Craftsmanship Community, and a constant adopter of challenging technical scenarios involving Java-based frameworks and multiple cloud providers. She is an active supporter of technical communities’ growth through knowledge sharing and enjoys curating content for conferences as a program committee member. To learn more about/from her, follow her on Twitter @ammbra1508.",
      "image": "assets/img/speakers/ana-maria-mihalceanu.jpg",
      "ref": "959143ffd6c954e5e544cdce71383429895e3679",
      "url": "infoSpeaker.html?ref=959143ffd6c954e5e544cdce71383429895e3679",
      "homepage": "",
      "twitter": "@ammbra1508",
      "linkedin": ""
    },
    {
      "enabled": "1",
      "name": "David Gómez G.",
      "company": "AxonIQ",
      "description": "Developer Advocate",
      "biography": "\nWith more than 20 years of experience in software development, has been part, lead, and developed projects for Banking, Insurance, Defense and Sea & ground transportation business. Aside from software development, he is also dedicated to training: a former Spring Certified instructor, he is delivering the JavaSpecialists Master courses for advanced Java topics in Spain. In fact, he has delivered more than 50 training courses all over Spain from 2009 to date. David is a JavaChampion since January 2020.\n",
      "image": "assets/img/speakers/david-gomez.jpg",
      "ref": "5078494b5b849a1474ce3ec801d23b06cffa5e20",
      "url": "infoSpeaker.html?ref=5078494b5b849a1474ce3ec801d23b06cffa5e20",
      "homepage": "",
      "twitter": "@dgomezg",
      "linkedin": "https://www.linkedin.com/in/dgomezg/"
    },
    {
      "enabled": "1",
      "name": "Aurea Munoz",
      "company": "Red Hat",
      "description": "Software engineer",
      "biography": " Senior Software Engineer\n\nI am a software developer since 2005 and I develop Java web applications. I live in Madrid and I'm working for Red Hat with a focus on the integration of Spring Boot &amp; Spring Cloud technology within the Red Hat Middleware portfolio. I contribute to existing or new Spring(Boot) &amp; Cloud projects and enhance the developer experience by developing tools around Spring(Boot) technology.\n",
      "image": "assets/img/speakers/aurea-munoz.png",
      "ref": "9e90e9ceb9ba68f67332f4efc12576651ca448a3",
      "url": "infoSpeaker.html?ref=9e90e9ceb9ba68f67332f4efc12576651ca448a3",
      "homepage": "",
      "twitter": "@auritamh",
      "linkedin": "https://www.linkedin.com/in/aureamunozhernandez/?locale=en_US"
    },
    {
      "enabled": "1",
      "name": "Alex Soto",
      "company": "Red Hat",
      "description": "Director of Developer Experience",
      "biography": "Alex Soto is a Director of Developer Experience at Red Hat. He is passionate about the Java world, software automation and he believes in the open-source software model. Alex is the co-author of Testing Java Microservices and Quarkus cookbook books and contributor to several open-source projects. \n\nA Java Champion since 2017, he is also an international speaker and teacher at Salle URL University. You can follow him on Twitter (@alexsotob) to stay tuned to what’s going on in Kubernetes and Java world.\n",
      "image": "assets/img/speakers/alex-soto.jpg",
      "ref": "1cf43210c8515585e52e4d2f6f2e5e0f582049d8",
      "url": "infoSpeaker.html?ref=1cf43210c8515585e52e4d2f6f2e5e0f582049d8",
      "homepage": "",
      "twitter": "@alexsotob",
      "linkedin": ""
    }
  ]
}