{
  "items": [
    {
      "name": "Venkat Subramaniam",
      "description": "Java Champion, Founder of Agile Developer, Inc.",
      "biography": "Dr. Venkat Subramaniam is an award-winning author, founder of Agile Developer, Inc., creator of agilelearner.com, and an instructional professor at the University of Houston. He has trained and mentored thousands of software developers in the US, Canada, Europe, and Asia, and is a regularly-invited speaker at several international conferences. Venkat helps his clients effectively apply and succeed with sustainable agile practices on their software projects. Venkat is a (co)author of multiple technical books, including the 2007 Jolt Productivity award winning book Practices of an Agile Developer. You can find a list of his books at agiledeveloper.com. You can reach him by email at venkats@agiledeveloper.com or on twitter at @venkat_s.",
      "enabled": "1",
      "homepage": "http://agiledeveloper.com",
      "image": "assets/img/speakers/venkat-subramaniam.jpg",
      "ref": "d2c05e60af702984122c68c8a46fc574fba6f726",
      "url": "infoSpeaker.html?ref=d2c05e60af702984122c68c8a46fc574fba6f726",
      "twitter": "@venkat_s"
    },
    {
      "biography": "Josh (@starbuxman) is the Spring Developer Advocate at Pivotal. Josh is a Java Champion, author of 6 books (including O'Reilly's Cloud Native Java: Designing Resilient Systems with Spring Boot, Spring Cloud, and Cloud Foundry and the upcoming Reactive Spring) and numerous best-selling video trainings (including Building Microservices with Spring Boot Livelessons with Spring Boot co-founder Phil Webb), and an open-source contributor (Spring Boot, Spring Integration, Spring Cloud, Activiti and Vaadin)",
      "description": "Spring Developer Advocate at Pivotal and Java Champion",
      "enabled": "1",
      "homepage": "http://Start.Spring.IO",
      "image": "assets/img/speakers/josh-1.jpg",
      "name": "Josh Long",
      "ref": "3803f8e428feb905178afd9025cfc53fb47a8abc",
      "twitter": "@starbuxman",
      "url": "infoSpeaker.html?ref=3803f8e428feb905178afd9025cfc53fb47a8abc"
    },
    {
      "biography": "Martin is a Java Champion with over 2 decades of experience building complex and high-performance computing systems. He is most recently known for his work on Aeron and SBE. Previously at LMAX he was a co-founder and CTO when he created the Disruptor. Prior to LMAX Martin worked for Betfair, content companies with the world largest product catalogues, and was a lead on some of the most significant C++ and Java systems of the 1990s.",
      "description": "Java Champion, high-performance & low-latency computing specialist",
      "enabled": "1",
      "homepage": "",
      "image": "assets/img/speakers/martin-thompson.png",
      "name": "Martin Thompson",
      "ref": "8f62b44cd97764484d759b364f5bf32e558a5edd",
      "twitter": "@mjpt777",
      "url": "infoSpeaker.html?ref=8f62b44cd97764484d759b364f5bf32e558a5edd"
    },
    {
      "biography": "Włodek Krakowski is a team leader and independent technical trainer. Also a developer if the time allows. His main interest is taking care of delivering valued software from different perspectives. These are how people take care of quality of code, how people work together towards providing business value, how people help to grow each other and how people are managed. Currently he works for Ocado as IT Team Leader in Kraków, Poland and also delivers technical / refactoring trainings at www.refactoring.pl.",
      "description": "Team leader at Ocado",
      "enabled": "1",
      "homepage": "http://www.refactoring.pl",
      "image": "assets/img/speakers/wlodek.jpg",
      "name": "Wlodek Krakowski",
      "ref": "34e64a4d88094a0c4231d49cc0305d61d7b854ee",
      "twitter": "@wlodekkr",
      "url": "infoSpeaker.html?ref=34e64a4d88094a0c4231d49cc0305d61d7b854ee",
      "linkedin": "https://www.linkedin.com/in/wlodek-krakowski/"
    },
    {
      "biography": "Grzegorz Piwowarek is a hungry-for-knowledge lead system engineer at Casumo, a trainer at Bottega IT Minds, a blogger at 4comprehension.com, and an OS contributor.\n\nHe was professionally involved in projects involving systems integration, image recognition, and recently highly scalable distributed solutions - improving everything that he sees.\n",
      "description": "Lead system engineer at Casumo",
      "enabled": "1",
      "homepage": "https://4comprehension.com",
      "image": "assets/img/speakers/grzegorz-piwowarek.jpg",
      "name": "Grzegorz Piwowarek",
      "ref": "dcf4d5f83bc2dab51fb90922055352668da14a18",
      "twitter": "@pivovarit",
      "url": "infoSpeaker.html?ref=dcf4d5f83bc2dab51fb90922055352668da14a18"
    },
    {
      "biography": "Rosanne is a Software Engineer currently working at Blue4IT. She came the long way around in the IT field with her bachelors degree in Psychology. She works for top companies in the Netherlands always questioning the way things were done. She also likes puzzles, meditating and yoga. ",
      "description": "Software Engineer at Blue4IT",
      "enabled": "1",
      "homepage": "",
      "image": "assets/img/speakers/rosanne-joosten.png",
      "name": "Rosanne Joosten",
      "ref": "f99b4c8793cc70d6cfcb9b1c78e7c99a76b10d2e",
      "twitter": "@JoostenRosanne",
      "url": "infoSpeaker.html?ref=f99b4c8793cc70d6cfcb9b1c78e7c99a76b10d2e"
    },
    {
      "biography": "Mario is a principal software engineer at Red Hat working as project lead of Drools, the JBoss rule engine. He has a huge experience as Java developer having been involved in (and often leading) many enterprise level projects in several industries ranging from media companies to the financial sector. Among his interests there are also functional programming and Domain Specific Languages. By leveraging these 2 passions he created the open source library lambdaj with the purposes of providing an internal Java DSL for manipulating collections and allowing a bit of functional programming in Java. He is also a Java Champion and the co-author of \"Java 8 in Action\" published by Manning.\n",
      "description": "Principal software engineer at Red Hat",
      "enabled": "1",
      "homepage": "",
      "image": "assets/img/speakers/mario-fusco.png",
      "name": "Mario Fusco",
      "ref": "16fd0826550372e61a8c17d3acdf30d0871de728",
      "twitter": "@mariofusco",
      "url": "infoSpeaker.html?ref=16fd0826550372e61a8c17d3acdf30d0871de728"
    },
    {
      "enabled": "1",
      "name": "Audrey Neveu",
      "description": "Fullstack developer at Saagie, Devoxx4Kids hacktivist",
      "biography": "Audrey is a full-stack passion driven developer working for Saagie. Heavily involved in the French wide Java Community, she’s part of Devoxx4Kids, a not-for-profit global initiative to get children coding, Devoxx France and Les Cast Codeurs, a french podcast on Java, but not only. ",
      "image": "assets/img/speakers/audrey-neveu.jpeg",
      "ref": "df5c3701545056ca5229efe9b77ad91acf69ea02",
      "url": "infoSpeaker.html?ref=df5c3701545056ca5229efe9b77ad91acf69ea02",
      "homepage": "",
      "twitter": "@Audrey_Neveu"
    },
    {
      "enabled": "1",
      "name": "Rafael Benevides",
      "description": "Director of Developer Experience at Red Hat",
      "biography": "Rafael Benevides is Director of Developer Experience at Red Hat. With many years of experience in several fields of the IT industry, he helps developers and companies all over the world to be more effective in software development. Rafael considers himself a problem solver who has a big love for sharing. He is a member of Apache DeltaSpike PMC - a Duke’s Choice Award winner project, and a speaker in conferences like JavaOne, Devoxx, TDC, DevNexus and many others.",
      "image": "assets/img/speakers/rafaelbenevides.png",
      "ref": "c5224c12852709f7ae60fa80d93f46fd2d64a5c4",
      "url": "infoSpeaker.html?ref=c5224c12852709f7ae60fa80d93f46fd2d64a5c4",
      "homepage": "",
      "twitter": "@rafabene"
    },
    {
      "enabled": "1",
      "name": "Mercedes Wyss",
      "description": "CTO at Produactivity, Oracle Groundbreaker, Auth0 Ambassador",
      "biography": "Mercedes Wyss is a software engineer with more than seven years of experience in the backend, frontend and Android development using Java and Kotlin. Currently, she is a CTO at Produactivity, a startup based in Guatemala. \n\nShe was previously organizing meetings in Guatemala Java Users Group from 2012 to 2016. Now she has two years an a half focusing on increasing women’s participation in STEAM by running a JDuchess Chapter in Guatemala and is theleader of a Google community (Devs+502). \n\nShe is an Oracle Groundbreaker Ambassador and an Auth0 Ambassador, she also has a Duke’s Choice Award in Educational Outreach.",
      "image": "assets/img/speakers/mercedes-wyss.png",
      "ref": "d43c4a28c6222750fcef9b5b50013ea8ed897d19",
      "url": "infoSpeaker.html?ref=d43c4a28c6222750fcef9b5b50013ea8ed897d19",
      "homepage": "https://medium.com/@itrjwyss",
      "twitter": "@itrjwyss"
    },
    {
      "enabled": "1",
      "name": "Sebastian Daschner",
      "description": "Java Champion, Lead Java Developer Advocate at IBM",
      "biography": "Sebastian Daschner is a Java Developer Advocate at IBM, a consultant, author, and trainer. He is the author of the book ‘Architecting Modern Java EE Applications’. Sebastian is participating in the JCP, helping forming the future standards of Java EE, serving in the JAX-RS, JSON-P and Config Expert Groups and collaborating on various open source projects. For his contributions in the Java community and ecosystem he was recognized as a Java Champion,Oracle Developer Champion and double 2016 JavaOne Rockstar. Besides Java, Sebastian is also a heavy user of cloud native technologies. He evangelizes computer science practices on https://blog.sebastian-daschner.com, his newsletter, andon Twitter via @DaschnerS. When not working with Java, he also loves to travel the world — either by plane or motorbike.",
      "image": "assets/img/speakers/sebastian-daschner.jpg",
      "ref": "1799a6d25dbe9b65e5a25078815b20fc9af956f4",
      "url": "infoSpeaker.html?ref=1799a6d25dbe9b65e5a25078815b20fc9af956f4",
      "homepage": "https://blog.sebastian-daschner.com",
      "twitter": "@DaschnerS"
    },
    {
      "enabled": "1",
      "name": "Alberto Salazar",
      "description": "Entrepreneur, Java Champion and founder of the Ecuador Java User Group",
      "biography": "Alberto Salazar is an entrepreneur, passionate Consultant, Java Champion, Oracle Groundbreaker Ambassador, JUG Leader, Auth0 Ambassador, founder of the Ecuador Java User Group, Java Community Process Associate Member and Java evangelist/trainer. He is the co-author of the book 'Software Architecture with Spring 5.0'. Alberto has been working for 2 decades creating large scalable and high transaction load systems from military software to banking solutions. He is also a frequent speaker at Java conferences such as Oracle Code One, Voxxed Days, Oracle Code, Red Hat Summit, JavaOne,  Oracle Developer Tour Latam, OTN Tours, and local JUG meetings.",
      "image": "assets/img/speakers/alberto-salazar.jpg",
      "ref": "4f72f63b37fb9bb3781b7e7b1e3246b1364c02a2",
      "url": "infoSpeaker.html?ref=4f72f63b37fb9bb3781b7e7b1e3246b1364c02a2",
      "homepage": "https://lasalazarr.github.io/blog/",
      "twitter": "@betoSalazar"
    },
    {
      "enabled": "1",
      "name": "Christian Posta",
      "description": "Field CTO @soloio_inc, Speaker, Author of \"Istio in Action\" & \"Microservices for Java Developers\"",
      "biography": "Christian (@christianposta) is Field CTO of cloud application development. He's a global speaker, author, mentor, architect, and contributor to open-source projects. His latest book, Istio in Action, is due out Summer 2019. ",
      "image": "assets/img/speakers/christian-posta.jpg",
      "ref": "5f729db9302ead529bf5818e137c0d3117f33fec",
      "url": "infoSpeaker.html?ref=5f729db9302ead529bf5818e137c0d3117f33fec",
      "homepage": "http://blog.christianposta.com",
      "twitter": "@christianposta"
    },
    {
      "enabled": "1",
      "name": "Marcus Biel",
      "description": "Director of Developer Experience EMEA for RedHat",
      "biography": "Marcus is a Clean Code evangelist who has authored a series of video tutorials that focus on teaching others how to create the cleanest and most well-structured code possible. As a conference speaker, he shares his ideas on Java Clean Code development. Marcus is also an author, technical book reviewer and JCP member. In 2017, Marcus was named TOP 13 Java influencer worldwide by jaxenter.com. On his website Clean Code Academy, he offers comprehensive online training for Java Clean Coding.",
      "image": "assets/img/speakers/marcus-biel.jpg",
      "ref": "1910f00e3b6a8220979782a1355b8570de1beca0",
      "url": "infoSpeaker.html?ref=1910f00e3b6a8220979782a1355b8570de1beca0",
      "homepage": "https://marcus-biel.com",
      "twitter": "@MarcusBiel"
    },
    {
      "enabled": "1",
      "name": "Rustam Mehmandarov",
      "description": "Java Champion and Leader of JavaZone",
      "biography": "Passionate computer scientist. Leader of JavaZone. Board member and ex-chairman of Norwegian JUG – javaBin. Course instructor. Speaker. Java Champion.",
      "image": "assets/img/speakers/rustam-mehmandarov.jpg",
      "ref": "ce11badd5e660b5bf2b2025e167a91c302c937d5",
      "url": "infoSpeaker.html?ref=ce11badd5e660b5bf2b2025e167a91c302c937d5",
      "homepage": "",
      "twitter": "@rmehmandarov"
    },
    {
      "enabled": "1",
      "name": "Mads Opheim",
      "description": "Tech Leas at Computas",
      "biography": "Tech lead who wants to make people awesome in a safe environment. Test-driven development, Domain-driven design and Modern agile are favourite techniques. Working as tech lead in Computas, currently on a project for the Norwegian Courts.",
      "image": "assets/img/speakers/mads-opheim.jpg",
      "ref": "e4dbc8f86240f1f78408c1e967137aa5d8824024",
      "url": "infoSpeaker.html?ref=e4dbc8f86240f1f78408c1e967137aa5d8824024",
      "homepage": "https://github.com/madsop/talks",
      "twitter": "@madsopheim"
    },
    {
      "enabled": "1",
      "name": "Victor Rentea",
      "description": "Independent Trainer & Coach, Lead Architect at IBM Romania",
      "biography": "Victor is one of the top Technical Trainers in Romania. He trained and coached more than 1000 developers of 30+ companies over the 6 years of his training activity. At IBM, even though they call him a Lead Architect, he writes code each day: he’s maniac about Clean Code, so expect seeing some hard-core refactoring. Victor is a key community member: organized the largest 3 Bucharest Java User Group meetups in history. In 2018 he founded the **Bucharest Software Craftsmanship Community** in which he runs open sessions about clean code, refactoring, pair programming and TDD. He posts daily on LinkedIN and Twitter thoughts about culture, technical excellence and Software Craftsmanship. Victor is now regularly invited to speak at major international conferences (30+ talks until now, #2 best at Devoxx Belgium 2018). His live-coding sessions are insane, lightning-fast but well crafted, full of enthusiasm, deep insights and take-away tips. Things that he learned the hard way during his 14 years of experience. You can find out more about him on http://victorrentea.ro",
      "image": "assets/img/speakers/victor-rentea.jpg",
      "ref": "d27efdbbf9293c1d2cbcb35559c2558a0707a484",
      "url": "infoSpeaker.html?ref=d27efdbbf9293c1d2cbcb35559c2558a0707a484",
      "homepage": "http://victorrentea.ro",
      "twitter": "@victorrentea"
    },
    {
      "enabled": "1",
      "name": "Nate Schutta",
      "description": "Developer Advocate at Pivotal",
      "biography": "Nathaniel T. Schutta is a software architect focused on cloud computing and building usable applications. A proponent of polyglot programming, Nate has written multiple books and appeared in various videos. Nate is a seasoned speaker regularly presenting at conferences worldwide, No Fluff Just Stuff symposia, meetups, universities, and user groups. In addition to his day job, Nate is an adjunct professor at the University of Minnesota where he teaches students to embrace dynamic languages. Driven to rid the world of bad presentations, Nate coauthored the book Presentation Patterns with Neal Ford and Matthew McCullough. Nate recently published Thinking Architecturally available as a free download from Pivotal.",
      "image": "assets/img/speakers/nate-schutta.jpg",
      "ref": "ab822b577be6a2418593327d0530f2e48da634a4",
      "url": "infoSpeaker.html?ref=ab822b577be6a2418593327d0530f2e48da634a4",
      "homepage": "http://www.ntschutta.io",
      "twitter": "@ntschutta"
    },
    {
      "biography": "Arun Gupta is a Principal Technologist at Amazon Web Services. He is responsible for the Cloud Native Computing Foundation (CNCF) strategy within AWS, and participates at CNCF Board and technical meetings actively. He works with different teams at Amazon to help define their open source strategy. He has built and led developer communities for several years. He has extensive speaking experience in 45+ countries on myriad topics. Gupta also founded the Devoxx4Kids chapter in the US and continues to promote technology education among children. A prolific writer, author of several books, an avid runner, a globe trotter, a Docker Captain, a Java Champion, a JUG leader, he is easily accessible at @arungupta on twitter.",
      "description": "Principal Technologist at Amazon Web Services",
      "enabled": "1",
      "homepage": "",
      "image": "assets/img/speakers/arun-gupta.png",
      "linkedin": "",
      "name": "Arun Gupta",
      "ref": "de5b08c6aec163137cfb4a1ee530799b48812be8",
      "twitter": "@arungupta",
      "url": "infoSpeaker.html?ref=de5b08c6aec163137cfb4a1ee530799b48812be8"
    },
    {
      "enabled": "1",
      "name": "Billy Korando",
      "description": "Developer Advocate with @IBM, International speaker",
      "biography": "Billy is a developer advocate with IBM and has over a decade of experience. Billy is passionate about finding ways to reduce mental capacity waste from tedious work; such as project initiation, deployment, testing and validation, and so on through automation and good management practices. Outside of work Billy enjoy traveling, playing kickball, and having his heartbroken by cheering on the Kansas City Chiefs.\n",
      "image": "assets/img/speakers/billy-korando.jpg",
      "ref": "459fc7466dfa9163817d35cc884ca96e154c2420",
      "url": "infoSpeaker.html?ref=459fc7466dfa9163817d35cc884ca96e154c2420",
      "homepage": "https://billykorando.com",
      "twitter": "@BillyKorando"
    },
    {
      "enabled": "1",
      "name": "Alex Soto",
      "description": "Java Champion, Engineer @ Red Hat. Speaker, CoAuthor of Testing Java Microservices book, Member of JSR374 and Java advocate",
      "biography": "Alex is a Software Engineer at Red Hat in Developers group. He is a passionate about Java world, software automation and he believes in the opensource software model.\n\nAlex is the creator of NoSQLUnit project, member of JSR374 (Java API for JSON Processing) Expert Group, the co-author of Testing Java Microservices book for Manning and contributor of several open source projects. A Java Champion since 2017 and international speaker, he has talked about new testing techniques for microservices and continuous delivery in the 21st century.",
      "image": "assets/img/speakers/alex-soto.jpg",
      "ref": "1cf43210c8515585e52e4d2f6f2e5e0f582049d8",
      "url": "infoSpeaker.html?ref=1cf43210c8515585e52e4d2f6f2e5e0f582049d8",
      "homepage": "http://www.lordofthejars.com",
      "twitter": "@alexsotob"
    },
    {
      "enabled": "1",
      "name": "David Gageot",
      "description": "Developer Advocate at Google Cloud",
      "biography": "David is a Developer Advocate at Google Cloud.\nHe's working on Containers Tools, especially on developer experience.\n\nPreviously, he helped open the R&D office of Docker in Paris\nto work on Docker for Mac and Docker for Windows.",
      "image": "assets/img/speakers/david-gageot.jpg",
      "ref": "b728a02f2048c81298ca0a5a9bee9e82d7318f18",
      "url": "infoSpeaker.html?ref=b728a02f2048c81298ca0a5a9bee9e82d7318f18",
      "homepage": "",
      "twitter": "dgageot",
      "linkedin": ""
    },
    {
      "enabled": "1",
      "name": "Paulien van Alst",
      "description": "Engineer at OpenValue",
      "biography": "Paulien is a passionate software engineer in love with readable, reliable and testable code, independent on the language or technology used. At OpenValue she works on helping companies setting up better software. Lately, she is giving Kotlin workshops and presentations about migrating from Java to Kotlin. In her free time, she likes to sport, cycling and swimming in particular. ",
      "image": "assets/img/speakers/paulien-vanalst.jpg",
      "ref": "5d1b321ccc69de748beba885f56dec92485f328a",
      "url": "infoSpeaker.html?ref=5d1b321ccc69de748beba885f56dec92485f328a",
      "homepage": "",
      "twitter": "@PaulienVanAlst"
    },
    {
      "enabled": "1",
      "name": "Brian Vermeer",
      "description": "Developer Advocate at Snyk",
      "biography": "Developer Advocate for Snyk and Software Engineer with over 10 years of hands-on experience in creating and maintaining software. He is passionate about Java, (Pure) Functional Programming and Cybersecurity. Brian is an Oracle Groundbreaker Ambassador and regular international speaker on mostly Java related conferences like JavaOne, Oracle Code One, Devoxx BE, Devoxx UK, Jfokus, JavaZone and many more. Besides all that Brian is a military reserve for the Royal Netherlands Air Force and a Taekwondo Master / Teacher.",
      "image": "assets/img/speakers/brian-vermeer.jpg",
      "ref": "4933804ca1248303098eaa459ba614f4bbbbada1",
      "url": "infoSpeaker.html?ref=4933804ca1248303098eaa459ba614f4bbbbada1",
      "homepage": "http://www.brianvermeer.nl",
      "twitter": "@BrianVerm"
    },
    {
      "enabled": "1",
      "name": "Matt Raible",
      "description": "Java Champion, and Developer Advocate at Okta",
      "biography": "Matt Raible is a well-known figure in the Java community and has been building web applications for most of his adult life. For over 20 years, he has helped developers learn and adopt open source frameworks and use them effectively. He’s a web developer, Java Champion, and Developer Advocate at Okta. Matt has been a speaker at many conferences worldwide, including Devoxx Belgium, Devoxx France, Jfokus, and JavaOne. He is the author of The JHipster Mini-Book, Spring Live, and contributed to Pro JSP. He is a frequent contributor to open source and a member of the JHipster development team. You can find him online at https://raibledesigns.com and @mraible on Twitter.",
      "image": "assets/img/speakers/matt-raible.jpg",
      "ref": "3b8f95a333469c079f0264b8b903184fe5082c05",
      "url": "infoSpeaker.html?ref=3b8f95a333469c079f0264b8b903184fe5082c05",
      "homepage": "http://raibledesigns.com",
      "twitter": "@mraible"
    },{
      "enabled": "1",
      "name": "Mario V Gray",
      "description": "Principal Technologist at Pivotal. Co-author of Apress's Pro Spring Integration",
      "biography": "Mario Gray is a Principal Technologist at Pivotal with over 20 years of experience in software development and software architecture. He is co-author of Apress's Pro Spring Integration. He’s helped organizations large and small build service-based architectures in a number of different runtimes and platforms over the decades, but adopting Spring in 2004, and using it whenever possible since, was a no-brainer that culminated in joining the Spring team in 2017. As a Spring Developer Advocate, Mario loves to engage and inspire developers and businesses in the Pivotal ecosystem",
      "image": "assets/img/speakers/mario_v_gray.jpeg",
      "ref": "2e93061543cde6bde464afd77e37198f67675a4f",
      "url": "infoSpeaker.html?ref=2e93061543cde6bde464afd77e37198f67675a4f",
      "homepage": "http://www.sudoinit5.com",
      "twitter": "@mariogray"
  },
  {
      "enabled": "1",
      "name": "Michel Schudel",
      "description": "Java developer Dutch Railways",
      "biography": "Michel Schudel has been a passionate Java developer since 1998, building various Java solutions for banks, insurance companies and telecom providers. Since then he has seen the good, the bad and the ugly in Java land. He loves agile development and coding with frameworks like SpringBoot to get up-and-running as fast as possible. Futhermore, he likes to coach junior developers in Core Java. Michel is currently working for Dutch Railways in the Netherlands.",
      "image": "assets/img/speakers/michel-schudel.jpg",
      "ref": "40afe10a3ea9ec161d15ade201a0101fa8f635f4",
      "url": "infoSpeaker.html?ref=40afe10a3ea9ec161d15ade201a0101fa8f635f4",
      "homepage": "http://coding.michelschudel.nl",
      "twitter": "@MichelSchudel"
  },
  {
    "enabled": "1",
    "name": "Belinda Waldock",
    "description": "Business Coach, Trainer, Speaker and Author",
    "biography": "Belinda is a business coach, trainer, speaker and author. She supports organisations and teams to adopt an agile way of working to enhance their wellbeing, productivity and growth.\n\nBelinda’s book, Being Agile in Business is a popular non-technical introduction to agile thinking, approaches and culture.\n\nHer business, ‘being agile’ works with teams across a variety of areas to adopt agile thinking and practices, helping them to grow and sustain an agile culture in their organisations.",
    "image": "assets/img/speakers/belinda-waldock.jpg",
    "ref": "8ba341ede35371519196bc6a3c2cd11e4789c34a",
    "url": "infoSpeaker.html?ref=8ba341ede35371519196bc6a3c2cd11e4789c34a",
    "homepage": "http://www.beingagile.co.uk",
    "twitter": "@belindawaldock",
    "linkedin": "http://uk.linkedin.com/in/belindawaldock"
  },
  {
    "enabled": "1",
    "name": "David Delabassee",
    "description": "Developer Advocate - FnProject & Severless Team at Oracle",
    "biography": "David works in the Serverless Developer Relations Team at Oracle where he is spending most of his time on the open source Fn Project. Prior to that, he was involved in Java EE 8 and its transition to the Eclipse Foundation as part of the Jakarta EE initiative. Over the years, David has championed Java extensively throughout the world, by presenting at conferences and user groups, large and small.He blogs at https://delabassee.com and has authored many technical articles for various publications.\n\nDavid lives in Belgium. In his spare time, he enjoys playing video games with his daughter and tinkeringwith technologies such as domotics, electronics, and pinballs.\n\nYou can follow David on Twitter: @delabassee.",
    "image": "assets/img/speakers/david-delabassee.jpg",
    "ref": "a744f52d967ebb543100a1215f9fe38080a664f0",
    "url": "infoSpeaker.html?ref=a744f52d967ebb543100a1215f9fe38080a664f0",
    "homepage": "https://delabassee.com",
    "twitter": "@delabassee",
    "linkedin": "https://www.linkedin.com/in/daviddelabassee"
  },
  {
    "enabled": "1",
    "name": "Julien Viet",
    "description": "Vert.x project lead, Red Hat Principal Software Engineer",
    "biography": "Julien Viet is the Vert.x project lead and works at Red Hat. Julien has been developing open source software since 2002. Julien holds an engineering degree from Institut National des Télécommunications.",
    "image": "assets/img/speakers/julien-viet.jpg",
    "ref": "0ad9d5343d1ee682de4fd65c3df75aac55029fac",
    "url": "infoSpeaker.html?ref=0ad9d5343d1ee682de4fd65c3df75aac55029fac",
    "homepage": "http://www.julienviet.com",
    "twitter": "@julienviet",
    "linkedin": "https://fr.linkedin.com/in/julienviet"
  },
  {
    "enabled": "1",
    "name": "Kai Waehner",
    "description": "Technology Evangelist for Confluent",
    "biography": "Kai Waehner works as Technology Evangelist at Confluent. Kai’s main area of expertise lies within the fields of Big Data Analytics, Machine Learning / Deep Learning, Cloud / Hybrid Architectures, Messaging, Integration, Microservices, Stream Processing, Internet of Things and Blockchain. He is regular speaker at international conferences such as JavaOne, O’Reilly Software Architecture or ApacheCon, writes articles for professional journals, and shares his experiences with new technologies on his blog (www.kai-waehner.de/blog). Contact and references: kontakt@kai-waehner.de / @KaiWaehner / www.kai-waehner.de",
    "image": "assets/img/speakers/kai-waehner.jpg",
    "ref": "4933ebef38f82b62da601eb07e8362bb389cc560",
    "url": "infoSpeaker.html?ref=4933ebef38f82b62da601eb07e8362bb389cc560",
    "homepage": "http://www.kai-waehner.de",
    "twitter": "@KaiWaehner"
  },{
    "enabled": "1",
    "name": "Valeriane Venance",
    "description": "Developer Advocate @clever_cloud and freelance web developer",
    "biography": "Developer Advocate @clever_cloud, Freelance web developer, backpack travelling and electronic music addict",
    "image": "assets/img/speakers/valeriane-venance.jpg",
    "ref": "1d54c30358e79434b07f96ddcb7dc19325134eeb",
    "url": "infoSpeaker.html?ref=1d54c30358e79434b07f96ddcb7dc19325134eeb",
    "homepage": "",
    "twitter": "@valeriane_IT",
    "linkedin": "https://www.linkedin.com/in/valeriane-v-03a4b7139/"
  },
  {
    "enabled": "1",
    "name": "Mala Gupta",
    "description": "Developer Advocate JetBrains, Java Champion, director WomenWhoCode, Leader DelhiJUG",
    "biography": "Mala Gupta is Developer Advocate at JetBrains. She is also founder and lead mentor at eJavaGuru.com, Java Champion at Oracle, book author with Manning and Packt Publications. An international speaker at industry conferences, she has an experience of 18 years in software industry.\n\nShe has been actively supporting Java certification as a path to career advancement. Since 2006, she has been coaching students and professionals to succeed on these certifications. A sought after speaker and coach, Mala Gupta's Java books with Manning Publications, USA, are top-rated for Java Certification around the globe.\n\nShe co-leads Delhi Java User Group . A strong supporter of Women in Technology, she drives initiatives of Women Who Code - Delhi chapter to augment participation of women in tech. Mala has also co-founded KaagZevar.com - a platform for nurturing creativity as an essential life skill.",
    "image": "assets/img/speakers/mala-gupta.png",
    "ref": "388f6f9ee4eb169ce6d936f7ce3952f6aadd211f",
    "url": "infoSpeaker.html?ref=388f6f9ee4eb169ce6d936f7ce3952f6aadd211f",
    "homepage": "",
    "twitter": "@eMalaGupta",
    "linkedin": "https://www.linkedin.com/in/malagupta/"
<<<<<<< HEAD
  },
  {
    "enabled": "1",
    "name": "Graeme Rocher",
    "description": "co-founder of the Grails and Micronaut frameworks",
    "biography": "Graeme Rocher, co-founder of the Grails and Micronaut frameworks and co-author of The Definitive Guide to Grails, serves as Technical Lead for the OCI Grails & Micronaut team. Graeme has worked in the software development field for more than 20 years and has expertise in Grails, Groovy, Web Development, Dynamic Languages, and the JVM.",
    "image": "assets/img/speakers/graeme.rocher.jpg",
    "ref": "6c31223d3be1de9ea66a96974ec4f524cd6a786f",
    "url": "infoSpeaker.html?ref=6c31223d3be1de9ea66a96974ec4f524cd6a786f",
    "homepage": "http://micronaut.io",
    "twitter": "@graemerocher"
  },
  {
    "enabled": "1",
    "name": "Rebecca Simmonds",
    "description": "Senior Software Engineer at Red Hat",
    "biography": "Rebecca Simmonds is a senior software engineer at Red Hat. Here she is part of an emerging technology group, which comprises of both data scientists and developers. She completed a PhD at Newcastle University, in which she developed a platform for scalable, geospatial and temporal analysis of the Twitter data. After this she moved to a small startup company as a Java developer creating solutions to improve performance for a CV analyser. She has a keen interest in architecture design and data analysis, which she is furthering at Red Hat with Openshift and ML research.\n",
    "image": "assets/img/speakers/rebecca-simmonds.jpg",
    "ref": "d89cefec93be3aba5a4a16347d38216b67606322",
    "url": "infoSpeaker.html?ref=d89cefec93be3aba5a4a16347d38216b67606322",
    "twitter": "@becky_simmonds"
=======
>>>>>>> gh-pages
  }
  ]
}