{
  "items": [
    {
      "name": "Venkat Subramaniam",
      "description": "Java Champion, Founder of Agile Developer, Inc.",
      "biography": "Dr. Venkat Subramaniam is an award-winning author, founder of Agile Developer, Inc., creator of agilelearner.com, and an instructional professor at the University of Houston. He has trained and mentored thousands of software developers in the US, Canada, Europe, and Asia, and is a regularly-invited speaker at several international conferences. Venkat helps his clients effectively apply and succeed with sustainable agile practices on their software projects. Venkat is a (co)author of multiple technical books, including the 2007 Jolt Productivity award winning book Practices of an Agile Developer. You can find a list of his books at agiledeveloper.com. You can reach him by email at venkats@agiledeveloper.com or on twitter at @venkat_s.",
      "enabled": "1",
      "homepage": "http://agiledeveloper.com",
      "image": "assets/img/speakers/venkat-subramaniam.jpg",
      "ref": "VmVua2F0U3VicmFtYW5pYW12ZW5rYXRzQGFnaWxlZGV2ZWxvcGVyLmNvbQ",
      "url": "infoSpeaker.html?ref=VmVua2F0U3VicmFtYW5pYW12ZW5rYXRzQGFnaWxlZGV2ZWxvcGVyLmNvbQ",
      "twitter": "@venkat_s"
    },
    {
      "enabled": "1",
      "name": "Victor Rentea",
      "description": "Independent Trainer & Coach, Lead Architect at IBM Romania",
      "biography": "Victor Rentea is Java Champion and one of the top Independent Trainers in Romania, having trained by now 1500+ developers in 30+ companies. He is Lead Architect at IBM, where he practices Pair Programming, Clean Code and Refactoring every day. For the community, he organized the largest 3 Bucharest Java User Group meetups in history, and founded the Bucharest Software Craftsmanship Community. As a speaker, Victor is now regularly invited at the top international conferences: his live-coding sessions are insane, lightning-fast but well crafted, full of enthusiasm, deep insights and take-away tips. To learn more about/from him, follow his daily thoughts on LinkedIN, Facebook or Twitter, or check out http://victorrentea.ro.",
      "image": "assets/img/speakers/victor-rentea.jpg",
      "ref": "d27efdbbf9293c1d2cbcb35559c2558a0707a484",
      "url": "infoSpeaker.html?ref=d27efdbbf9293c1d2cbcb35559c2558a0707a484",
      "homepage": "http://victorrentea.ro",
      "twitter": "@victorrentea"
    },
    {
      "biography": "Trisha has developed Java applications for a range of industries, including finance, manufacturing, software and non-profit, for companies of all sizes. She has expertise in Java high performance systems, is passionate about enabling developer productivity, and dabbles with Open Source development. Trisha is a leader of the Sevilla Java User Group, a MongoDB Master and a Java Champion. She believes we shouldn't all have to make the same mistakes again and again. She’s a Developer Advocate for JetBrains so she can share all the cool stuff she's discovered so far. Blog: http://www.trishagee.com",
      "description": " Java Champion, Developer Advocate for JetBrains",
      "enabled": "1",
      "homepage": "http://www.trishagee.com",
      "image": "assets/img/speakers/trisha-gee.jpeg",
      "name": "Trisha Gee",
      "ref": "5778ef29f1bfba305f2684b45f585d6655728e10",
      "twitter": "@trisha_gee",
      "url": "infoSpeaker.html?ref=5778ef29f1bfba305f2684b45f585d6655728e10"
    },
    {
      "enabled": "1",
      "name": "Andres Almiray",
      "description": "Java/Groovy developer",
      "biography": "Andres is a Java/Groovy developer and a Java Champion with more than 20 years of experience in software design and development. He has been involved in web and desktop application development since the early days of Java. Andres is a true believer in open source and has participated on popular projects like Groovy, Griffon, and DbUnit, as well as starting his own projects (Json-lib, EZMorph, GraphicsBuilder, JideBuilder). Founding member of the Griffon framework and Hackergarten community event. You can find him on twitter too as @aalmiray. He likes to spend time with his beloved wife, Ixchel, when not hacking around.",
      "image": "assets/img/speakers/andres-almiray.jpg",
      "ref": "aalmiray",
      "url": "infoSpeaker.html?ref=aalmiray",
      "twitter": "https://twitter.com/aalmiray",
      "homepage": "http://andresalmiray.com",
      "scheduleId": ""
    },
    {
      "enabled": "1",
      "name": "Alex Soto",
      "description": "Java Champion, Red Hatter, teacher and writer",
      "biography": "Alex is a Director of Developer Experience at Red Hat. He is passionate about Java world, software automation and he believes in the open source software model. Alex is the creator of NoSQLUnit project, member of JSR374 (Java API for JSON Processing) Expert Group, the co-author of Testing Java Microservices book for Manning and contributor of several open source projects. A Java Champion since 2017, international speaker and teacher at Salle URL University, he has talked about new testing techniques for microservices and continuous delivery in the 21st century.",
      "image": "assets/img/speakers/alex-soto.jpg",
      "ref": "1cf43210c8515585e52e4d2f6f2e5e0f582049d8",
      "url": "infoSpeaker.html?ref=1cf43210c8515585e52e4d2f6f2e5e0f582049d8",
      "homepage": "",
      "twitter": "@alexsotob",
      "linkedin": ""
    }
  ]
}
