{
  "items": [
    {
      "name": "Venkat Subramaniam",
      "description": "Java Champion, Founder of Agile Developer, Inc.",
      "biography": "Dr. Venkat Subramaniam is an award-winning author, founder of Agile Developer, Inc., creator of agilelearner.com, and an instructional professor at the University of Houston. He has trained and mentored thousands of software developers in the US, Canada, Europe, and Asia, and is a regularly-invited speaker at several international conferences. Venkat helps his clients effectively apply and succeed with sustainable agile practices on their software projects. Venkat is a (co)author of multiple technical books, including the 2007 Jolt Productivity award winning book Practices of an Agile Developer. You can find a list of his books at agiledeveloper.com. You can reach him by email at venkats@agiledeveloper.com or on twitter at @venkat_s.",
      "enabled": "1",
      "homepage": "http://agiledeveloper.com",
      "image": "assets/img/speakers/venkat-subramaniam.jpg",
      "ref": "VmVua2F0U3VicmFtYW5pYW12ZW5rYXRzQGFnaWxlZGV2ZWxvcGVyLmNvbQ",
      "url": "infoSpeaker.html?ref=VmVua2F0U3VicmFtYW5pYW12ZW5rYXRzQGFnaWxlZGV2ZWxvcGVyLmNvbQ",
      "twitter": "@venkat_s"
    },
    {
      "biography": "Trisha has developed Java applications for a range of industries, including finance, manufacturing, software and non-profit, for companies of all sizes. She has expertise in Java high performance systems, is passionate about enabling developer productivity, and dabbles with Open Source development. Trisha is a leader of the Sevilla Java User Group, a MongoDB Master and a Java Champion. She believes we shouldn't all have to make the same mistakes again and again. She’s a Developer Advocate for JetBrains so she can share all the cool stuff she's discovered so far. Blog: http://www.trishagee.com",
      "description": "Java Champion, Developer Advocate for JetBrains",
      "enabled": "1",
      "homepage": "http://www.trishagee.com",
      "image": "assets/img/speakers/trisha-gee.jpeg",
      "name": "Trisha Gee",
      "ref": "5778ef29f1bfba305f2684b45f585d6655728e10",
      "twitter": "@trisha_gee",
      "url": "infoSpeaker.html?ref=5778ef29f1bfba305f2684b45f585d6655728e10"
    },
    {
      "enabled": "1",
      "name": "Andres Almiray",
      "description": "Groovy aficionado, Griffon project lead, Java Champion, Hackergarten lead",
      "biography": "Andres is a Java/Groovy developer and a Java Champion with more than 20 years of experience in software design and development. He has been involved in web and desktop application development since the early days of Java. Andres is a true believer in open source and has participated on popular projects like Groovy, Griffon, and DbUnit, as well as starting his own projects (Json-lib, EZMorph, GraphicsBuilder, JideBuilder). Founding member of the Griffon framework and Hackergarten community event. You can find him on twitter too as @aalmiray. He likes to spend time with his beloved wife, Ixchel, when not hacking around.",
      "image": "assets/img/speakers/andres-almiray.jpg",
      "ref": "aalmiray",
      "url": "infoSpeaker.html?ref=aalmiray",
      "twitter": "https://twitter.com/aalmiray",
      "homepage": "http://andresalmiray.com",
      "scheduleId": ""
    },
    {
      "enabled": "1",
      "name": "Ixchel Ruiz",
      "company": "Karakun AG",
      "description": "Java Champion, Open Source advocate, Groundbreaker Ambassador, Public speaker and mentor",
      "biography": "Ixchel Ruiz has developed software application & tools since 2000. Her research interests include Java, dynamic languages, client-side technologies and testing. Java Champion, Oracle Developer Champion, hackergarten enthusiast, Open Source advocate, public speaker and mentor.\n",
      "image": "assets/img/speakers/ixchel-ruiz.jpeg",
      "ref": "41ceb1cd66f7ae889863eaae4906e011474440cc",
      "url": "infoSpeaker.html?ref=41ceb1cd66f7ae889863eaae4906e011474440cc",
      "homepage": "https://ixchelruiz.com",
      "twitter": "@ixchelruiz",
      "linkedin": "https://www.linkedin.com/in/ixchelruiz/"
    },
    {
      "enabled": "1",
      "name": "Michel Schudel",
      "company": "Rabobank",
      "description": "Developer at Craftsmen BV, DevOps engineer",
      "biography": "Michel Schudel has been a passionate Java developer since 1998, building various Java solutions for banks, insurance companies and telecom providers. Since then he has seen the good, the bad and the ugly in Java land. He loves agile development and coding with frameworks like SpringBoot to get up-and-running as fast as possible. Futhermore, he likes to coach junior developers in Core Java. Michel is currently working for Rabobank in the Netherlands.",
      "image": "assets/img/speakers/michel-schudel.png",
      "ref": "40afe10a3ea9ec161d15ade201a0101fa8f635f4",
      "url": "infoSpeaker.html?ref=40afe10a3ea9ec161d15ade201a0101fa8f635f4",
      "homepage": "https://craftsmen.nl",
      "twitter": "@MichelSchudel",
      "linkedin": "https://www.linkedin.com/in/michelschudel"
    },
    {
      "enabled": "1",
      "name": "Wlodek Krakowski",
      "company": "Refactoring PL",
      "description": "Refactoring & Clean Code Trainer and Speaker",
      "biography": "Włodek Krakowski works as independent technical trainer. Also a developer if the time allows. His main interest is taking care of delivering valued software from different perspectives. \n\nThese are how people take care of quality of code, how people work together towards providing business value, how people help to grow each other and how people are managed and how development processes are set up. \n\nCurrently he delivers technical / refactoring trainings at www.refactoring.pl.",
      "image": "assets/img/speakers/wlodek.jpg",
      "ref": "34e64a4d88094a0c4231d49cc0305d61d7b854ee",
      "url": "infoSpeaker.html?ref=34e64a4d88094a0c4231d49cc0305d61d7b854ee",
      "homepage": "https://www.refactoring.pl",
      "twitter": "@wlodekkr",
      "linkedin": "https://www.linkedin.com/in/wlodek-krakowski/"
    },
    {
      "enabled": "1",
      "name": "Anton Rodriguez Yuste",
      "company": "Inditex",
      "description": "Senior Software Engineer at Inditex. CorunaJUG & VigoJUG organizer",
      "biography": "I'm a Software Engineer who codes in Java/Scala/Groovy, with experience working in different Cloud providers (AWS, Azure) using Docker and Kubernetes. Nowadays I'm focused on Data Pipelines (Spark) and Event Streaming (Kafka). Nowadays I work for Inditex Group (Zara, Massimo Dutti, etc.) as Data Engineer. In the past, I worked as a specialist in Deployment Pipelines, API Management and Advanced Orchestration in distributed systems.\n\nI co-organize the Vigo and Coruña Java User Groups (VigoJUG & CoruñaJUG) and sometimes I speak at international conferences as Geecon, SpringIO, JBCNConf, GReach, CommitConf, etc.\n",
      "image": "assets/img/speakers/anton-yuste.jpg",
      "ref": "be0cbd800e1696be1dce1a24e522d7f595698495",
      "url": "infoSpeaker.html?ref=be0cbd800e1696be1dce1a24e522d7f595698495",
      "homepage": "http://www.galiglobal.com/",
      "twitter": "@antonmry",
      "linkedin": "https://www.linkedin.com/in/antonmry/"
    },
    {
      "enabled": "1",
      "name": "Victor Rentea",
      "company": "IBM",
      "description": "Java Champion, Software Craftsman, Trainer, Speaker, Lead Architect at IBM, Founder of BucharestSCC",
      "biography": "Victor Rentea is Java Champion and one of the top Independent Trainers in Romania, having trained by now 1500+ developers in 30+ companies. He is Lead Architect at IBM, where he practices Pair Programming, Clean Code and Refactoring every day. For the community, he organized the largest 3 Bucharest Java User Group meetups in history and founded the Bucharest Software Craftsmanship Community.\n\nAs a speaker, Victor is now regularly invited at the top international conferences: his live-coding sessions are insane, lightning-fast but well crafted, full of enthusiasm, deep insights and take-away tips. To learn more about/from him, follow his daily thoughts on LinkedIn, Facebook or Twitter, or check out http://victorrentea.ro.",
      "image": "assets/img/speakers/victor-rentea.jpg",
      "ref": "d27efdbbf9293c1d2cbcb35559c2558a0707a484",
      "url": "infoSpeaker.html?ref=d27efdbbf9293c1d2cbcb35559c2558a0707a484",
      "homepage": "https://victorrentea.ro",
      "twitter": "@victorrentea",
      "linkedin": "https://www.linkedin.com/in/victor-rentea-trainer/"
    },
    {
      "enabled": "1",
      "name": "Gunnar Morling",
      "company": "Red Hat",
      "description": "Lead of Debezium, Spec lead of Bean Validation 2.0, Java Champion",
      "biography": "Gunnar Morling is a software engineer and open-source enthusiast by heart. He is leading the Debezium project, a tool for change data capture (CDC). He is a Java Champion, the spec lead for Bean Validation 2.0 (JSR 380) and has founded multiple open source projects such as Deptective and MapStruct. Prior to joining Red Hat, Gunnar worked on a wide range of Java EE projects in the logistics and retail industries. He's based in Hamburg, Germany.",
      "image": "assets/img/speakers/gunnar-morling.jpeg",
      "ref": "8c386f2e1f0875844aab547ee40fa1772173d59e",
      "url": "infoSpeaker.html?ref=8c386f2e1f0875844aab547ee40fa1772173d59e",
      "homepage": "https://in.relation.to/gunnar-morling/",
      "twitter": "@gunnarmorling",
      "linkedin": ""
    },
    {
      "enabled": "1",
      "name": "Brian Vermeer",
      "company": "Snyk",
      "description": "Developer Advocate, FP and Cybersecurity passionate, Oracle Groundbreaker, Utrecht JUG & MyDevSecOps co-lead",
      "biography": "Developer Advocate for Snyk and Software Engineer with over 10 years of hands-on experience in creating and maintaining software. He is passionate about Java, (Pure) Functional Programming and Cybersecurity. Brian is an Oracle Groundbreaker Ambassador, Utrecht JUG Co-lead, Virtual JUG organizer and Co-lead at MyDevSecOps. He is a regular international speaker on mostly Java-related conferences like JavaOne, Oracle Code One, Devoxx BE, Devoxx UK, Jfokus, JavaZone and many more. Besides all that Brian is a military reserve for the Royal Netherlands Air Force and a Taekwondo Master / Teacher.",
      "image": "assets/img/speakers/brian-vermeer.png",
      "ref": "a4529dc3081fc5242a51aecadc114b5ff5aa1520",
      "url": "infoSpeaker.html?ref=a4529dc3081fc5242a51aecadc114b5ff5aa1520",
      "homepage": "",
      "twitter": "@BrianVerm",
      "linkedin": "https://linkedin.com/in/brianvermeer"
    },
    {
      "enabled": "1",
      "name": "Vaughn Vernon",
      "company": "kalele",
      "description": "Consultant and Trainer at Kalele, author of Domain-Driven Design Distilled, vlingo/platform Founder",
      "biography": "Vaughn Vernon is a software developer and architect with more than 35 years of experience in a broad range of business domains. Vaughn is a leading expert in Domain-Driven Design, champion of simplicity and reactive systems, and the founder of the open source, DDD-friendly, reactive, vlingo/PLATFORM. He consults and teaches around Domain-Driven Design and reactive software development, helping teams and organizations realize the potential of business driven and reactive systems as they transition from technology driven legacy web implementation approaches. As he does so, he puts strong emphasis on embracing simplicity whenever possible. Vaughn is the author of three books: Implementing Domain-Driven Design, Reactive Messaging Patterns with the Actor Model, and Domain-Driven Design Distilled, all published by Addison-Wesley.",
      "image": "assets/img/speakers/vaughn-vernon.jpg",
      "ref": "c9f19a5a2dbbfed36664ef31c4ee86c0dfbbe388",
      "url": "infoSpeaker.html?ref=c9f19a5a2dbbfed36664ef31c4ee86c0dfbbe388",
      "homepage": "https://kalele.io/",
      "twitter": "https://twitter.com/VaughnVernon",
      "linkedin": "https://www.linkedin.com/in/vaughnvernon/"
    },
    {
      "enabled": "1",
      "name": "Ben Evans",
      "company": "New Relic",
      "description": "Technologist, Java Champion, Java/JVM track lead at InfoQ, Bestselling tech author, Speaker",
      "biography": "Ben Evans is a Principal Engineer and Architect for JVM technologies at New Relic. Prior to joining New Relic, Ben co-founded jClarity (acquired by Microsoft) and was Chief Architect (Listed Derivatives) at Deutsche Bank. Ben is the author of 5 books - \"The Well-Grounded Java Developer\", \"Java: The Legend\", \"Optimizing Java\" and the recent editions of \"Java in a Nutshell\". He is the track lead for Java / JVM at infoq.com, writes regularly for industry publications and is a frequent speaker at technical conferences worldwide. Ben has been active in Free and Open Source Software for over 20 years, co-founded the AdoptOpenJDK initiative (with Martijn Verburg), and served on the JCP Executive Committee for 6 years.",
      "image": "assets/img/speakers/ben-evans.jpg",
      "ref": "43465d1832e6ad88035b44bfc924e958aca86aa9",
      "url": "infoSpeaker.html?ref=43465d1832e6ad88035b44bfc924e958aca86aa9",
      "homepage": "",
      "twitter": "",
      "linkedin": ""
    },
    {
      "enabled": "1",
      "name": "Alex Soto",
      "company": "RedHat",
      "description": "Java Champion, Speaker, Teacher, CoAuthor of Testing Java Microservices",
      "biography": "Alex is a Director of Developer Experience at Red Hat. He is passionate about Java world, software automation and he believes in the open source software model.\n\nAlex is the creator of NoSQLUnit project, member of JSR374 (Java API for JSON Processing) Expert Group, the co-author of Testing Java Microservices book for Manning and contributor of several open source projects. A Java Champion since 2017, international speaker and teacher at Salle URL University, he has talked about new testing techniques for microservices and continuous delivery in the 21st century.",
      "image": "assets/img/speakers/alex-soto.jpg",
      "ref": "1cf43210c8515585e52e4d2f6f2e5e0f582049d8",
      "url": "infoSpeaker.html?ref=1cf43210c8515585e52e4d2f6f2e5e0f582049d8",
      "homepage": "http://www.lordofthejars.com/",
      "twitter": "@alexsotob",
      "linkedin": "https://www.linkedin.com/in/asotobu/"
    },
    {
      "enabled": "1",
      "name": "Grace Jansen",
      "company": "IBM",
      "description": "Developer Advocate at IBM, Biologist converted to Tech, TechWomen100 winner",
      "biography": "Grace is a developer advocate at IBM, working with Open Liberty and Reactive Platform. She has now been with IBM for two years, after graduating from Exeter University with a Degree in Biology. Moving to software engineering has been a challenging step for Grace, but she enjoys bringing a varied perspective to her projects and using her knowledge of biological systems to simplify complex software patterns and architectures. As a developer advocate, Grace builds POC’s, demos and sample applications, and writes guides and tutorials to help guide users through technologies and products. She is a regular presenter at international technology conferences and has recently authored a book on reactive systems. Grace also has a keen passion for encouraging more women into STEM and especially Technology careers.",
      "image": "assets/img/speakers/grace-jensen.jpg",
      "ref": "b21e540e924111f0e9d271ed82350fa020b9972e",
      "url": "infoSpeaker.html?ref=b21e540e924111f0e9d271ed82350fa020b9972e",
      "homepage": "",
      "twitter": "@gracejansen27",
      "linkedin": "https://www.linkedin.com/in/grace-jansen/"
    },
    {
      "enabled": "1",
      "name": "Emily Jiang",
      "company": "IBM",
      "description": "Java Champion, MicroProfile guru, passionate about Java +Jakarta EE",
      "biography": "Emily Jiang is a Java Champion. She is Liberty Microservices Architect and Advocate, STSM in IBM, based at Hursley Lab in the UK. Emily is a senior MicroProfile lead and has been working on MicroProfile since 2016 and leads the specifications of MicroProfile Config, Fault Tolerance and Service Mesh. She is CDI Expert Group member.\n\nShe has worked on the WebSphere Application Server since 2006 and is heavily involved in Java EE and MicroProfile implementation in Liberty releases.\n\nShe regularly speaks at conferences, such as Code One, DevNexus, JAX London, Voxxed, Devoxx US, Devoxx Belgium, Devoxx UK, Devoxx France, EclipseCon, etc. Follow her on Twitter @emilyfhjiang and/or connect with her on LinkedIn (https://www.linkedin.com/in/emily-jiang-60803812/).",
      "image": "assets/img/speakers/emily-jiang.png",
      "ref": "287733a35b40f9c6050e1cfda90e39e611323e91",
      "url": "infoSpeaker.html?ref=287733a35b40f9c6050e1cfda90e39e611323e91",
      "homepage": "",
      "twitter": "@emilyfhjiang",
      "linkedin": "https://www.linkedin.com/in/emily-jiang-60803812/"
    },
    {
      "enabled": "1",
      "name": "Alberto Salazar",
      "company": "Advance Latam",
      "description": "Java Champion, Oracle Groundbreaker, JUG Leader, Auth0Ambassador, JCP, @advancelatam, @ecuadorjug",
      "biography": "Alberto Salazar is an entrepreneur, passionate Consultant, Java Champion, Oracle Groundbreaker Ambassador, JUG Leader, Auth0 Ambassador, founder of the Ecuador Java User Group, Java Community Process Associate Member and Java evangelist/trainer; active in twitter at @betoSalazar. He is the co-author of the book 'Software Architecture with Spring 5.0'. Alberto has been working for 2 decades creating large scalable and high transaction load systems from military software to banking solutions. He is also a frequent speaker at Java conferences such as Oracle Code One, JBCNConf, Voxxed Days, Oracle Code, Red Hat Summit, JavaOne, Oracle Developer Tour Latam, OTN Tours, and local JUG meetings.\n",
      "image": "assets/img/speakers/alberto-salazar.jpg",
      "ref": "4f72f63b37fb9bb3781b7e7b1e3246b1364c02a2",
      "url": "infoSpeaker.html?ref=4f72f63b37fb9bb3781b7e7b1e3246b1364c02a2",
      "homepage": "https://lasalazarr.github.io/blog/",
      "twitter": "@betoSalazar",
      "linkedin": "https://www.linkedin.com/in/alberto-salazar-15334154/"
    },
    {
      "enabled": "1",
      "name": "Grzegorz Piwowarek",
      "company": "Hazelcast",
      "description": "Senior Software Engineera at Hazelcast, JDD_Krakow committee member",
      "biography": "Grzegorz Piwowarek is a senior software engineer at Hazelcast, trainer, blogger at 4comprehension.com, and OSS contributor.\n\nThere are rumors that he exists only at compile-time.",
      "image": "assets/img/speakers/grzegorz-piwowarek.jpg",
      "ref": "dcf4d5f83bc2dab51fb90922055352668da14a18",
      "url": "infoSpeaker.html?ref=dcf4d5f83bc2dab51fb90922055352668da14a18",
      "homepage": "http://4comprehension.com/",
      "twitter": "@pivovarit",
      "linkedin": "https://www.linkedin.com/in/gpiwowarek/"
    },
    {
      "enabled": "1",
      "name": "Kai Waehner",
      "company": "Confluent",
      "description": "Technology Evangelist with focus on Event Processing, Big Data, Machine Learning and Blockchain",
      "biography": "Kai Waehner works as Technology Evangelist at Confluent. Kai’s main area of expertise lies within the fields of Big Data Analytics, Machine Learning / Deep Learning, Cloud / Hybrid Architectures, Messaging, Integration, Microservices, Stream Processing, Internet of Things and Blockchain. He is regular speaker at international conferences such as Kafka Summit, O’Reilly Software Architecture or ApacheCon, writes articles for professional journals, and shares his experiences with new technologies on his blog (www.kai-waehner.de/blog). Contact and references: contact@kai-waehner.de / @KaiWaehner / www.kai-waehner.de / LinkedIn (https://www.linkedin.com/in/megachucky/).",
      "image": "assets/img/speakers/kai-waehner.jpg",
      "ref": "4933ebef38f82b62da601eb07e8362bb389cc560",
      "url": "infoSpeaker.html?ref=4933ebef38f82b62da601eb07e8362bb389cc560",
      "homepage": "https://www.kai-waehner.de ",
      "twitter": "@KaiWaehner",
      "linkedin": "https://www.linkedin.com/in/megachucky/ "
    },
    {
      "enabled": "1",
      "name": "Uberto Barbini",
      "company": "Indipendent consultant",
      "description": "Passionate Polyglot Programmer Technical leader, Hands-on Architect",
      "biography": "Uberto is a polyglot programmer and hands-on software architect with more than 20 years of experience designing and building successful software products in many industries.\n\nHe is very passionate and opinionated about how to deliver value to the business not only once but at a regular pace.\n\nHe is particularly interested in Functional Programming and Distributed Computing since they are both critical to modern software challenges.\n\nWhen not coding, Uberto loves public speaking, writing and teaching programming. He's currently writing a book about Pragmatic Functional Kotlin.\n\nYou can read his blog here: https://medium.com/@ramtop\n\n\n",
      "image": "assets/img/speakers/uberto-barbini.jpg",
      "ref": "30ad77f3c637602914465cad22c7445a992104cd",
      "url": "infoSpeaker.html?ref=30ad77f3c637602914465cad22c7445a992104cd",
      "homepage": "https://medium.com/@ramtop",
      "twitter": "@ramtop",
      "linkedin": "https://www.linkedin.com/in/uberto/"
    },
    {
      "enabled": "1",
      "name": "Mercedes Wyss",
      "company": "Produactivity",
      "description": "CTO at Produactivity, Oracle Groundbreaker, Auth0 Ambassador, JDuchessGT & 502Devs Lead",
      "biography": "Mercedes Wyss is a software engineer with more than eight years of experience in the backend, frontend and Android development using Python, Java and Kotlin. Currently, she is a CTO at Produactivity, a startup based in Guatemala. \n\nShe was previously organizing meetings in Guatemala Java Users Group from 2012 to 2016. Since 2016 she is focusing on increasing women’s participation in STEAM by running a JDuchess Chapter in Guatemala and is the leader of a Google community (Devs+502). \n\nShe is an Oracle Groundbreaker Ambassador and an Auth0 Ambassador, she also has a Duke’s Choice Award in Educational Outreach.",
      "image": "assets/img/speakers/mercedes-wyss.jpg",
      "ref": "636abf491a53384c8f8187db2bb85e81e29e0982",
      "url": "infoSpeaker.html?ref=636abf491a53384c8f8187db2bb85e81e29e0982",
      "homepage": "https://aknowledgejourney.com/",
      "twitter": "@itrjwyss",
      "linkedin": "https://www.linkedin.com/in/itrjwyss/"
    },
    {
      "enabled": "1",
      "name": "Ana Maria Mihalceanu",
      "company": "IBM",
      "description": "IBM Certified Application Developer, co-founder of Bucharest Software Craftsmanship Community",
      "biography": "Ana-Maria Mihalceanu is a custom application development enthusiast, co-founder of Bucharest Software Craftsmanship Community and a constant adopter of challenging technical scenarios. Some of her older experiments are available on Dzone. In 2016, as tech passionate of cloud application development she achieved IBM Certified Application Developer - Cloud Platform v1. Since then, she has enriched her cloud expertise by learning and certifying with other offerings (Salesforce, OpenShift) in order to attain a better understanding on how to integrate different cloud applications and services. Other passions? The knowledge hunt through reading and improving her fashion sense through shopping.",
      "image": "assets/img/speakers/ana-maria-mihalceanu.jpg",
      "ref": "c93a48ea7c1d8a91f60be490b32b9357f77d8212",
      "url": "infoSpeaker.html?ref=c93a48ea7c1d8a91f60be490b32b9357f77d8212",
      "homepage": "",
      "twitter": "@ammbra1508",
      "linkedin": ""
    }
  ]
}