{
  "ticket_section_title": "buy a ticket",
  "ticket_section_desc": "Do not miss the opportunity to participate in this event and to immerse yourself in 3-days interesting talks on Java, JVM and open-source technologies. <br/><b>All Prices Include:</b><br/> Access to talks and workshops for 3 days <br/>Access to networking party on Monday, <br/>Welcome pack, Coffee breaks and lunches for Monday and Tuesday, Raffles of sponsors products.",
  "ticket_01_label": "<strike>Early Bird</strike>",
  "ticket_01_desc": "Limited to <strong>80 tickets</strong> available until 1st of March.",
  "ticket_02_label": "Standard",
  "ticket_02_desc": "Limited to <strong>200 tickets</strong> available until 1st of May.",
  "ticket_03_label": "Late Bird",
  "ticket_03_desc": "Starting 1st of May or upon standard ticket exhaustion.",
  "counter_01_label": "Conference",
  "counter_01_number": "01",
  "counter_02_label": "Days",
  "counter_02_number": "03",
  "counter_03_label": "Tracks",
  "counter_03_number": "04",
  "counter_04_label": "Sponsors",
  "counter_04_number": "25",
  "counter_05_label": "Speakers",
  "counter_05_number": "64",
  "counter_06_label": " &gt; Java Lovers",
  "counter_06_number": "300",
  "event_what_is_title": "What is the Java Barcelona Conference?",
  "event_what_is_desc": "Three days to share knowledge and experiences, meet enthusiasts and geeks and learn about new technologies related to the JVM.",
  "event_what_is_full": "",
  "event_why_participate_title": "Why Should I Participate?",
  "event_why_participate_desc": "This conference is the perfect stage to discover how others are using your favourite VM. There is something interesting for any kind of tech passionate: <br/> from(Java).to(Scala).or(Groovy).in(Open_Source).or(JCP)",
  "event_why_participate_full": "",
  "travel_subtitle": "Barcelona, the capital of Catalonia, is a Mediterranean and cosmopolitan city with Roman remains, medieval quarters and the most beautiful examples of 20th century Modernism.",
  "travel_title": "Take a view over the conference area.",
  "travel_desc": "Barcelona is internationally well-known for its great climate, incredible beaches, stunning architecture, delicious tapas and its successful football team.",
  "travel_transportation": "~23 minutes from the Airport by <b>Metro L9S</b> to <b>Europa Fira</b> station, <br/> followed by a 10 minutes walk towards Gran Via 2 Mall.",
  "travel_accommodation": "We have prepared several discounts at hotels nearby.",
  "travel_food": "Coffee, Water & Lunch will be provided at the venue.</br> Additionally the food court in the building can satisfy any needs.",
  "sponsors_desc": " Are you a technology company? Interested in meeting enthusiasts and geek people for technology? <br/>This is a <b>priceless opportunity</b> to participate in the first big Java and JVM conference in Spain, to promote your company and to support technological communities. <br/>Please contact us for more information for sponsoring at <b>info@barcelonajug.org</b>",
  "speakers_desc": "Speakers coming from all corners of the world join us to share their experience in various technologies and to invite everyone to participate in Open Source Technologies and in the JCP."
}