{
  "og_title":"JBCNConf - The big JVM conference in Spain",
  "og_description": "11-13 of June, Barcelona will be the host for three days to share knowledge and experiences, meet enthusiasts and geeks and learn about new technologies.",
  "og_image": "/assets/img/logos/og-image.png",
  "ticket_section_title": "buy a ticket",
  "ticket_section_desc": "Do not miss the opportunity to participate in this event and to immerse yourself in 3-days interesting talks on Java, JVM and open-source technologies. <br/><b>All Prices Include:</b><br/> Access to talks and workshops for 3 days <br/>Welcome pack, Coffee breaks and lunches for Monday and Tuesday, Raffles of sponsors products.",
  "ticket_01_label": "Early Bird",
  "ticket_01_desc_": "Limited to <strong>80 tickets</strong> available until 1st of March.",
  "ticket_02_label": "Standard",
  "ticket_02_desc_": "Limited to <strong>200 tickets</strong> available until 1st of May.",
  "ticket_03_label": "Late Bird",
  "ticket_03_desc_": "Starting 1st of May or upon standard ticket exhaustion.",
  "counter_01_label": "Days",
  "counter_01_number": "03",
  "counter_02_label": "Tracks",
  "counter_02_number": "04",
  "counter_03_label": "Speakers",
  "counter_03_number": "54",
  "counter_04_label": " &gt; Java Lovers",
  "counter_04_number": "500",
  "event_what_is_title": "What is the Java Barcelona Conference?",
  "event_what_is_desc": "Three days to share knowledge and experiences, meet enthusiasts and geeks and learn about new technologies related to the JVM in English.",
  "event_what_is_full": "<p> The JBCN Conf is the yearly event organised by the non-profit Java User Group Barcelona between <b>11-13 of June</b>. <br/> Conference Talks will held from Monday 11th to Tuesday 12th and Workshops will run on Wednesday 13st.  </p> <p><b>Topics</b> are related to the Java World and related technologies: #Java #JVM langs (Scala/Cloujure/Groovy/Kotlin...) #Functional Programming #Microservices #Docker #Kubernetes #Mesos #Marathon #JavaFX #DevOps #Testing #DDD #TDD #CI #CD #noSQL #SOA #Cloud #Mobile #Integration #Architecture #Scalability #IoT #Actors #Concurrency #cryptocurrencies #blockchain #machine learning </br> <p><b>Code of conduct:</b><br/> Our conference is dedicated to providing a harassment-free conference experience for everyone, regardless of gender, gender identity and expression, age, sexual orientation, disability, physical appearance, body size, race, ethnicity, religion (or lack thereof), or technology choices. <br/> We do not tolerate harassment of conference participants in any form. Sexual language and imagery is not appropriate for any conference venue, including talks, workshops, parties, Twitter and other online media. Conference participants violating these rules may be sanctioned or expelled from the conference without a refund at the discretion of the conference organisers.</p>",
  "event_why_participate_title": "Why Should I Participate?",
  "event_why_participate_desc": "This conference is the perfect stage to discover how others are using your favourite VM. There is something interesting for any kind of tech passionate: <br/> from(Java).to(Scala).or(Groovy).in(Open_Source).or(JCP)",
  "event_why_participate_full": "<p>Admired Java developers gather from around the world to talk about their insights, innovations, and the developments they’ve been working on since the previous year. </br> This year we will be joined by key note speakers Venkat Subramaniam and Sandro Mancuso, famous open source contributors such as Claus Ibsen and Alex Soto, but also by the Chair of the Java Community Process Heather VanCura. <br/> This is your chance to interact with like-minded Java enthusiasts and to recharge your batteries in the beautiful Barcelona.</p> <p> The full schedule will be released 2-3 weeks before the event. Meanwhile, we invite you to check out the speakers below on the page. </p>",
  "networking_event_": "Starting on Monday at 20:00 on the BEACH! <br/>",
  "travel_subtitle": "Barcelona, the capital of Catalonia, is a Mediterranean and cosmopolitan city with Roman remains, medieval quarters and the most beautiful examples of 20th century Modernism.",
  "travel_title": "Take a view over the conference area.",
  "travel_desc": "Barcelona is internationally well-known for its great climate, incredible beaches, stunning architecture, delicious tapas and its successful football team.",
  "travel_transportation": "",
  "travel_accommodation": "",
  "travel_food": "Coffee, Water & Lunch will be provided at the venue.</br> Additionally the food court in the building can satisfy any needs.",
  "sponsors_desc": " Are you a technology company? Interested in meeting enthusiasts and geek people for technology? <br/>This is a <b>priceless opportunity</b> to participate in the first big Java and JVM conference in Spain, to promote your company and to support technological communities. <br/>Please contact us for more information for sponsoring at <b>info@barcelonajug.org</b>",
  "speakers_desc": "Speakers coming from all corners of the world join us to share their experience in various technologies and to invite everyone to participate in Open Source Technologies and in the JCP."
}
